{
    "16": {
        "round#0": [
            [
                "Q: \"Here comes a perfectly valid argument: To start with, nobody is neither a frequent consumer of Herbal Essences shampoo nor an occasional purchaser of Clairol shampoo. Now, whoever is not an owner of a René Furterer shampoo is an occasional purchaser of Clairol shampoo. Moreover, every frequent consumer of Protex soap is not an owner of a René Furterer shampoo or not a frequent consumer of Herbal Essences shampoo. From this follows: Every frequent consumer of Protex soap is an occasional purchaser of Clairol shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5147"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: If someone is not a great-grandfather of Cecil, then that person is not a brother of Benny or not a schoolmate of Donald. Whoever is not an uncle of Grant is a schoolmate of Donald. Being a brother of Benny is necessary for not being an uncle of Grant. Therefore, whoever is not an uncle of Grant is a great-grandfather of Cecil.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#12113"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, being a workmate of Calvin is sufficient for not being a grandson of Dennis. Second, every schoolmate of Ricardo is a classmate of Erik or a workmate of Calvin. Third, being a classmate of Erik is sufficient for not being a grandson of Dennis. Hence, being a schoolmate of Ricardo is sufficient for not being a grandson of Dennis.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20610"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, being a cousin of Roy is necessary for being a cousin of Chad. Now, there is somebody who is an uncle of Rene and, in addition, not a schoolmate of Dave or not a cousin of Roy. Moreover, every cousin of Chad is a schoolmate of Dave. So, necessarily, some uncle of Rene is not a cousin of Chad.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22587"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: To start with, there is somebody who is a follower of FC Spartak Trnava and a critic of AS Trenčín. Now, whoever is a friend of RCD Espanyol and an ex-supporter of FK Mladá Boleslav is not a critic of AS Trenčín. From this follows: There is somebody who is a follower of FC Spartak Trnava and not both a friend of RCD Espanyol and an ex-supporter of FK Mladá Boleslav.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#38"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, to be an ingredient of Blusher (Rebel) or an ingredient of CHEEK BLUSH CH03 is necessary for being an ingredient of Smurfs Tattoo. Moreover, being an ingredient of Blusher (Rebel) is necessary for not being an ingredient of Smurfs Tattoo. It follows that being an ingredient of Smurfs Tattoo is sufficient for being an ingredient of CHEEK BLUSH CH03.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4086"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: To start with, every admirer of FC Mariupol is an expert of FC Salzburg or, otherwise, neither an expert of FC Salzburg nor a backer of FC Olimpik Donetsk. Now, being a backer of FC Olimpik Donetsk is necessary for being an admirer of FC Mariupol. Hence, being an admirer of FC Mariupol is sufficient for being an expert of FC Salzburg.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#2918"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: First, it is not the case that Colleen is a friend of FC Basel 1893. Second, being an ex-supporter of Real Betis Balompié is sufficient for not being a friend of FC Basel 1893. Therefore, Colleen is not an ex-supporter of Real Betis Balompié.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20632"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, every stepbrother of Efrain is a brother of Mark or a close friend of Dewayne. Now, whoever is not a brother of Mark is a nephew of Abraham. Moreover, whoever is not a close friend of Dewayne is a nephew of Abraham. All this entails that being a stepbrother of Efrain is sufficient for being a nephew of Abraham.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19969"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, every schoolmate of Rosaura is a great-grandmother of Stephanie or a close friend of Pricilla or a close friend of Christian. Moreover, being a schoolmate of Rosaura is sufficient for not being a great-grandmother of Stephanie. It follows that to be a close friend of Pricilla or a close friend of Christian is necessary for being a schoolmate of Rosaura.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26198"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First premise: Somebody is a workmate of Matilda and not a classmate of Mildred. Second premise: Everyone who is a classmate of Sara is a classmate of Mildred, too. From this follows: There is somebody who is a workmate of Matilda and not a classmate of Sara.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21868"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, no close friend of Cheryl who is a sister of Jeanette is a schoolmate of Patricia. Next, no schoolmate of Patricia is a niece of Winnie. So, necessarily, whoever is a sister of Jeanette and a close friend of Cheryl is also a niece of Winnie.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25164"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, no aunt of Dawn is a great-grandmother of Carol. Moreover, being a great-grandmother of Carol is necessary for being a sister of Christy. All this entails that being a sister of Christy is sufficient for not being an aunt of Dawn.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16666"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: No owner of a Ivory soap who is a rare consumer of Bio Ionic shampoo is a loyal buyer of Aveeno shampoo. In consequence, no loyal buyer of Aveeno shampoo is an owner of a Ivory soap or a rare consumer of Bio Ionic shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22590"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First of all, every ancestor of Gary is a cousin of Ned and a nephew of Fernando. Next, Chester is a nephew of Fernando. So, necessarily, Chester is an ancestor of Gary.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#175"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: To begin with, nobody is neither an admirer of İstanbul Başakşehir nor an admirer of HNK Hajduk Split. Moreover, whoever is a fan of Fenerbahçe SK and an opponent to Everton FC is not an admirer of HNK Hajduk Split. Therefore, every opponent to Everton FC who is a fan of Fenerbahçe SK is also an admirer of İstanbul Başakşehir.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27004"
            ]
        ],
        "round#1": [
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First, it is not the case that Lucy is a close friend of Ella. Second, being an ancestor of Vicki or a cousin of Anita is sufficient for being a close friend of Ella. It follows that Lucy is neither an ancestor of Vicki nor a cousin of Anita.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10595"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, no owner of a Canus soap is a regular consumer of Dove soap. Now, whoever is not an owner of a Tocca soap is however a frequent consumer of Nioxin shampoo or a regular consumer of Dove soap. Moreover, being an owner of a Canus soap is sufficient for not being a frequent consumer of Nioxin shampoo. From this follows: No owner of a Tocca soap is an owner of a Canus soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13558"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, being a half-brother of Charles is necessary for not being a brother of Chester. Now, every brother of Chester is either a half-brother of Charles or a son of Clifford, or both. We may conclude that being a brother of Chester is sufficient for being a son of Clifford.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9856"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, being an ancestor of Francis or not being a classmate of Rich is sufficient for being a classmate of Ron. Next, Ernest is a classmate of Rich. All this entails that it is not the case that Ernest is a classmate of Ron.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19837"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, every stepbrother of Bobby is a brother of Gregory or a grandson of Bruce or an ancestor of Fidel. Second, being a grandson of Earl is necessary for being a grandson of Bruce. Third, whoever is a brother of Gregory is not a grandson of Earl. In consequence, every stepbrother of Bobby is an ancestor of Fidel or, otherwise, neither an ancestor of Fidel nor a grandson of Earl.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13826"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First premise: Being an admirer of İstanbul Başakşehir is sufficient for not being an opponent to Celtic FC. We may conclude that nobody is neither an opponent to Celtic FC nor an admirer of İstanbul Başakşehir.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1620"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First premise: Coal tar extract is not an ingredient of The Silk Canvas. Second premise: Being an ingredient of Cream Blush or an ingredient of The Silk Canvas is sufficient for being an ingredient of finishing powder. Therefore, it is false that Coal tar extract is an ingredient of finishing powder.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8721"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First, being a frequent consumer of Burt's Bees soap is necessary for being an infrequent user of Pre De Provence soap. Second, some frequent consumer of Burt's Bees soap is not a frequent consumer of Infusium shampoo. So, necessarily, there is somebody who is a frequent consumer of Infusium shampoo and not an infrequent user of Pre De Provence soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23790"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, no grandson of Derek is an ancestor of Harry. Now, every nephew of Clinton is an ancestor of Harry. Moreover, whoever is both a cousin of Jon and a son of Juan is a nephew of Clinton or a grandson of Derek.from this follows: No cousin of Jon who is a son of Juan is an ancestor of Harry.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17548"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, whoever is a regular consumer of The Body Shop soap or a rare consumer of South of France soap is a loyal buyer of Biosilk shampoo. Now, Erin is a rare consumer of South of France soap. In consequence, Erin is a loyal buyer of Biosilk shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27851"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, whoever is both a half-brother of Chester and an ancestor of Lowell is an ancestor of Kevin or a workmate of Darrin.moreover, no ancestor of Kevin is a half-brother of Chester and, in the same time, an ancestor of Lowell. Hence, every half-brother of Chester who is an ancestor of Lowell is also a workmate of Darrin.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1672"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, it is false that Tiffani is a great-grandmother of Aimee. Moreover, every granddaughter of Ann is a workmate of Shanika and a great-grandmother of Aimee. In consequence, Tiffani is not a granddaughter of Ann.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27334"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First of all, not being a friend of AIK is sufficient for not being an opponent to FC Schalke 04. We may conclude: Everyone who is an opponent to FC Schalke 04 is a friend of AIK, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16474"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To start with, being an ingredient of YSL Lip Liner is sufficient for being an ingredient of The Final Touch. Now, everything that is an ingredient of Eye Shadow (Petal) is an ingredient of The Final Touch, too. From this follows: Being an ingredient of Eye Shadow (Petal) is necessary for being an ingredient of YSL Lip Liner.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23030"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, whatever is an ingredient of SILK PEELING POWDER is not an ingredient of No Blush Blush. Second, being an ingredient of SILK PEELING POWDER is sufficient for not being an ingredient of Watt's Up!. Third, something that is not an ingredient of General Lotion Soap is an ingredient of Watt's Up! or an ingredient of No Blush Blush. It follows that being an ingredient of General Lotion Soap is sufficient for not being an ingredient of SILK PEELING POWDER.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25700"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: To begin with, every backer of PFC CSKA Moskva is a fan of Vitesse or a fan of Paris Saint-Germain. Moreover, everyone who is both a fan of Vitesse and a fan of Paris Saint-Germain is a backer of PFC CSKA Moskva or an expert of Burnley FC. We may conclude: Whoever is none of this: a fan of Vitesse or fan of Paris Saint-Germain, is an expert of Burnley FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27508"
            ]
        ],
        "round#2": [
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Being a cousin of Maria is sufficient for being a close friend of Nichole. Second premise: Some schoolmate of Miranda is a granddaughter of Nancy and a close friend of Nichole. Third premise: Being a granddaughter of Nancy is necessary for being a cousin of Maria. Hence, somebody is a schoolmate of Miranda and a cousin of Maria.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21998"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, whoever is an uncle of Carl is not a grandson of Branden. Now, every uncle of Carl is not a nephew of Parker or not a grandson of Branden. We may conclude: Whoever is an uncle of Carl is not a nephew of Parker.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17303"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To start with, vitamin A palmitate is an ingredient of Modern Love. Now, whatever is an ingredient of Modern Love or an ingredient of Washout Shampoo is an ingredient of 13 EYE COLOUR MATTE. In consequence, vitamin A palmitate is an ingredient of 13 EYE COLOUR MATTE.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26142"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: No member of ŠK Slovan Bratislava is a follower of OGC Nice. Whoever is a member of ŠK Slovan Bratislava is not a devotee of Royal Antwerp FC. Every member of ŠK Slovan Bratislava is a devotee of Royal Antwerp FC or a backer of FC Zenit or a follower of OGC Nice. Therefore, being a backer of FC Zenit is necessary for being a member of ŠK Slovan Bratislava.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#985"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, whoever is not a brother of Steve is not both a half-brother of Gordon and a cousin of Rolando. Now, whoever is not a close friend of Tyree is a half-brother of Gordon. Moreover, being a cousin of Rolando is necessary for not being a close friend of Tyree. So, necessarily, whoever is not a close friend of Tyree is a brother of Steve.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13391"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, nobody is neither a stepbrother of Rich nor a great-grandfather of Danial. Next, being a great-grandfather of Danial is necessary for not being a son of Stefan. Plus,every schoolmate of Lewis is not a stepbrother of Rich or not a son of Stefan. All this entails that every schoolmate of Lewis is a great-grandfather of Danial.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15354"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: First premise: Whatever is an ingredient of Moonstone Glitter is not an ingredient of CHERRY GLOSS 52 RED. Second premise: Every ingredient of CHERRY GLOSS 52 RED is an ingredient of Moonstone Glitter or an ingredient of Dual Defense SPF 25. It follows that everything that is an ingredient of CHERRY GLOSS 52 RED is an ingredient of Dual Defense SPF 25, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25141"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First premise: Whatever is both an ingredient of I'm Snow Angel and an ingredient of Bitzy Body Shimmer is an ingredient of Lift the Veil or an ingredient of Mr Sandman.second premise: Every ingredient of Lift the Veil is neither an ingredient of Bitzy Body Shimmer nor an ingredient of I'm Snow Angel. Therefore, whatever is not both an ingredient of Bitzy Body Shimmer and an ingredient of I'm Snow Angel is an ingredient of Mr Sandman.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6231"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First of all, everything that is an ingredient of Eye Shadow (Solar) is an ingredient of Lash Magic Mascara, too. Next, being an ingredient of Lash Magic Mascara is necessary for being an ingredient of Refractive. Therefore, everything that is an ingredient of Refractive is an ingredient of Eye Shadow (Solar), too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26185"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: First, every ingredient of my blusher 16 is not an ingredient of Aromatherapy Wax or not an ingredient of FACIAL SCRUB. Second, being an ingredient of Enchanted Beauty is sufficient for being an ingredient of my blusher 16. It follows that every ingredient of Enchanted Beauty is neither an ingredient of FACIAL SCRUB nor an ingredient of Aromatherapy Wax.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15458"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First, being a close friend of Yvonne is sufficient for being a granddaughter of Alexandra. Second, being a granddaughter of Alexandra is necessary for being a half-sister of Rosa. Third, every great-grandmother of Nila is a close friend of Yvonne or a half-sister of Rosa. In consequence, everyone who is a great-grandmother of Nila is a granddaughter of Alexandra, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1541"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To start with, Norman is an uncle of Sal. Now, no nephew of Keith is an uncle of Sal or a son of Darrin. All this entails that it is not the case that Norman is a nephew of Keith.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#24950"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To begin with, whoever is an uncle of Cody is not a cousin of James. Therefore, whoever is a cousin of James is not an uncle of Cody.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#2282"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: No infrequent user of Clairol shampoo is a loyal buyer of Nexxus shampoo or a frequent consumer of Celtic Sea Salt soap. We may conclude that no frequent consumer of Celtic Sea Salt soap and no loyal buyer of Nexxus shampoo is an infrequent user of Clairol shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9489"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: No critic of Hapoel Beer-Sheva FC is a friend of AEK Larnaca FC. Every critic of Hapoel Beer-Sheva FC is not an expert of Brøndby IF or not a friend of AEK Larnaca FC. In consequence, being a critic of Hapoel Beer-Sheva FC is sufficient for not being an expert of Brøndby IF.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#28293"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: To begin with, no loyal buyer of Biosilk shampoo is a loyal buyer of Caswell-Massey soap. Moreover, whoever is not a loyal buyer of Caswell-Massey soap is an infrequent user of Lifebuoy soap. We may conclude: Being an infrequent user of Lifebuoy soap is necessary for being a loyal buyer of Biosilk shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20951"
            ]
        ],
        "round#3": [
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: Whoever is not a classmate of Alvin is a schoolmate of Wilburn. Whoever is not a son of Charles is however a stepbrother of Ivan or a schoolmate of Wilburn. Nobody is neither a classmate of Alvin nor a stepbrother of Ivan. It follows that whoever is not a classmate of Alvin is a son of Charles.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1442"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: To be an admirer of Yeni Malatyaspor or a devotee of Olympique Lyonnais is necessary for being a fan of RB Leipzig. No admirer of Yeni Malatyaspor is a fan of RB Leipzig. It follows that being a fan of RB Leipzig is sufficient for being a devotee of Olympique Lyonnais.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18280"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, being a great-grandfather of Corey is sufficient for being a great-grandfather of Dominic. Next, whoever is neither a half-brother of Carl nor a grandson of Rolando is a nephew of Ronald or a great-grandfather of Corey.plus,being a great-grandfather of Dominic is necessary for being a nephew of Ronald. Therefore, everyone who is not a great-grandfather of Dominic is a half-brother of Carl or not a grandson of Rolando.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16757"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, Trudi is not a workmate of Laurie. Second, no workmate of Laurie is a classmate of Tracey. All this entails that it is false that Trudi is a classmate of Tracey.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20107"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: First of all, being an ingredient of FELT TIP EYELINER is necessary for being an ingredient of Pink Lotion Soap. Next, whatever is ingredient of Ice - Eyesilk is at least one of these: an ingredient of Pink Lotion Soap, an ingredient of WONDERBLUR or an ingredient of Eye Shadow (Haze). Plus,every ingredient of WONDERBLUR is an ingredient of FELT TIP EYELINER. Finally, being an ingredient of Eye Shadow (Haze) is sufficient for being an ingredient of FELT TIP EYELINER. We may conclude: Everything that is an ingredient of Ice - Eyesilk is an ingredient of FELT TIP EYELINER, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1964"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: To begin with, it is false that Cocamide DEA is an ingredient of Earth Glow Gel. Moreover, no ingredient of Earth Glow Gel is an ingredient of Santa�s Belly. In consequence, Cocamide DEA is not an ingredient of Santa�s Belly.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#24934"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: It is false that Michel is a regular user of Suave shampoo. Whoever is not both a regular user of Suave shampoo and a loyal buyer of Softsoap soap is an owner of a Crafted soap. We may conclude: Michel is an owner of a Crafted soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23124"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Nobody is neither a frequent consumer of Revlon shampoo nor a rare consumer of Sexy Hair shampoo. Second premise: Being a rare consumer of Sexy Hair shampoo is sufficient for being a rare consumer of Schwarzkopf shampoo. We may conclude: Being a rare consumer of Schwarzkopf shampoo is necessary for not being a frequent consumer of Revlon shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6427"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First premise: Todd is a supporter of F91 Dudelange. Second premise: It is not the case that Todd is an opponent to AS Saint-Étienne. Third premise: Every opponent to AS Saint-Étienne who is a supporter of F91 Dudelange is also an ex-supporter of Manchester United FC. Therefore, it is not the case that Todd is an ex-supporter of Manchester United FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22238"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: To begin with, everyone who is an ex-supporter of Club Atlético de Madrid is a fan of FC Sion, too. Moreover, everyone who is both a friend of FC Admira Wacker Mödling and a friend of PAOK FC is an admirer of Feyenoord or an ex-supporter of Club Atlético de Madrid. Finally, being an admirer of Feyenoord is sufficient for being a fan of FC Sion. Hence, every friend of PAOK FC who is a friend of FC Admira Wacker Mödling is also a fan of FC Sion.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6782"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First of all, being an ingredient of COMPACT POWDER 01 is necessary for being an ingredient of Glamour to Go. Next, not being an ingredient of Avengers shampoo is sufficient for not being an ingredient of COMPACT POWDER 01. So, necessarily, being an ingredient of Avengers shampoo is necessary for being an ingredient of Glamour to Go.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20755"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Every rare consumer of American Crew shampoo is neither a rare consumer of Olay soap nor an owner of a Aussie shampoo. Second premise: Whoever is both a rare consumer of Olay soap and an owner of a Aussie shampoo is a rare consumer of American Crew shampoo or a regular user of René Furterer shampoo.we may conclude: Everyone who is not both an owner of a Aussie shampoo and a rare consumer of Olay soap is a regular user of René Furterer shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17339"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To begin with, some nephew of Francis is not both a half-brother of Steve and an ancestor of Vincent. Moreover, whoever is not a great-grandfather of Cecil is a nephew of Francis. Hence, some half-brother of Steve is an ancestor of Vincent and a great-grandfather of Cecil.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#28185"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: To begin with, it is not the case that Leola is a rare consumer of Lifebuoy soap. Moreover, no rare consumer of Organix Hair shampoo is a rare consumer of Lifebuoy soap. Hence, it is false that Leola is a rare consumer of Organix Hair shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10184"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To start with, every frequent consumer of Clearly Natural soap is not an owner of a Caress soap or not a regular consumer of Head & Shoulders shampoo. Now, nobody is neither a regular consumer of Head & Shoulders shampoo nor a regular user of Herbal Essences shampoo. Moreover, whoever is not an owner of a Caress soap is a regular user of Herbal Essences shampoo. It follows that every frequent consumer of Clearly Natural soap is a regular user of Herbal Essences shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22778"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First premise: Being an ingredient of The Wuss Bubble Bar or not being an ingredient of 6 Color Eyeshadow is sufficient for being an ingredient of PERFECTION PRIMER. Second premise: Phenacemide is an ingredient of 6 Color Eyeshadow. It follows that Phenacemide is not an ingredient of PERFECTION PRIMER.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#867"
            ]
        ],
        "round#4": [
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: First, whoever is not a member of PFC Ludogorets 1945 is a supporter of AEK Larnaca FC. Second, everyone who is a supporter of AEK Larnaca FC is a critic of 1. FC Köln, too. Hence, nobody is neither a member of PFC Ludogorets 1945 nor a critic of 1. FC Köln.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3694"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First, some great-grandmother of Terri is not a workmate of Cristi or not a classmate of Kenya. Second, being a great-grandmother of Terri is necessary for not being a daughter of Jana. From this follows: There is somebody who is a daughter of Jana and not both a workmate of Cristi and a classmate of Kenya.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#12710"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First premise: Every classmate of Mohammed is not a half-brother of Dave or not a schoolmate of Alexander. Second premise: Whoever is not both a schoolmate of Alexander and a half-brother of Dave is a classmate of Mohammed or a schoolmate of Jordon.we may conclude: Every schoolmate of Alexander who is a half-brother of Dave is also a schoolmate of Jordon.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11858"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: First, everyone who is an opponent to FC Mariupol is a friend of FK Austria Wien, too. Second, not every ex-supporter of Tottenham Hotspur is both a friend of FK Austria Wien and an ex-fan of BSC Young Boys. Third, everyone who is an opponent to FC Mariupol is an ex-fan of BSC Young Boys, too. So, necessarily, some ex-supporter of Tottenham Hotspur is not an opponent to FC Mariupol.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20308"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To begin with, nobody is neither a stepbrother of Jason nor a cousin of Christopher. In consequence, being a cousin of Christopher is sufficient for not being a stepbrother of Jason.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5246"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: To begin with, every ingredient of Java Java is not an ingredient of Spray Nail and not an ingredient of lip2cheek. All this entails that no ingredient of lip2cheek and no ingredient of Spray Nail is an ingredient of Java Java.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20077"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: To begin with, no expert of Aberdeen FC is a critic of Juventus. All this entails that being an expert of Aberdeen FC is necessary for not being a critic of Juventus.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9928"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To begin with, every grandson of Vernon who is a half-brother of Thomas is also a son of Cory. Moreover, being a nephew of Wilbur is sufficient for not being a grandson of Vernon. Finally, no nephew of Wilbur is a half-brother of Thomas. Hence, being a nephew of Wilbur is sufficient for being a son of Cory.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8595"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, no stepsister of Sue is a granddaughter of Amy or an aunt of Annie. Now, Estelle is not an aunt of Annie. Moreover, it is false that Estelle is a granddaughter of Amy. In consequence, it is false that Estelle is a stepsister of Sue.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23956"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First premise: Everyone who is both a regular user of René Furterer shampoo and a frequent consumer of Dettol soap is a rare consumer of Garnier shampoo or an owner of a AXE shampoo. Second premise: Everyone who is a rare consumer of Garnier shampoo is a regular consumer of Bumble and bumble shampoo, too. Third premise: Being an owner of a AXE shampoo is sufficient for being a regular consumer of Bumble and bumble shampoo. We may conclude that every regular user of René Furterer shampoo who is a frequent consumer of Dettol soap is also a regular consumer of Bumble and bumble shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4315"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First of all, whatever is an ingredient of CREME PIGM 200 is not an ingredient of Hydrating Shampoo. Next, every ingredient of Unision that is an ingredient of 01 BRONZING POWDER is an ingredient of Rollerball Lip Balm or an ingredient of CREME PIGM 200. Plus,every ingredient of Rollerball Lip Balm is an ingredient of Hydrating Shampoo. We may conclude: Whatever is an ingredient of 01 BRONZING POWDER and an ingredient of Unision is not an ingredient of Hydrating Shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16902"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, being a fan of Go Ahead Eagles is sufficient for being a backer of FK Crvena zvezda. Second, whoever is an expert of Eintracht Frankfurt is not a backer of FK Crvena zvezda. It follows that whoever is a fan of Go Ahead Eagles is not an expert of Eintracht Frankfurt.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19145"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, every ingredient of 03 CONCEALER is neither an ingredient of LIP STICK nor an ingredient of Death & Decay 12g. So, necessarily, everything that is an ingredient of LIP STICK or an ingredient of Death & Decay 12g is not an ingredient of 03 CONCEALER.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16882"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First of all, not being a workmate of Oscar is sufficient for not being a schoolmate of Jeffery. From this follows: Everyone who is a schoolmate of Jeffery is a workmate of Oscar, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#724"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: Being an ingredient of Nightly Hydro-Lock is necessary for not being an ingredient of Baby Shampoo. Some ingredient of Nightly Hydro-Lock is not both an ingredient of CHOPSTICK PENCIL 17 and an ingredient of Glisten. It follows that there is something that is an ingredient of CHOPSTICK PENCIL 17, an ingredient of Glisten, and an ingredient of Baby Shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4234"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To start with, being a regular consumer of Nubian Heritage soap is necessary for being a regular consumer of TIGI shampoo. Now, some regular consumer of Mysore soap is an infrequent user of Pantene shampoo and a regular consumer of Nubian Heritage soap. Moreover, everyone who is a regular consumer of TIGI shampoo is an infrequent user of Pantene shampoo, too. Therefore, there is somebody who is a regular consumer of Mysore soap and a regular consumer of TIGI shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21445"
            ]
        ],
        "round#5": [
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To start with, everyone who is a schoolmate of Bernice is a daughter of Candida, too. Now, every close friend of Rosalie is a workmate of Esperanza or a schoolmate of Bernice or a daughter of Stephanie. Moreover, being a workmate of Esperanza is sufficient for not being a daughter of Candida. From this follows: There is no close friend of Rosalie who is a daughter of Candida yet not a daughter of Stephanie.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5757"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Everyone who is neither a cousin of Victor nor a classmate of Lance is a great-grandfather of Eric, though. Second premise: Tommy is neither a cousin of Victor nor a classmate of Lance. It follows that Tommy is a great-grandfather of Eric.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17125"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To start with, no daughter of Gisela is a great-grandmother of Beatriz. Now, whoever is a half-sister of Lucia and a great-grandmother of Beatriz is also a cousin of Yvonne.moreover, being a daughter of Gisela is sufficient for not being a half-sister of Lucia. It follows that being a daughter of Gisela is sufficient for being a cousin of Yvonne.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20291"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First premise: It is false that Joni is an ancestor of Lavina. Second premise: Being a great-grandmother of Marcia is sufficient for being an ancestor of Lavina. We may conclude that it is not the case that Joni is a great-grandmother of Marcia.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18760"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: To begin with, everyone who is neither a rare consumer of Infusium shampoo nor a loyal buyer of Bath & Body Works soap is not a regular consumer of Organic Fiji soap. Moreover, nobody is neither an infrequent user of Head & Shoulders shampoo nor a regular consumer of Organic Fiji soap. It follows that whoever is none of this: a rare consumer of Infusium shampoo or loyal buyer of Bath & Body Works soap, is an infrequent user of Head & Shoulders shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#28374"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: To begin with, every friend of SCR Altach is an expert of SL Benfica. Moreover, whoever is neither a backer of Arsenal FC nor a supporter of RC Celta de Vigo is a friend of SCR Altach. Therefore, whoever is none of this: a backer of Arsenal FC or supporter of RC Celta de Vigo, is an expert of SL Benfica.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9205"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: Everything that is an ingredient of Bioglitz Color 2N or an ingredient of Lip Pigment Preach is also an ingredient of 04 Bronzing Powder. Retinol is not an ingredient of Lip Pigment Preach. It follows that it is false that Retinol is an ingredient of 04 Bronzing Powder.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27872"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, Marya is not a sister of Hattie. Second, every sister of Hattie who is a schoolmate of Jean is also a classmate of Candace. Third, Marya is a schoolmate of Jean. We may conclude: It is not the case that Marya is a classmate of Candace.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23462"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, being an occasional purchaser of Nexxus shampoo is sufficient for being an occasional purchaser of L'Oreal shampoo. Now, whoever is not an infrequent user of Camay soap is an occasional purchaser of L'Oreal shampoo. Hence, whoever is not an occasional purchaser of Nexxus shampoo is an infrequent user of Camay soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#12893"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, whoever is stepbrother of Vincent is at least one of these: a close friend of Wilbur, an uncle of Sanford or a half-brother of Lowell. Second, every close friend of Wilbur is a son of Jeremy. Third, being a son of Jeremy is necessary for being a half-brother of Lowell. Fourth, everyone who is an uncle of Sanford is a son of Jeremy, too. We may conclude: Every stepbrother of Vincent is a son of Jeremy.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5654"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: There is somebody who is an owner of a Origins soap and not an occasional purchaser of Shiseido shampoo. Second premise: Nobody is neither an infrequent user of Aveeno shampoo nor an occasional purchaser of Shiseido shampoo. So, necessarily, some owner of a Origins soap is not an infrequent user of Aveeno shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3813"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First premise: Every occasional purchaser of Nioxin shampoo is not a regular user of TRESemmé shampoo or not an owner of a Redken shampoo. Second premise: Whoever is not both a regular user of TRESemmé shampoo and an owner of a Redken shampoo is an occasional purchaser of Nioxin shampoo or an owner of a Dettol soap.in consequence, every owner of a Redken shampoo who is a regular user of TRESemmé shampoo is also an owner of a Dettol soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10180"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: First premise: Every admirer of FC Shakhtar Donetsk is both a devotee of Malmö FF and an ex-fan of SønderjyskE. Second premise: It is false that Peter is a devotee of Malmö FF. We may conclude: Peter is not an admirer of FC Shakhtar Donetsk.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3017"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First, somebody is not a classmate of Shanika and, in addition, not an aunt of Elaine or not a stepsister of Santina. Second, whoever is not a sister of Carolyn is a classmate of Shanika. We may conclude: There is somebody who is a sister of Carolyn and not both an aunt of Elaine and a stepsister of Santina.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#24643"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, being a stepsister of Ashley is necessary for being a daughter of Lois. Now, everybody who is neither a daughter of Laurie nor a workmate of Kenya is however a daughter of Lois. Hence, whoever is none of this: a workmate of Kenya or daughter of Laurie, is a stepsister of Ashley.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13436"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: To begin with, no supporter of FK Jablonec is an ex-fan of Eintracht Frankfurt. Moreover, every critic of Hapoel Beer-Sheva FC is a supporter of FK Jablonec or an ex-fan of Royal Antwerp FC. Finally, no ex-fan of Royal Antwerp FC is an ex-fan of Eintracht Frankfurt. We may conclude: No critic of Hapoel Beer-Sheva FC is an ex-fan of Eintracht Frankfurt.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10571"
            ]
        ],
        "round#6": [
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Everyone who is a daughter of Courtney is a cousin of Ethel, too. Second premise: Nobody is neither a cousin of Lupe nor a daughter of Courtney. In consequence, being a cousin of Lupe is sufficient for not being a cousin of Ethel.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#7787"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To start with, Alton is not a loyal buyer of Fels-Naptha soap. Now, everyone who is a frequent consumer of Pacifica soap or an occasional purchaser of Kirk's soap is also a loyal buyer of Fels-Naptha soap. So, necessarily, it is not the case that Alton is a frequent consumer of Pacifica soap or an occasional purchaser of Kirk's soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23518"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First premise: Everyone who is a rare consumer of Celtic Sea Salt soap is a frequent consumer of Frederic Fekkai shampoo, too. Second premise: Everyone who is a regular consumer of Paul Mitchell soap is a frequent consumer of Frederic Fekkai shampoo, too. Third premise: Being a frequent consumer of Frederic Fekkai shampoo is necessary for being an infrequent user of Zest soap. Fourth premise: Whoever is loyal buyer of Kirk's soap is at least one of these: an infrequent user of Zest soap, a regular consumer of Paul Mitchell soap or a rare consumer of Celtic Sea Salt soap. We may conclude that every loyal buyer of Kirk's soap is a frequent consumer of Frederic Fekkai shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16368"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, whoever is a workmate of Deidre is not a stepsister of Maia and not a sister of Kari, either. Hence, whoever is a stepsister of Maia or a sister of Kari is not a workmate of Deidre.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#24023"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Not being an ingredient of ILM-Cleanser is sufficient for not being an ingredient of Amazon Flirt. Second premise: Whatever is not an ingredient of Kinky in Helsinki is an ingredient of Amazon Flirt. We may conclude: Being an ingredient of ILM-Cleanser is necessary for not being an ingredient of Kinky in Helsinki.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#700"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First, somebody is a granddaughter of Marilyn and a granddaughter of Christian. Second, everyone who is neither a schoolmate of Beverly nor a granddaughter of Christian is not a granddaughter of Christian. All this entails that some granddaughter of Marilyn is not a niece of Margie or not a schoolmate of Beverly.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20299"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To start with, no loyal buyer of Purpose soap is a regular consumer of Paul Mitchell shampoo. Now, every loyal buyer of Alterna Haircare shampoo who is a regular consumer of Paul Mitchell shampoo is also a rare consumer of René Furterer shampoo. Moreover, whoever is a loyal buyer of Purpose soap is not a loyal buyer of Alterna Haircare shampoo. We may conclude: Being a rare consumer of René Furterer shampoo is necessary for being a loyal buyer of Purpose soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#24786"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, whoever is not a son of Victor is a nephew of Tom. Moreover, being a close friend of Jeffery is necessary for not being a son of Victor. Finally, not being a nephew of Stanley is sufficient for being a nephew of Tom and a close friend of Jeffery. In consequence, being a nephew of Stanley is necessary for not being a son of Victor.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15298"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, whoever is not a close friend of Gladys is a cousin of Rhonda. Moreover, whoever is not a daughter of Agnes is a cousin of Rhonda. Finally, every workmate of Haley is not a daughter of Agnes or not a close friend of Gladys. All this entails that being a workmate of Haley is sufficient for being a cousin of Rhonda.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5223"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: Being a member of FC Girondins de Bordeaux is necessary for being an opponent to FK Žalgiris Vilnius. Not being an opponent to FC Shakhtar Donetsk is sufficient for not being a member of FC Girondins de Bordeaux. Therefore, being an opponent to FC Shakhtar Donetsk is necessary for not being an opponent to FK Žalgiris Vilnius.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5342"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, it is false that Brian is a friend of PAOK FC. Next, whoever is an admirer of AEK Athens FC is not a friend of PAOK FC. It follows that it is false that Brian is an admirer of AEK Athens FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15081"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Being a regular consumer of Camay soap is sufficient for being a regular consumer of Matrix shampoo. Second premise: Everyone who is a loyal buyer of Sexy Hair shampoo is a regular consumer of Matrix shampoo, too. All this entails that every regular consumer of Camay soap is a loyal buyer of Sexy Hair shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17523"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: It is not the case that Natalie is a granddaughter of Margie. Natalie is not a stepsister of Marie. Every close friend of Cindy is a granddaughter of Margie or a stepsister of Marie. Hence, it is false that Natalie is a close friend of Cindy.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23914"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: Every cousin of Jeremy is neither a close friend of Alexander nor a brother of Wilbur. From this follows: Whoever is none of this: a brother of Wilbur or close friend of Alexander, is a cousin of Jeremy.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18221"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To begin with, not being an ingredient of Pink Wink Laquer is sufficient for not being an ingredient of TINSEL MY FANCY. All this entails that being an ingredient of Pink Wink Laquer is necessary for being an ingredient of TINSEL MY FANCY.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1655"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: First, being a follower of SL Benfica is sufficient for being a fan of Inverness Caledonian Thistle FC. Second, to be an ex-supporter of FC BATE Borisov or a follower of SL Benfica is necessary for being a supporter of KAA Gent. Third, everyone who is an ex-supporter of FC BATE Borisov is a fan of Inverness Caledonian Thistle FC, too. Therefore, being a supporter of KAA Gent is sufficient for being a fan of Inverness Caledonian Thistle FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19077"
            ]
        ],
        "round#7": [
            [
                "Q: \"Here comes a perfectly valid argument: First, whoever is close friend of Inocencia is at least one of these: a sister of Doris, a workmate of Susan or a daughter of Patty. Second, everyone who is a workmate of Susan is a daughter of Anita, too. Third, every sister of Doris is a daughter of Anita. Therefore, every close friend of Inocencia is a daughter of Anita or a daughter of Patty.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5138"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, somebody is a brother of Joe and a half-brother of Ron. Now, being a schoolmate of Leslie is sufficient for not being a half-brother of Ron. So, necessarily, some brother of Joe is not a schoolmate of Leslie.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#12980"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: To begin with, no rare consumer of Paul Mitchell shampoo is a regular consumer of Bliss soap or an occasional purchaser of Aveda shampoo. Moreover, whoever is an occasional purchaser of Aveda shampoo is not an owner of a Herbal Essences shampoo. Finally, being a regular consumer of Bliss soap is sufficient for not being an owner of a Herbal Essences shampoo. We may conclude that whoever is a rare consumer of Paul Mitchell shampoo is not an owner of a Herbal Essences shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16226"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: To begin with, everything that is an ingredient of Artistry Eye Define is an ingredient of real fluid rouge  4, too. Moreover, every ingredient of Artistry Eye Define is an ingredient of real fluid rouge  4 or an ingredient of Lash Magic Mascara or an ingredient of Duskglo. Hence, every ingredient of Artistry Eye Define is an ingredient of Lash Magic Mascara or an ingredient of Duskglo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18293"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First, whatever is neither an ingredient of Drop Dead Gorgeous nor an ingredient of LE MARC LIP CREME is an ingredient of Peaches N Cream. Second, bisphenol A (BPA) is neither an ingredient of Drop Dead Gorgeous nor an ingredient of LE MARC LIP CREME. We may conclude: Bisphenol A (BPA) is an ingredient of Peaches N Cream.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#474"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: It is false that Lavinia is a member of FK Žalgiris Vilnius. No friend of Go Ahead Eagles is a member of FK Žalgiris Vilnius. So, necessarily, it is not the case that Lavinia is a friend of Go Ahead Eagles.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16636"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, no ingredient of Water Lily is both an ingredient of The Night Is Young and an ingredient of Rock Star. Next, every ingredient of The Night Is Young that is an ingredient of Rock Star is an ingredient of Water Lily or an ingredient of Lip Gloss Compact. From this follows: Whatever is an ingredient of The Night Is Young and an ingredient of Rock Star is also an ingredient of Lip Gloss Compact.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5719"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: Every ingredient of Thataway is an ingredient of Lip Gloss Be Joyful or an ingredient of Wax Strip(s). No ingredient of Compact Makeup is an ingredient of Lip Gloss Be Joyful or an ingredient of Wax Strip(s). In consequence, no ingredient of Thataway is an ingredient of Compact Makeup.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15663"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: First premise: Every ingredient of Carnivale Laquer is neither an ingredient of Brightening Serum nor an ingredient of Fashion Forward. Second premise: Every ingredient of Chain Reaction is either an ingredient of Fashion Forward or an ingredient of Brightening Serum, or both. From this follows: Being an ingredient of Chain Reaction is sufficient for not being an ingredient of Carnivale Laquer.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3735"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: First premise: Every frequent consumer of Tocca soap is not a regular consumer of Lever soap or not an occasional purchaser of Schwarzkopf shampoo. Second premise: Every regular consumer of Pacifica soap is a regular consumer of Lever soap or an occasional purchaser of Schwarzkopf shampoo. So, necessarily, being a regular consumer of Pacifica soap is sufficient for not being a frequent consumer of Tocca soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25086"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, everyone who is a workmate of Shaunda is a sister of Rosaura, too. Now, some sister of Rosaura is not a cousin of Debra. From this follows: Some cousin of Debra is not a workmate of Shaunda.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22027"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First premise: Being an ex-supporter of Rio Ave FC is sufficient for not being a critic of Club Brugge. Second premise: To be an ex-fan of FC Zorya Luhansk or an ex-supporter of Rio Ave FC is necessary for being an opponent to FC Zürich. Third premise: Being an ex-fan of FC Zorya Luhansk is sufficient for not being a critic of Club Brugge. All this entails that no opponent to FC Zürich is a critic of Club Brugge.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#14526"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To begin with, whoever is both an infrequent user of Dawn soap and a rare consumer of Yardley London soap is a frequent consumer of Suave shampoo or a loyal buyer of Frederic Fekkai shampoo.moreover, to be an infrequent user of Dawn soap or a rare consumer of Yardley London soap is necessary for being a frequent consumer of Suave shampoo. Therefore, whoever is none of this: an infrequent user of Dawn soap or rare consumer of Yardley London soap, is a loyal buyer of Frederic Fekkai shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11223"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: Every ingredient of Equinox Shampoo that is an ingredient of Blusher (Rebel) is not an ingredient of Lust Soap. Some ingredient of CHEEK CRAYON is an ingredient of Lust Soap. We may conclude that not every ingredient of CHEEK CRAYON is both an ingredient of Equinox Shampoo and an ingredient of Blusher (Rebel).\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27465"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: Being an ingredient of Volumising Shampoo is sufficient for not being an ingredient of MODE GLOSS MG03. There is something that is an ingredient of PINK Shimmer Lotion and an ingredient of MODE GLOSS MG03. We may conclude that not every ingredient of PINK Shimmer Lotion is an ingredient of Volumising Shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1641"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, Bonnie is not a backer of FC Astra Giurgiu. Next, every friend of Club Atlético de Madrid is a follower of FC Midtjylland or a backer of FC Astra Giurgiu. Plus,it is false that Bonnie is a follower of FC Midtjylland. It follows that Bonnie is not a friend of Club Atlético de Madrid.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18350"
            ]
        ],
        "round#8": [
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, being an opponent to FC Astana is necessary for not being a friend of FC Luzern. All this entails that no opponent to FC Astana is a friend of FC Luzern.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6797"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, being an ancestor of Nichole or a stepsister of Bev is sufficient for being a schoolmate of Inocencia. Next, Shirley is a stepsister of Bev. Therefore, Shirley is a schoolmate of Inocencia.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19255"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: To start with, being an admirer of KV Oostende is necessary for not being a backer of RCD Espanyol. Now, someone who is not an admirer of BSC Young Boys is an opponent to SCR Altach or an admirer of KV Oostende. Moreover, nobody is neither a backer of RCD Espanyol nor an opponent to SCR Altach. We may conclude that whoever is not a backer of RCD Espanyol is an admirer of BSC Young Boys.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1841"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First, being a brother of Kermit is sufficient for being a cousin of Roy. From this follows: Not being a cousin of Roy is sufficient for not being a brother of Kermit.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18376"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First premise: Every loyal buyer of TRESemmé shampoo is not a regular consumer of Pacifica soap or not an infrequent user of Pureology shampoo. Second premise: Being an infrequent user of Ivory soap is sufficient for being a loyal buyer of TRESemmé shampoo. All this entails that every infrequent user of Ivory soap is an infrequent user of Pureology shampoo and a regular consumer of Pacifica soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18859"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: First of all, every ingredient of SILKY EYE PENCIL 28 that is an ingredient of Brazilian Shave Gel is also an ingredient of Tattoo - Spiderman. Next, everything that is an ingredient of Tattoo - Spiderman is an ingredient of Renewal Cream, too. We may conclude: Every ingredient of Brazilian Shave Gel that is an ingredient of SILKY EYE PENCIL 28 is also an ingredient of Renewal Cream.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#2588"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First of all, nothing is neither an ingredient of GLOW SHOT MASK nor an ingredient of Lip Color Cream. Next, nothing is neither an ingredient of GLOW SHOT MASK nor an ingredient of Chocolate Moose. Plus,whatever is not an ingredient of CHI Pliable Polish is not both an ingredient of Chocolate Moose and an ingredient of Lip Color Cream. From this follows: Being an ingredient of CHI Pliable Polish is necessary for not being an ingredient of GLOW SHOT MASK.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25902"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First of all, being an ex-fan of Maccabi Tel-Aviv FC is necessary for not being an ex-supporter of FK Mladá Boleslav. Next, nobody is neither a supporter of Qarabağ FK nor an ex-supporter of FK Mladá Boleslav. From this follows: Every supporter of Qarabağ FK is an ex-fan of Maccabi Tel-Aviv FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17380"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, whoever is not an ancestor of Dean is a stepbrother of Jason. Now, whoever is a brother of Rolando and a son of Brian is not a stepbrother of Jason. In consequence, everyone who is both a brother of Rolando and a son of Brian is an ancestor of Dean, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13303"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, being a half-brother of Bradford is sufficient for being a cousin of Glenn. Next, not being a son of Andy is sufficient for not being a cousin of Glenn. Hence, being a half-brother of Bradford is sufficient for being a son of Andy.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#28208"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, everyone who is a regular consumer of Camay soap is an owner of a Garnier shampoo, too. So, necessarily, not being an owner of a Garnier shampoo is sufficient for not being a regular consumer of Camay soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6122"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, every close friend of Alan is not a cousin of Cecil or not a cousin of Barton. Next, being a close friend of Alan is sufficient for not being a cousin of Barton. Hence, no close friend of Alan is a cousin of Cecil.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27135"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: Everyone who is a classmate of Kerstin or a great-grandmother of Miriam is not an ancestor of Arnetta. It is false that Kym is an ancestor of Arnetta. So, necessarily, Kym is a classmate of Kerstin or a great-grandmother of Miriam.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18763"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, every ingredient of 01 FRUITY LIPSTICK is not an ingredient of Revitalizing Mask 2 and not an ingredient of Legendary Lashes. It follows that whatever is an ingredient of Legendary Lashes or an ingredient of Revitalizing Mask 2 is not an ingredient of 01 FRUITY LIPSTICK.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11375"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, Jerome is a half-brother of Hugh. Moreover, every grandson of Tony who is a half-brother of Hugh is also a half-brother of Frederick. Finally, Jerome is a grandson of Tony. It follows that Jerome is a half-brother of Frederick.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8857"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, every admirer of FC Midtjylland is not an expert of Dundalk FC and not a backer of FC Spartak Trnava. Now, to be an expert of Dundalk FC or a backer of FC Spartak Trnava is necessary for being a friend of Getafe CF. From this follows: Being a friend of Getafe CF is sufficient for not being an admirer of FC Midtjylland.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10005"
            ]
        ],
        "round#9": [
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, being an ingredient of EYE SHADOW No104 or an ingredient of FOREVER SHINE 07 is sufficient for being an ingredient of Bionic Face Serum. Moreover, bisphenol A (BPA) is an ingredient of FOREVER SHINE 07. We may conclude: Bisphenol A (BPA) is an ingredient of Bionic Face Serum.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25023"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, Susan is a rare consumer of John Frieda shampoo. Now, every regular consumer of Nexxus shampoo is a rare consumer of Mysore soap and a rare consumer of John Frieda shampoo. Hence, Susan is a regular consumer of Nexxus shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#14868"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: First, every ingredient of Pink Fizz Lacquer is not an ingredient of 7 LIPLINER or not an ingredient of Karma Bubble Bar. Second, everything that is an ingredient of Karma Bubble Bar is an ingredient of ProGel - Minty Chip, too. Third, every ingredient of 7 LIPLINER is an ingredient of ProGel - Minty Chip. So, necessarily, everything that is an ingredient of Pink Fizz Lacquer is an ingredient of ProGel - Minty Chip, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26231"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Everything that is an ingredient of Ginger Cream is also an ingredient of Cowardly Lyin' and an ingredient of Bioglitz Color 9B. Second premise: Whatever is not an ingredient of Bioglitz Color 9B is an ingredient of The Rising Sun Soap. Third premise: Whatever is not an ingredient of Cowardly Lyin' is an ingredient of The Rising Sun Soap. So, necessarily, being an ingredient of Ginger Cream is sufficient for being an ingredient of The Rising Sun Soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1926"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, to be a grandson of Harvey or an uncle of James is necessary for being a cousin of Emmett. Next, no grandson of Harvey is a cousin of Emmett. So, necessarily, being an uncle of James is necessary for being a cousin of Emmett.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13654"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First of all, being an ingredient of Summer Pudding Soap is sufficient for being an ingredient of Happy Go Luck. Next, it is not the case that o-Phenylphenol is an ingredient of Summer Pudding Soap. We may conclude that it is not the case that o-Phenylphenol is an ingredient of Happy Go Luck.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11811"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: Lead acetate is not an ingredient of Cassis Rose Soap. Every ingredient of Headliner is an ingredient of Cassis Rose Soap and an ingredient of Power Paste. It follows that it is not the case that Lead acetate is an ingredient of Headliner.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#7431"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: To begin with, being an ingredient of Brazilian Shave Gel is sufficient for not being an ingredient of Rose Gel Polish. Moreover, whatever is an ingredient of my blusher 5 is not an ingredient of Brazilian Shave Gel. All this entails that whatever is an ingredient of my blusher 5 is not an ingredient of Rose Gel Polish.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18996"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, no niece of Esther is a stepsister of Diane or a half-sister of Cathy. Now, Miranda is a stepsister of Diane. Therefore, Miranda is not a niece of Esther.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10313"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: To start with, whatever is not an ingredient of Inner Vixen is an ingredient of Peachy soap. Now, nothing is neither an ingredient of SILKY EYE PENCIL 13 nor an ingredient of Peachy soap. Moreover, to be an ingredient of Inner Vixen or an ingredient of SILKY EYE PENCIL 13 is necessary for being an ingredient of Lipstick (Shell). All this entails that being an ingredient of Lipstick (Shell) is sufficient for being an ingredient of Peachy soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13760"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First, whoever is not a cousin of Darlene is however a workmate of Angie or a granddaughter of Erica. Second, being a granddaughter of Erica is necessary for not being a half-sister of Dianne. Third, being a workmate of Angie is necessary for not being a half-sister of Dianne. All this entails that nobody is neither a half-sister of Dianne nor a cousin of Darlene.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6528"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: Someone who is not a rare consumer of René Furterer shampoo is an infrequent user of Pacifica soap or an infrequent user of Pears soap. Being an infrequent user of Proactiv soap is sufficient for not being an infrequent user of Pears soap. Whoever is an infrequent user of Proactiv soap is not an infrequent user of Pacifica soap. From this follows: Whoever is a rare consumer of René Furterer shampoo is not an infrequent user of Proactiv soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1385"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, being an ingredient of WONDERBLUR is sufficient for not being an ingredient of Twinkle Toes. Next, every ingredient of Twinkle Toes is not an ingredient of Lovely Jubblies or an ingredient of WONDERBLUR. We may conclude: Being an ingredient of Lovely Jubblies is necessary for being an ingredient of Twinkle Toes.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19135"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, everything that is not both an ingredient of Purifying and an ingredient of Lip Chic is however an ingredient of Scrub Cleanser. Moreover, vitamin A palmitate is an ingredient of Purifying. All this entails that it is not the case that Vitamin A palmitate is an ingredient of Scrub Cleanser.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9126"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, there is somebody who is a brother of Lawrence and not a cousin of Ricardo. Moreover, every son of Williams is a cousin of Ricardo. From this follows: Somebody is a brother of Lawrence and not a son of Williams.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9202"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First premise: Being an aunt of Lindsay is necessary for not being a close friend of April. Second premise: Whoever is a workmate of Jeanne is not a close friend of April. In consequence, every workmate of Jeanne is an aunt of Lindsay.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15244"
            ]
        ],
        "round#10": [
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First premise: It is not the case that Gerald is a close friend of Arturo. Second premise: Every schoolmate of Fernando is neither a close friend of Arturo nor an uncle of Steve. Third premise: Gerald is not an uncle of Steve. From this follows: It is not the case that Gerald is a schoolmate of Fernando.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#796"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, every great-grandmother of Kelly is a cousin of Bev. Second, every great-grandmother of Kelly is a cousin of Bev or a close friend of Monica or a niece of Natalie. Third, every great-grandmother of Kelly is a niece of Natalie. It follows that every great-grandmother of Kelly is a close friend of Monica.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16333"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, every close friend of Ouida is neither a schoolmate of Dolores nor an ancestor of Laura. It follows that whoever is none of this: a schoolmate of Dolores or ancestor of Laura, is a close friend of Ouida.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9020"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: To start with, no member of APOEL FC is a member of FC Bayern München. Now, every member of FC Bayern München is not an ex-fan of KRC Genk or a member of APOEL FC. From this follows: Every member of FC Bayern München is an ex-fan of KRC Genk.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11224"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: To start with, being an owner of a Olay soap is necessary for not being an owner of a Aussie shampoo. Now, whoever is not an owner of a Aussie shampoo is an occasional purchaser of Paul Mitchell soap. Moreover, whoever is not a regular consumer of Infusium shampoo is not both an owner of a Olay soap and an occasional purchaser of Paul Mitchell soap. In consequence, nobody is neither an owner of a Aussie shampoo nor a regular consumer of Infusium shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1450"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: To start with, being an owner of a Dettol soap is sufficient for not being an infrequent user of Bio Ionic shampoo. Now, no owner of a Dettol soap is an owner of a Crafted soap. Moreover, someone who is not a regular user of Bath & Body Works soap is an owner of a Crafted soap or an infrequent user of Bio Ionic shampoo. We may conclude: Whoever is a regular user of Bath & Body Works soap is not an owner of a Dettol soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#12357"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First of all, beta-Myrcene is an ingredient of Sweet Hook Lacquer. Next, being an ingredient of Brow Sealer or not being an ingredient of Sweet Hook Lacquer is sufficient for being an ingredient of Colorful Eyeshadow. It follows that beta-Myrcene is not an ingredient of Colorful Eyeshadow.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5752"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To begin with, it is false that Henry is a close friend of Ramon. Moreover, whoever is an uncle of Charles or a son of Abraham is not a close friend of Ramon. It follows that Henry is an uncle of Charles or a son of Abraham.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#14629"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: First, not being a loyal buyer of Paul Mitchell shampoo is sufficient for being a frequent consumer of Infusium shampoo and a frequent consumer of CHI shampoo. Second, being a frequent consumer of CHI shampoo is necessary for not being an infrequent user of Matrix shampoo. Third, nobody is neither an infrequent user of Matrix shampoo nor a frequent consumer of Infusium shampoo. We may conclude: Being a loyal buyer of Paul Mitchell shampoo is necessary for not being an infrequent user of Matrix shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#24828"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First premise: Everyone who is an owner of a Neutrogena shampoo is a regular user of Mysore soap, too. Second premise: Some regular user of Bed Head shampoo is not both a regular user of Mysore soap and a regular user of Crafted soap. Third premise: Everyone who is an owner of a Neutrogena shampoo is a regular user of Crafted soap, too. We may conclude: Some regular user of Bed Head shampoo is not an owner of a Neutrogena shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27777"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: Every admirer of FC Arsenal Tula is not an opponent to West Ham United FC or not a backer of FC BATE Borisov. Whoever is both a backer of FC BATE Borisov and an opponent to West Ham United FC is an admirer of FC Arsenal Tula or a devotee of Burnley FC.in consequence, every opponent to West Ham United FC who is a backer of FC BATE Borisov is also a devotee of Burnley FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13195"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Every devotee of FC Vaduz is an ex-supporter of Burnley FC or an ex-fan of Vitesse. Second premise: Whoever is an ex-fan of Vitesse is not a devotee of FC Vaduz. It follows that being an ex-supporter of Burnley FC is necessary for being a devotee of FC Vaduz.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4955"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: First, everything that is an ingredient of Lip Liner Cartridge is an ingredient of Glamour to Go, too. Second, being an ingredient of 29th High St Soap is sufficient for not being an ingredient of Glamour to Go. Third, every ingredient of Gemstone - Sapphire is an ingredient of Texturizing Clay or an ingredient of Lip Liner Cartridge or not an ingredient of 29th High St Soap. Fourth, being an ingredient of Glamour to Go is necessary for being an ingredient of Texturizing Clay. From this follows: Being an ingredient of Gemstone - Sapphire is sufficient for being an ingredient of Glamour to Go.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6968"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: First, being an ingredient of H2O gloss lip gloss is necessary for not being an ingredient of Liquid Lips Madison. Second, something is an ingredient of Stay Perfect Primer and not an ingredient of H2O gloss lip gloss. Therefore, some ingredient of Stay Perfect Primer is an ingredient of Liquid Lips Madison.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#20572"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To begin with, every owner of a Nag Champa soap is not a regular user of Origins soap or not a loyal buyer of Dawn soap. Moreover, everyone who is not both a loyal buyer of Dawn soap and a regular user of Origins soap is an owner of a Nag Champa soap or a loyal buyer of KMS shampoo. Therefore, whoever is a loyal buyer of Dawn soap and a regular user of Origins soap is also a loyal buyer of KMS shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#24313"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: First of all, being an ingredient of Lip Balm Trio is necessary for being an ingredient of Natural Builder Gel. Next, every ingredient of Brite Prep FX is an ingredient of Lip Balm Trio. Plus,everything that is not an ingredient of Tinted Lip Balm and not an ingredient of First Kiss is an ingredient of Brite Prep FX or an ingredient of Natural Builder Gel. It follows that not being an ingredient of Lip Balm Trio is sufficient for being an ingredient of Tinted Lip Balm or not being an ingredient of First Kiss.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10169"
            ]
        ],
        "round#11": [
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First premise: Everyone who is a member of KV Oostende is an expert of Dundalk FC, too. Second premise: Nobody is neither an ex-supporter of AS Saint-Étienne nor a member of KV Oostende. It follows that being an expert of Dundalk FC is necessary for not being an ex-supporter of AS Saint-Étienne.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#28292"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: No close friend of Judith who is a half-sister of Brenda is an aunt of Toni. Being a sister of Dorethea is sufficient for being an aunt of Toni. All this entails that whoever is not a half-sister of Brenda and not a close friend of Judith is however a sister of Dorethea.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23102"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, every ingredient of Rubies On Ice is an ingredient of Sunscreen Top Coat. Now, every ingredient of Sunscreen Top Coat is an ingredient of 45 Second Top Coat or an ingredient of Iron Man 2 Tattoo. It follows that every ingredient of Rubies On Ice is an ingredient of 45 Second Top Coat or an ingredient of Iron Man 2 Tattoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#24378"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, whoever is not a stepbrother of Andrew is a classmate of Harry. Moreover, being a nephew of Harold is necessary for being a classmate of Harry. From this follows: Being a stepbrother of Andrew is sufficient for not being a nephew of Harold.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10137"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: Every ingredient of Cream of Crete is an ingredient of Diamond Dust. Every ingredient of eyeshadow trio is an ingredient of Diamond Dust. Whatever is both an ingredient of Bold & Brazen and an ingredient of Luxury Creme Serum is an ingredient of Cream of Crete or an ingredient of eyeshadow trio.we may conclude: Every ingredient of Luxury Creme Serum that is an ingredient of Bold & Brazen is also an ingredient of Diamond Dust.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16437"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First of all, every regular consumer of Celtic Sea Salt soap is not an infrequent user of Redken shampoo or not an occasional purchaser of Schwarzkopf shampoo. Next, being a regular consumer of Celtic Sea Salt soap is necessary for being an infrequent user of Infusium shampoo. Therefore, every infrequent user of Infusium shampoo is an occasional purchaser of Schwarzkopf shampoo and an infrequent user of Redken shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8538"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: First premise: Every frequent consumer of Biolage shampoo who is a regular consumer of Nag Champa soap is not a regular user of Yardley London soap. Second premise: There is somebody who is an infrequent user of Sexy Hair shampoo and a regular user of Yardley London soap. Hence, there exists an infrequent user of Sexy Hair shampoo who is not a regular consumer of Nag Champa soap or not a frequent consumer of Biolage shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19460"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First premise: Oliver is not a regular user of Organix Hair shampoo. Second premise: Everyone who is not both a regular user of Organix Hair shampoo and a rare consumer of Purpose soap is however a loyal buyer of Kiss My Face soap. We may conclude that Oliver is a loyal buyer of Kiss My Face soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#169"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First premise: Being an ingredient of Electric Slide is necessary for being an ingredient of Make Up Time. Second premise: Bisphenol A (BPA) is an ingredient of Electric Slide. Hence, bisphenol A (BPA) is an ingredient of Make Up Time.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22908"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, being a niece of Betty is necessary for being a workmate of Jean. Second, being a niece of Betty is necessary for being an ancestor of Debra. Third, everyone who is neither a niece of Miranda nor an aunt of Sharita is a workmate of Jean or an ancestor of Debra. Hence, someone who is not a niece of Betty is a niece of Miranda or an aunt of Sharita.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#7942"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, whoever is a regular consumer of The Body Shop soap or a rare consumer of South of France soap is a loyal buyer of Biosilk shampoo. Now, Erin is a rare consumer of South of France soap. In consequence, Erin is a loyal buyer of Biosilk shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27851"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To begin with, whatever is not an ingredient of Lacquer Mode is an ingredient of Silver, Eye Crayon. Moreover, some ingredient of Silver, Eye Crayon is not an ingredient of Tan My Hide or not an ingredient of Bigen Xpressive. It follows that some ingredient of Lacquer Mode is not both an ingredient of Tan My Hide and an ingredient of Bigen Xpressive.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#12263"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, nobody is neither an ancestor of Adam nor a close friend of Dave. Now, no nephew of Will is an ancestor of Adam and, in the same time, a grandson of Edward. Moreover, being a close friend of Dave is necessary for not being a grandson of Edward. We may conclude that being a close friend of Dave is necessary for being a nephew of Will.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21600"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, every grandson of Gustavo is neither a nephew of Edmundo nor a grandson of Tyree. It follows that whoever is none of this: a nephew of Edmundo or grandson of Tyree, is a grandson of Gustavo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25596"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: To begin with, every loyal buyer of KMS shampoo is not a rare consumer of Protex soap or not a regular consumer of Alterna Haircare shampoo. Moreover, to be a regular consumer of Alterna Haircare shampoo or a rare consumer of Protex soap is necessary for being an owner of a Garnier shampoo. We may conclude that whoever is an owner of a Garnier shampoo is not a loyal buyer of KMS shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18330"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To start with, every classmate of Lillian is a workmate of Laurie. Hence, being a workmate of Laurie is sufficient for being a classmate of Lillian.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16937"
            ]
        ],
        "round#12": [
            [
                "Q: \"Here comes a perfectly valid argument: First, every ingredient of LIPLINER PENCIL_RED is neither an ingredient of Shave Gel nor an ingredient of Unrefined Lacquer. Second, every ingredient of Baby Blue Lacquer is an ingredient of Shave Gel or an ingredient of Unrefined Lacquer. So, necessarily, no ingredient of Baby Blue Lacquer is an ingredient of LIPLINER PENCIL_RED.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27082"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First, not being an ex-supporter of FC Olexandriya is sufficient for not being a critic of FK Crvena zvezda. All this entails that not being a critic of FK Crvena zvezda is sufficient for not being an ex-supporter of FC Olexandriya.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22594"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Every close friend of Christy who is a daughter of Myra is not a daughter of Rosaura. It follows that no daughter of Rosaura is a daughter of Myra or a close friend of Christy.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16999"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Whoever is not a friend of FC Ufa and not a follower of Olympique de Marseille is not an expert of SønderjyskE, either. Second premise: Being an expert of SønderjyskE is necessary for not being a critic of Southampton FC. All this entails that whoever is none of this: a friend of FC Ufa or follower of Olympique de Marseille, is a critic of Southampton FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#24874"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, everyone who is a nephew of Lavern is a schoolmate of Andy, too. Next, there is somebody who is a brother of Arnold and not a schoolmate of Andy. We may conclude: Some brother of Arnold is not a nephew of Lavern.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#7144"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: Being a backer of FK Austria Wien is sufficient for being a backer of AS Monaco FC. Nobody is neither an opponent to FC Spartak Trnava nor a backer of FK Austria Wien. In consequence, whoever is an opponent to FC Spartak Trnava is not a backer of AS Monaco FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21711"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, being a sister of Mary is sufficient for being a half-sister of Patricia. Now, there is somebody who is an aunt of Glenda and a sister of Mary. From this follows: Somebody is an aunt of Glenda and a half-sister of Patricia.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18629"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, to be a niece of Marisa or an aunt of Maia is necessary for being a half-sister of Valerie. Second, every granddaughter of Mary is not an aunt of Maia or not a niece of Marisa. We may conclude that whoever is a half-sister of Valerie is not a granddaughter of Mary.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19776"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First premise: It is not the case that Safrole is an ingredient of Bioglitz Color 4RV or an ingredient of Cream Liner. Second premise: Every ingredient of Cream Liner that is not an ingredient of Bioglitz Color 4RV is an ingredient of Exfoliating Masque. So, necessarily, Safrole is an ingredient of Exfoliating Masque.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21158"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: Everything that is an ingredient of Go for the Glow is an ingredient of Make an Entrance, too. Being an ingredient of Make an Entrance is necessary for being an ingredient of Eye Shadow (Moody). Everything that is neither an ingredient of EYEBROW PENCIL EB02 nor an ingredient of Shu Uemura Glow On is an ingredient of Go for the Glow or an ingredient of Eye Shadow (Moody). It follows that whatever is not an ingredient of Make an Entrance is however an ingredient of EYEBROW PENCIL EB02 or an ingredient of Shu Uemura Glow On.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10319"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First, everyone who is both a niece of Aubrey and a close friend of Rhonda is not an aunt of Esperanza. We may conclude that every aunt of Esperanza is not a niece of Aubrey or not a close friend of Rhonda.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6286"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First of all, every aunt of Zenaida is a close friend of Rosa. Next, whoever is not a close friend of Rosa is a granddaughter of Tonya. We may conclude: Being an aunt of Zenaida is sufficient for not being a granddaughter of Tonya.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9085"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To start with, every infrequent user of Proactiv soap is both a regular consumer of Softsoap soap and a loyal buyer of Pureology shampoo. Now, it is not the case that Jasper is a regular consumer of Softsoap soap. In consequence, it is not the case that Jasper is an infrequent user of Proactiv soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#712"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, every sister of Marcie is a daughter of Ginger. Moreover, every granddaughter of Mildred who is a close friend of Susan is also a sister of Marcie. From this follows: Everyone who is both a close friend of Susan and a granddaughter of Mildred is a daughter of Ginger, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13020"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First premise: Being a fan of KF Skënderbeu is sufficient for being an expert of Real Madrid CF. Second premise: Everyone who is a fan of KF Skënderbeu is a devotee of Valencia CF, too. Third premise: There exists a devotee of Getafe CF who is not a devotee of Valencia CF or not an expert of Real Madrid CF. So, necessarily, some devotee of Getafe CF is not a fan of KF Skënderbeu.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8799"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: No ingredient of Artist Liner is an ingredient of Cosmetic Lad. Second premise: Being an ingredient of Bionic Tonic is sufficient for being an ingredient of Artist Liner. So, necessarily, being an ingredient of Bionic Tonic is sufficient for not being an ingredient of Cosmetic Lad.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9584"
            ]
        ],
        "round#13": [
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To start with, every classmate of Lillian is a workmate of Laurie. Hence, being a workmate of Laurie is sufficient for being a classmate of Lillian.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18115"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First of all, whoever is not a workmate of Tom is a brother of Harvey. Next, no brother of Armando is both a workmate of Tom and an ancestor of Solomon. Plus,nobody is neither an ancestor of Solomon nor a brother of Harvey. It follows that being a brother of Armando is sufficient for being a brother of Harvey.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23222"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First, every ingredient of Signature is not an ingredient of Cheek Color Duo or not an ingredient of Loose Eye Shadow. Second, every ingredient of Loose Eye Shadow that is an ingredient of Cheek Color Duo is an ingredient of Signature or an ingredient of Booster Caps. So, necessarily, whatever is an ingredient of Loose Eye Shadow and an ingredient of Cheek Color Duo is also an ingredient of Booster Caps.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8252"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, Loren is not an opponent to Villarreal CF. Moreover, every admirer of AEK Athens FC and every member of FC Ufa is an opponent to Villarreal CF. Therefore, Loren is neither an admirer of AEK Athens FC nor a member of FC Ufa.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19845"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, whoever is a stepsister of Candace is not a cousin of Sharon and not a granddaughter of Emma, either. We may conclude: Whoever is none of this: a cousin of Sharon or granddaughter of Emma, is a stepsister of Candace.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15292"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First premise: It is not the case that Tommy is a son of Ronny. Second premise: Everyone who is not both a son of Ronny and a great-grandfather of Wilburn is however a grandson of Chad. It follows that Tommy is a grandson of Chad.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26154"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, there is no opponent to F91 Dudelange who is a follower of VfL Borussia Mönchengladbach yet not a member of FK Sūduva. Second, whoever is a member of FK Sūduva is not an opponent to F91 Dudelange. We may conclude that being an opponent to F91 Dudelange is sufficient for being a follower of VfL Borussia Mönchengladbach.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22135"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Kathleen is a loyal buyer of South of France soap. Second premise: Everyone who is an infrequent user of Finesse shampoo is a loyal buyer of South of France soap, too. From this follows: Kathleen is an infrequent user of Finesse shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#14488"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, no workmate of Gene who is an uncle of Corey is a son of Gustavo. We may conclude that no son of Gustavo is a workmate of Gene or an uncle of Corey.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#2296"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, every follower of HŠK Zrinjski is neither an ex-supporter of FC Zorya Luhansk nor an ex-supporter of CFR 1907 Cluj. Next, every follower of Galatasaray AŞ is either an ex-supporter of FC Zorya Luhansk or an ex-supporter of CFR 1907 Cluj, or both. It follows that whoever is a follower of Galatasaray AŞ is not a follower of HŠK Zrinjski.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11585"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First premise: Being a loyal buyer of Celtic Sea Salt soap is necessary for being an infrequent user of Origins soap. Hence, not being a loyal buyer of Celtic Sea Salt soap is sufficient for not being an infrequent user of Origins soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27145"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To start with, every ingredient of Ice Blue Shampoo is either an ingredient of Pale Almond Powder or an ingredient of Lily Savon Soap, or both. Now, it is not the case that Ethylene oxide is an ingredient of Pale Almond Powder. Moreover, it is false that Ethylene oxide is an ingredient of Lily Savon Soap. So, necessarily, it is false that Ethylene oxide is an ingredient of Ice Blue Shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26138"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To start with, being an infrequent user of Sunsilk shampoo is necessary for being a regular user of Garnier shampoo. Now, not being an infrequent user of TRESemmé shampoo is sufficient for not being an infrequent user of Sunsilk shampoo. Therefore, everyone who is a regular user of Garnier shampoo is an infrequent user of TRESemmé shampoo, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3330"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First premise: No workmate of Priscilla is a workmate of Lois. From this follows: Nobody is neither a workmate of Lois nor a workmate of Priscilla.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17561"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First premise: Whatever is not an ingredient of 04 Eye Colour Matte is an ingredient of Frizz Free Serum. Second premise: Whatever is an ingredient of Miracle Lipstick and an ingredient of Tattoo - Cars is not an ingredient of Frizz Free Serum. It follows that whatever is none of this: an ingredient of Miracle Lipstick or ingredient of Tattoo - Cars, is an ingredient of 04 Eye Colour Matte.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6454"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: There is somebody who is an occasional purchaser of Organix Hair shampoo and an occasional purchaser of Joico shampoo. Everyone who is neither a loyal buyer of Revlon shampoo nor an occasional purchaser of Joico shampoo is not an occasional purchaser of Joico shampoo. Hence, there is somebody who is an occasional purchaser of Organix Hair shampoo and, in addition, not a rare consumer of Finesse shampoo or not a loyal buyer of Revlon shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19445"
            ]
        ],
        "round#14": [
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To begin with, nothing is neither an ingredient of Eyebrow (Blackout) nor an ingredient of Aluminum. Moreover, some ingredient of Aluminum is not both an ingredient of LIP & CHEEK DOLL and an ingredient of Bronzer. So, necessarily, there is something that is an ingredient of LIP & CHEEK DOLL, an ingredient of Bronzer, and an ingredient of Eyebrow (Blackout).\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#28364"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: To begin with, not being a member of CFR 1907 Cluj is sufficient for not being a devotee of FC Olexandriya. Moreover, being a fan of AS Roma is sufficient for being a devotee of FC Olexandriya. So, necessarily, being a fan of AS Roma is sufficient for being a member of CFR 1907 Cluj.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9267"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, every daughter of Cortney who is a niece of Yolanda is a stepsister of Kathryn or an ancestor of Mable. Next, every stepsister of Kathryn is neither a niece of Yolanda nor a daughter of Cortney. So, necessarily, everyone who is not both a niece of Yolanda and a daughter of Cortney is however an ancestor of Mable.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26729"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, being a loyal buyer of Vaseline soap is sufficient for being a loyal buyer of Olay soap. It follows that not being a loyal buyer of Olay soap is sufficient for not being a loyal buyer of Vaseline soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13907"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: Nobody is neither a workmate of Amy nor a granddaughter of Darlene. Whoever is not an aunt of Judy is a granddaughter of Darlene. Every half-sister of Pauline is either a workmate of Amy or an aunt of Judy, or both. So, necessarily, everyone who is a half-sister of Pauline is a granddaughter of Darlene, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#7160"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, being a nephew of Ariel is necessary for being a close friend of Terence. Now, whoever is a close friend of Terence is not a nephew of Ariel or a cousin of Joseph. We may conclude: Everyone who is a close friend of Terence is a cousin of Joseph, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3202"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First, it is false that Marvin is a friend of AS Saint-Étienne. Second, nobody is neither a friend of AS Saint-Étienne nor a fan of Hertha BSC Berlin. In consequence, Marvin is a fan of Hertha BSC Berlin.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#14763"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, no stepbrother of Ted is, in the same time, an uncle of Chester without being a grandson of Jonathan. Moreover, every stepbrother of Ted is an uncle of Chester. From this follows: Everyone who is a stepbrother of Ted is a grandson of Jonathan, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1444"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First of all, whoever is a classmate of Calvin is not a cousin of Earl. Next, it is false that Bryan is a cousin of Earl. It follows that it is not the case that Bryan is a classmate of Calvin.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15392"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: To begin with, Evelyn is an ex-fan of Real Madrid CF. Moreover, Evelyn is a devotee of FC Dnipro. Finally, whoever is an ex-fan of Real Madrid CF and a devotee of FC Dnipro is also a critic of AEK Larnaca FC.we may conclude: Evelyn is a critic of AEK Larnaca FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8202"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First premise: Being an ingredient of Eye Shadow (Diva) is sufficient for not being an ingredient of Pro-G-Yam. Second premise: Every ingredient of Pro-G-Yam is an ingredient of Eye Shadow (Diva) or an ingredient of Soothing Reset Mist. All this entails that everything that is an ingredient of Pro-G-Yam is an ingredient of Soothing Reset Mist, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25527"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, whatever is not an ingredient of Riviera Rendez-Blue and not an ingredient of T-zone Travel is not an ingredient of Bronzzer Compact, either. Now, there is something that is an ingredient of Lip Booster and an ingredient of Bronzzer Compact. So, necessarily, some ingredient of Lip Booster is not an ingredient of Riviera Rendez-Blue or not an ingredient of T-zone Travel.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17294"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, to be a cousin of Herschel or a grandson of Williams is necessary for being a close friend of Dewayne. Moreover, everyone who is a grandson of Williams is a nephew of Bradford, too. Finally, being a cousin of Herschel is sufficient for being a nephew of Bradford. All this entails that every close friend of Dewayne is a nephew of Bradford.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4811"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, everything that is both an ingredient of All About Me and an ingredient of Unision is an ingredient of Eye Colour or an ingredient of Make a Spectacle. Now, being an ingredient of Make a Spectacle is sufficient for not being an ingredient of Train Dirty. Moreover, every ingredient of Eye Colour is an ingredient of Train Dirty. From this follows: Every ingredient of Unision that is an ingredient of All About Me is not an ingredient of Train Dirty.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21712"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: First of all, whoever is not a loyal buyer of Canus soap is an infrequent user of Celtic Sea Salt soap. Next, every infrequent user of Celtic Sea Salt soap is an owner of a Aveeno shampoo. We may conclude: Being a loyal buyer of Canus soap is sufficient for not being an owner of a Aveeno shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22581"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First premise: Being an admirer of İstanbul Başakşehir is sufficient for not being an opponent to Celtic FC. We may conclude that nobody is neither an opponent to Celtic FC nor an admirer of İstanbul Başakşehir.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1620"
            ]
        ],
        "round#15": [
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: First, Lucia is an infrequent user of Pureology shampoo. Second, whoever is not an infrequent user of Pureology shampoo is an occasional purchaser of Ivory soap. So, necessarily, it is not the case that Lucia is an occasional purchaser of Ivory soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23665"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To begin with, every workmate of Warren is neither a close friend of Melvin nor a cousin of Clinton. Moreover, every nephew of Howard is a cousin of Clinton or a close friend of Melvin. All this entails that no nephew of Howard is a workmate of Warren.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25275"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: To begin with, no fan of FC Midtjylland is an ex-fan of Konyaspor. Moreover, everyone who is an ex-fan of SS Lazio is an ex-fan of Konyaspor, too. We may conclude that whoever is an ex-fan of SS Lazio is not a fan of FC Midtjylland.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11956"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: Not being an aunt of Christy is sufficient for not being an ancestor of Peggy. Being an ancestor of Peggy is necessary for being a stepsister of Kathryn. We may conclude: Being a stepsister of Kathryn is sufficient for being an aunt of Christy.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16672"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: First premise: Every regular user of Purpose soap who is an infrequent user of Aussie shampoo is not an owner of a Neutrogena shampoo. We may conclude: No owner of a Neutrogena shampoo is both a regular user of Purpose soap and an infrequent user of Aussie shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17371"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First, being an ingredient of Trugel Canvas is necessary for not being an ingredient of Cork Wedges. Second, being an ingredient of Eye Pencil is sufficient for being an ingredient of Cork Wedges. It follows that being an ingredient of Eye Pencil is sufficient for not being an ingredient of Trugel Canvas.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#2101"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: To start with, being an expert of US Sassuolo Calcio is necessary for not being a member of Sporting Clube de Portugal. Now, everyone who is a follower of Apollon Limassol FC is an expert of US Sassuolo Calcio, too. Therefore, whoever is not a follower of Apollon Limassol FC is a member of Sporting Clube de Portugal.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3311"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: Whoever is a brother of Erik is not a schoolmate of Leslie. Thomas is a schoolmate of Leslie. So, necessarily, it is false that Thomas is a brother of Erik.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26987"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, everyone who is a close friend of Susan is a stepsister of Nicole, too. Next, being a granddaughter of Alicia is sufficient for not being a stepsister of Nicole. Plus,whoever is classmate of Sherry is at least one of these: a granddaughter of Alicia, a close friend of Susan or a close friend of Kerstin. It follows that no classmate of Sherry is, in the same time, a stepsister of Nicole without being a close friend of Kerstin.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23237"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, whoever is not an ex-fan of RB Leipzig is an ex-fan of FC Sheriff Tiraspol. Now, some ex-fan of FC Sheriff Tiraspol is not an ex-supporter of US Sassuolo Calcio or not an admirer of FK Kukësi. We may conclude: Some ex-fan of RB Leipzig is not both an ex-supporter of US Sassuolo Calcio and an admirer of FK Kukësi.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26295"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First, nothing is neither an ingredient of Moonstone Glitter nor an ingredient of Contour Shadow. We may conclude: Whatever is not an ingredient of Contour Shadow is an ingredient of Moonstone Glitter.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3515"
            ],
            [
                "Q: \"It is not always easy to see which chemicals are contained in our consumer products. The following argument pertains to this question: Everything that is an ingredient of Neon Red is an ingredient of Golden Meringue, too. C.I. Acid Red 114 is an ingredient of Golden Meringue. From this follows: C.I. Acid Red 114 is an ingredient of Neon Red.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10922"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, nobody is neither an aunt of Zenaida nor a stepsister of Gladys. Moreover, not being a cousin of Dori is sufficient for being a stepsister of Gladys and a daughter of Mary. Finally, whoever is not an aunt of Zenaida is a daughter of Mary. Therefore, nobody is neither an aunt of Zenaida nor a cousin of Dori.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4730"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: First, whoever is a regular consumer of Colgate-Palmolive soap is not a frequent consumer of Pantene shampoo. Second, not every regular consumer of Zest soap is a frequent consumer of Pantene shampoo. All this entails that some regular consumer of Zest soap is a regular consumer of Colgate-Palmolive soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4457"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, not being an ingredient of Satin Ribbon is sufficient for not being an ingredient of New York Trend. Moreover, everything that is an ingredient of Lip Liner (Mocha) is an ingredient of New York Trend, too. All this entails that whatever is not an ingredient of Lip Liner (Mocha) is an ingredient of Satin Ribbon.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#14080"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, whatever is none of this: an ingredient of Robin's Egg Lacquer or ingredient of Multi Action, is an ingredient of THE LIPSTICK 09. Now, being an ingredient of THE LIPSTICK 09 is sufficient for being an ingredient of Goldden Blonde. We may conclude: Whatever is not both an ingredient of Multi Action and an ingredient of Robin's Egg Lacquer is an ingredient of Goldden Blonde.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13652"
            ]
        ],
        "round#16": [
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To begin with, everyone who is not a rare consumer of Mysore soap and not a loyal buyer of Pacifica soap is a frequent consumer of John Frieda shampoo or a rare consumer of Camay soap. Moreover, every frequent consumer of John Frieda shampoo is a loyal buyer of Pacifica soap or a rare consumer of Mysore soap. So, necessarily, whoever is none of this: a rare consumer of Mysore soap or loyal buyer of Pacifica soap, is a rare consumer of Camay soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#12833"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, everyone who is a sister of Mable is a schoolmate of Carmen, too. Next, there is somebody who is a daughter of Florene and a sister of Mable. In consequence, some daughter of Florene is a schoolmate of Carmen.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3698"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First, nobody is neither a rare consumer of Tocca soap nor an infrequent user of Olay soap. Second, someone who is not a rare consumer of Ivory soap is an infrequent user of Olay soap or an occasional purchaser of Pre De Provence soap. Third, being an occasional purchaser of Pre De Provence soap is necessary for not being a rare consumer of Tocca soap. Hence, being a rare consumer of Ivory soap is necessary for not being a rare consumer of Tocca soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21165"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: To start with, to be an ex-supporter of Paris Saint-Germain or a follower of Liverpool FC is necessary for being an ex-fan of F91 Dudelange. Now, being an ex-fan of FC Girondins de Bordeaux is necessary for not being a follower of Liverpool FC. Moreover, whoever is not an ex-supporter of Paris Saint-Germain is an ex-fan of FC Girondins de Bordeaux. It follows that being an ex-fan of F91 Dudelange is sufficient for being an ex-fan of FC Girondins de Bordeaux.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4475"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To start with, not every occasional purchaser of Colgate-Palmolive soap is an owner of a Revlon shampoo. Now, being an owner of a Revlon shampoo is necessary for not being an owner of a Mysore soap. All this entails that there is somebody who is an occasional purchaser of Colgate-Palmolive soap and not an owner of a Mysore soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3565"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: Every frequent consumer of Garnier shampoo who is an owner of a Matrix shampoo is a regular consumer of Bentley Organic soap or a loyal buyer of Schwarzkopf shampoo. No regular consumer of Bentley Organic soap is an owner of a Matrix shampoo and, in the same time, a frequent consumer of Garnier shampoo. Hence, every frequent consumer of Garnier shampoo who is an owner of a Matrix shampoo is also a loyal buyer of Schwarzkopf shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21298"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: To begin with, every regular user of Redken shampoo who is a rare consumer of Vaseline soap is a regular user of Yardley London soap or a rare consumer of Ivory soap. Moreover, every regular user of Yardley London soap is not a rare consumer of Vaseline soap or not a regular user of Redken shampoo. We may conclude that everyone who is both a rare consumer of Vaseline soap and a regular user of Redken shampoo is a rare consumer of Ivory soap, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21303"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: First, whoever is not an occasional purchaser of Irish Spring soap is an occasional purchaser of Softsoap soap. Second, not every rare consumer of CHI shampoo is both an occasional purchaser of Eucalyptus soap and an occasional purchaser of Softsoap soap. Third, nobody is neither an occasional purchaser of Irish Spring soap nor an occasional purchaser of Eucalyptus soap. We may conclude: There is somebody who is a rare consumer of CHI shampoo and not an occasional purchaser of Irish Spring soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25939"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, some supporter of Hertha BSC Berlin is not both an expert of İstanbul Başakşehir and a follower of AC Sparta Praha. Second, nobody is neither a devotee of FC Luzern nor a supporter of Hertha BSC Berlin. Therefore, some expert of İstanbul Başakşehir is a follower of AC Sparta Praha and a devotee of FC Luzern.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#22896"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To start with, being a sister of Jana or not being a cousin of Esperanza is sufficient for being an ancestor of Marjorie. Now, Edna is a cousin of Esperanza. All this entails that Edna is not an ancestor of Marjorie.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#791"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, every daughter of Frances is a great-grandmother of Bianca. Now, whoever is a sister of Erin and a half-sister of Sue is not a great-grandmother of Bianca. In consequence, whoever is neither a sister of Erin nor a half-sister of Sue is a daughter of Frances.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17723"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, every regular consumer of Organix Hair shampoo is an occasional purchaser of Pacifica soap or an infrequent user of Aveeno soap. Now, every occasional purchaser of Pacifica soap who is an infrequent user of Aveeno soap is a regular consumer of Organix Hair shampoo or an infrequent user of Protex soap. All this entails that whoever is none of this: an occasional purchaser of Pacifica soap or infrequent user of Aveeno soap, is an infrequent user of Protex soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19477"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, being a classmate of Terrence is sufficient for not being a son of Dewayne. Now, every classmate of Terrence is a stepbrother of Forrest or, otherwise, neither a stepbrother of Forrest nor a son of Dewayne. In consequence, every classmate of Terrence is a stepbrother of Forrest.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27096"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First, being an ingredient of Matterial Girl is necessary for not being an ingredient of MORINGA SOAP. Second, everything that is an ingredient of SHEER LIP SHINE is an ingredient of Matterial Girl, too. So, necessarily, whatever is not an ingredient of SHEER LIP SHINE is an ingredient of MORINGA SOAP.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23543"
            ],
            [
                "Q: \"Consumer research aims at understanding whether users of some products also tend to consume other ones, or not. The following argument seeks to clarify some such relations: First, being a loyal buyer of Pantene shampoo is sufficient for being a frequent consumer of Nexxus shampoo. Second, being a frequent consumer of Nexxus shampoo is necessary for being an occasional purchaser of Caress soap. Third, being a regular user of Garnier shampoo is sufficient for being a frequent consumer of Nexxus shampoo. Fourth, every regular consumer of Pureology shampoo is a loyal buyer of Pantene shampoo or an occasional purchaser of Caress soap or a regular user of Garnier shampoo. It follows that being a frequent consumer of Nexxus shampoo is necessary for being a regular consumer of Pureology shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18301"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: First, being an ingredient of LIP PENCIL LP02 is necessary for not being an ingredient of Bioglitz Color 6N. Second, not being an ingredient of AUTOGRAPH EYELINER is sufficient for being an ingredient of LIP PENCIL LP02 and an ingredient of MASCARA & EYELINER. Third, whatever is not an ingredient of Bioglitz Color 6N is an ingredient of MASCARA & EYELINER. Hence, being an ingredient of AUTOGRAPH EYELINER is necessary for not being an ingredient of Bioglitz Color 6N.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#10959"
            ]
        ],
        "round#17": [
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, whoever is a half-sister of Pricilla is not a workmate of Gloria. Moreover, whoever is half-sister of Pricilla is at least one of these: a niece of Sharon, a granddaughter of Samantha or a workmate of Gloria. Finally, no half-sister of Pricilla is a niece of Sharon. Hence, every half-sister of Pricilla is a granddaughter of Samantha.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13576"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To start with, every ingredient of PureOpticT lipgloss is an ingredient of Electric Lip Slide. Now, every ingredient of PureOpticT lipgloss is an ingredient of Bioglitz Color 6NN. Moreover, every ingredient of PureOpticT lipgloss is an ingredient of Electric Lip Slide or an ingredient of Coconut Lip Butter or an ingredient of Bioglitz Color 6NN. So, necessarily, everything that is an ingredient of PureOpticT lipgloss is an ingredient of Coconut Lip Butter, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3779"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: To begin with, whoever is not a loyal buyer of Bed Head shampoo is an occasional purchaser of Herbal Essences shampoo. Moreover, nobody is neither a regular user of TRESemmé shampoo nor an occasional purchaser of Herbal Essences shampoo. Finally, every loyal buyer of John Frieda shampoo is not a regular user of TRESemmé shampoo or not a loyal buyer of Bed Head shampoo. In consequence, being an occasional purchaser of Herbal Essences shampoo is necessary for being a loyal buyer of John Frieda shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#28361"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To begin with, something that is not an ingredient of Maypole Soap is an ingredient of Cupcake or an ingredient of OW COLOR PROTECTION. Moreover, whatever is not an ingredient of Anti-Redness Cream is an ingredient of Cupcake. Finally, nothing is neither an ingredient of Anti-Redness Cream nor an ingredient of OW COLOR PROTECTION. Hence, nothing is neither an ingredient of Anti-Redness Cream nor an ingredient of Maypole Soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#88"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, Billie is a granddaughter of Myrtle. Next, no great-grandmother of Pricilla is a granddaughter of Myrtle or a close friend of Dolores. We may conclude that it is not the case that Billie is a great-grandmother of Pricilla.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15664"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: Being an infrequent user of Canus soap is sufficient for not being a loyal buyer of Garnier shampoo. Whoever is an infrequent user of Canus soap is not an owner of a Mysore soap or a loyal buyer of Garnier shampoo. In consequence, no infrequent user of Canus soap is an owner of a Mysore soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3043"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: Being a cousin of Eva is necessary for being a classmate of Cheryl. Every cousin of Eva is not a sister of Alicia or not a great-grandmother of Lorraine. We may conclude: No classmate of Cheryl is both a sister of Alicia and a great-grandmother of Lorraine.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#12494"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: First of all, being a member of VfL Borussia Mönchengladbach is sufficient for being an ex-supporter of Wolverhampton Wanderers FC. Next, every ex-supporter of Wolverhampton Wanderers FC is not a devotee of Villarreal CF or not an opponent to Brøndby IF. We may conclude that no member of VfL Borussia Mönchengladbach is both an opponent to Brøndby IF and a devotee of Villarreal CF.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8713"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, whatever is not an ingredient of Trugel Matador is an ingredient of MOODpearl. Second, everything that is neither an ingredient of Sole Sensation nor an ingredient of MOODpearl is not an ingredient of MOODpearl. From this follows: Whatever is none of this: an ingredient of Passion Fruit or ingredient of Sole Sensation, is an ingredient of Trugel Matador.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11322"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: Every classmate of Kenya is a granddaughter of Andrea. Everyone who is an aunt of Geraldine is a granddaughter of Andrea, too. Whoever is cousin of Esther is at least one of these: a classmate of Kenya, an aunt of Geraldine or a great-grandmother of Janel. In consequence, every cousin of Esther is a great-grandmother of Janel or a granddaughter of Andrea.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#13689"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To start with, no ingredient of Electric Pineapple is an ingredient of Lip Polish (Berry). Now, whatever is an ingredient of Electric Pineapple is not an ingredient of Macaroon. Moreover, every ingredient of Macaroon that is an ingredient of Lip Polish (Berry) is also an ingredient of Honeymoon In Style. We may conclude that being an ingredient of Electric Pineapple is sufficient for being an ingredient of Honeymoon In Style.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11388"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First premise: Being a niece of Hazel is necessary for not being a granddaughter of Melissa. Second premise: It is not the case that Bernice is a granddaughter of Melissa. So, necessarily, Bernice is a niece of Hazel.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18311"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, not being an opponent to HNK Hajduk Split is sufficient for not being an admirer of KF Shkëndija. All this entails that not being an admirer of KF Shkëndija is sufficient for not being an opponent to HNK Hajduk Split.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#3020"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Not being a loyal buyer of Tocca soap is sufficient for not being a loyal buyer of Cetaphil soap. We may conclude that not being a loyal buyer of Cetaphil soap is sufficient for not being a loyal buyer of Tocca soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8102"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First of all, being a member of FC Shakhtar Donetsk is sufficient for not being a backer of Sporting Clube de Portugal. Next, being an expert of Brøndby IF is sufficient for being a member of FC Shakhtar Donetsk. It follows that being an expert of Brøndby IF is sufficient for not being a backer of Sporting Clube de Portugal.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#11832"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, being an ancestor of Matilde or a granddaughter of Agnes is sufficient for being a classmate of Danielle. Moreover, it is false that Stacy is a granddaughter of Agnes. Therefore, Stacy is not a classmate of Danielle.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#5269"
            ]
        ],
        "round#18": [
            [
                "Q: \"Here comes a perfectly valid argument: First, no ingredient of ZR LIPSTICK CLISS that is an ingredient of ROCK 'N' KOHL is an ingredient of AMC Eyeliner Gel 94. Hence, not being an ingredient of AMC Eyeliner Gel 94 is sufficient for being an ingredient of ROCK 'N' KOHL and an ingredient of ZR LIPSTICK CLISS.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8530"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To begin with, not being a niece of Annette is sufficient for not being a daughter of Tanisha. So, necessarily, not being a daughter of Tanisha is sufficient for not being a niece of Annette.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#14225"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, every expert of R. Charleroi SC who is an opponent to Qarabağ FK is a critic of FCSB or a follower of PSV Eindhoven. Moreover, every critic of FCSB is not an expert of R. Charleroi SC and not an opponent to Qarabağ FK. All this entails that whoever is not both an opponent to Qarabağ FK and an expert of R. Charleroi SC is a follower of PSV Eindhoven.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#12571"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, every uncle of Corey is a cousin of Edwin. Now, everybody who is neither a cousin of Cecil nor an uncle of Wayne is however an uncle of Corey. So, necessarily, whoever is none of this: an uncle of Wayne or cousin of Cecil, is a cousin of Edwin.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8465"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To begin with, somebody is a sister of Christy and an aunt of Pamela. Moreover, everyone who is not both a cousin of Gwendolyn and a daughter of Sandra is however an aunt of Pamela. Therefore, not every sister of Christy is both a cousin of Gwendolyn and a daughter of Sandra.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27628"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First, every classmate of Keisha is neither a great-grandmother of Patricia nor a classmate of Margaret. Hence, whoever is none of this: a great-grandmother of Patricia or classmate of Margaret, is a classmate of Keisha.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#25851"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, there is somebody who is an ancestor of Sandra and a half-sister of Elizabeth. Moreover, everyone who is neither a niece of Mildred nor a close friend of Jeanette is not a half-sister of Elizabeth. We may conclude that there exists an ancestor of Sandra who is not a niece of Mildred or not a close friend of Jeanette.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26572"
            ],
            [
                "Q: \"Is Fred a fan of Liverpool? Are supporters of Real Madrid devotees of PSG? In European football, it is sometimes difficult to keep track of the mutual admiration and dislike. The following argument seeks to clarify some such relations: First, being an expert of FC Pyunik is sufficient for not being a critic of Southampton FC. Second, George is an expert of FC Pyunik. Therefore, it is not the case that George is a critic of Southampton FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4339"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: First premise: Whoever is a backer of Southampton FC is not a devotee of FC Astra Giurgiu. Second premise: It is not the case that Walter is a devotee of FC Astra Giurgiu. From this follows: Walter is a backer of Southampton FC.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#17507"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, everyone who is both a regular user of Olay soap and a loyal buyer of Proactiv soap is a regular consumer of Redken shampoo, too. Second, being a regular consumer of Redken shampoo is sufficient for being a rare consumer of Nag Champa soap. It follows that whoever is a regular user of Olay soap and a loyal buyer of Proactiv soap is also a rare consumer of Nag Champa soap.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#16842"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First of all, Adolfo is a workmate of Alan. Next, everyone who is a schoolmate of Ray or a workmate of Alan is also a nephew of Sal. From this follows: Adolfo is a nephew of Sal.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#7837"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, whoever is a sister of Gabriella and an aunt of Leola is not a workmate of Emily. From this follows: Everyone who is not a workmate of Emily is however a sister of Gabriella and an aunt of Leola.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#18316"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, whatever is not an ingredient of ZR LIPSTICK SUNDAE is an ingredient of Liquid Luminosity. Next, being an ingredient of ZR LIPSTICK SUNDAE is necessary for not being an ingredient of Matte Nail Polish. In consequence, being an ingredient of Liquid Luminosity is necessary for being an ingredient of Matte Nail Polish.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#26164"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To begin with, nobody is neither a sister of Mary nor an aunt of Nicole. Moreover, someone who is not a close friend of Carolyn is an aunt of Nicole or a half-sister of Joyce. Finally, whoever is not a sister of Mary is a half-sister of Joyce. We may conclude that being a close friend of Carolyn is necessary for not being a sister of Mary.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23499"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, every half-brother of Aaron is not a cousin of Juan or not a son of Owen. Next, being a half-brother of Aaron is necessary for being a grandson of Justin. We may conclude: Every grandson of Justin is neither a son of Owen nor a cousin of Juan.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#6654"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First, whoever is a member of FK Jablonec and an ex-supporter of SC Braga is also an ex-supporter of AC Sparta Praha.second, being an opponent to GNK Dinamo Zagreb is sufficient for being a member of FK Jablonec. Third, being an ex-supporter of SC Braga is necessary for being an opponent to GNK Dinamo Zagreb. From this follows: Everyone who is an opponent to GNK Dinamo Zagreb is an ex-supporter of AC Sparta Praha, too.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21262"
            ]
        ],
        "round#19": [
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: To begin with, every ingredient of I get What I want is not an ingredient of LIP BUTTER or not an ingredient of Nourishing Oil. Moreover, every ingredient of Eye Liner is an ingredient of I get What I want. We may conclude that no ingredient of Eye Liner is an ingredient of Nourishing Oil and, in the same time, an ingredient of LIP BUTTER.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19690"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Being an ingredient of Handy Gurugu is sufficient for being an ingredient of Sheer Gloss Stick. Second premise: Being an ingredient of Sheer Gloss Stick is necessary for not being an ingredient of Intergalactic. Therefore, whatever is not an ingredient of Handy Gurugu is an ingredient of Intergalactic.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#27937"
            ],
            [
                "Q: \"Some football fans admire various clubs, others love only a single team. But who is a fan of whom precisely? The following argument pertains to this question: No supporter of FC Midtjylland is an ex-supporter of APOEL FC. Every supporter of FC Midtjylland is not an ex-supporter of APOEL FC or not an expert of Östersunds FK. So, necessarily, no supporter of FC Midtjylland is an expert of Östersunds FK.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15875"
            ],
            [
                "Q: \"Is Titanium oxide an ingredient of my washing power? Which chemicals does my perfume contain? It is really difficult to keep track of all chemicals one is regularly exposed to. The following argument seeks to clarify some such relations: If something is not an ingredient of Bastille My Heart, then that thing is not an ingredient of Polar Attraction or not an ingredient of Entourage. Whatever is not an ingredient of Chinese Shampoo is an ingredient of Entourage. Nothing is neither an ingredient of Chinese Shampoo nor an ingredient of Polar Attraction. From this follows: Nothing is neither an ingredient of Chinese Shampoo nor an ingredient of Bastille My Heart.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#9235"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First of all, every schoolmate of Manuel is neither a cousin of Corey nor a stepbrother of Ward. From this follows: Everyone who is a cousin of Corey or a stepbrother of Ward is not a schoolmate of Manuel.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#2908"
            ],
            [
                "Q: \"Is Fred a cousin of Robert? Is Joe related to Bob? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: To start with, it is not the case that Adam is an ancestor of Jorge. Now, every son of Ricardo is neither an ancestor of Jorge nor a workmate of Benjamin. Moreover, it is not the case that Adam is a workmate of Benjamin. Therefore, Adam is not a son of Ricardo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#23039"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: First premise: Somebody is a workmate of Matilda and not a classmate of Mildred. Second premise: Everyone who is a classmate of Sara is a classmate of Mildred, too. From this follows: There is somebody who is a workmate of Matilda and not a classmate of Sara.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#21868"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: First premise: Every great-grandmother of Emma is not a workmate of Clara and not a granddaughter of Catherine. Hence, no workmate of Clara and no granddaughter of Catherine is a great-grandmother of Emma.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1188"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: Every admirer of Go Ahead Eagles is an expert of OGC Nice or a devotee of FC Groningen or a devotee of FC Bayern München. Being an admirer of Go Ahead Eagles is sufficient for not being an expert of OGC Nice. Therefore, every admirer of Go Ahead Eagles is a devotee of FC Bayern München or a devotee of FC Groningen.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#8304"
            ],
            [
                "Q: \"Is Siri a stepsister of Mary? Is Susan related to Kate? In large families, it is sometimes difficult to keep track of all one's relatives. The following argument seeks to clarify some such relations: Pansy is a daughter of Candace. Being a niece of Sara or not being a daughter of Candace is sufficient for being a close friend of Monserrate. From this follows: It is not the case that Pansy is a close friend of Monserrate.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#7134"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To begin with, being an ex-fan of Real Sociedad de Fútbol is sufficient for being an ex-supporter of FC Mariupol. Moreover, not being a backer of Feyenoord is sufficient for not being an ex-supporter of FC Mariupol. So, necessarily, every ex-fan of Real Sociedad de Fútbol is a backer of Feyenoord.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#15225"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: To start with, whoever is not a regular user of Head & Shoulders shampoo is an occasional purchaser of Mysore soap. It follows that whoever is not an occasional purchaser of Mysore soap is a regular user of Head & Shoulders shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4446"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First of all, whatever is not an ingredient of THE LIPSTICK 09 is an ingredient of Petal to the Metal. Therefore, being an ingredient of THE LIPSTICK 09 is necessary for not being an ingredient of Petal to the Metal.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1855"
            ],
            [
                "Q: \"It is not always easy to grasp who is consuming which products. The following argument pertains to this question: No loyal buyer of Bliss soap is, in the same time, a rare consumer of Matrix shampoo but not a regular consumer of Dermasil soap. No regular consumer of Dermasil soap is a loyal buyer of Bliss soap. It follows that being a loyal buyer of Bliss soap is sufficient for being a rare consumer of Matrix shampoo.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#1713"
            ],
            [
                "Q: \"Here comes a perfectly valid argument: First premise: Every stepbrother of Kermit is a workmate of Sean. Second premise: Some workmate of Sean is not a stepbrother of Tyree. In consequence, not every stepbrother of Tyree is a stepbrother of Kermit.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "valid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#19739"
            ],
            [
                "Q: \"It is not always easy to see who is related to whom -- and in which ways. The following argument pertains to this question: To begin with, whoever is great-grandfather of Donald is at least one of these: a nephew of Carlos, a great-grandfather of Felipe or a cousin of Dewayne. Moreover, being a great-grandfather of Donald is sufficient for being a cousin of Dewayne. Finally, being a great-grandfather of Donald is sufficient for being a nephew of Carlos. From this follows: Being a great-grandfather of Donald is sufficient for being a great-grandfather of Felipe.\"\n Is the argument, given the explicitly stated premises, deductively valid or invalid?\nA:",
                [
                    "invalid"
                ],
                "formal_fallacies_syllogisms_negation|all|default|#4430"
            ]
        ]
    }
}