{
    "16": {
        "round#0": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh, yes. We've got everything here. Every bit of knowledge, wisdom, learning ... every experience, every thought neatly filed away. What? You mean you've got ... Well not exactly. But, if you help us we'll help you. The Forces Of Darkness have won the day ... but, tomorrow is another one What do I have to do. You must save the day. ----- In the preceding conversation, were the sentences \"What do I have to do.\" and \"You must save the day.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#19179"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Being with Stephanie has opened my eyes. She's not uptight or controlling. She's just cool. Things are so easy with her. Smells different. Tastes different. Fucks different. Fucks like an animal. I'm telling you, I went deep last night, Miles. Deep. Deep. ----- In the preceding conversation, were the sentences \"Tastes different.\" and \"Fucks different.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#83811"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Shit. No new pages. I don't even know where the fuck we're supposed to go. Maybe we should call for a cab. No. Look. There. ----- In the preceding conversation, were the sentences \"Maybe we should call for a cab.\" and \"No.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#67584"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You were saying? Has David Kessler anything to say concerning the attack on the moors? Why don't we ask him? ----- In the preceding conversation, were the sentences \"Has David Kessler anything to say concerning the attack on the moors?\" and \"Why don't we ask him?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#73350"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Chili dog for breakfast... it's original. Mom tried to cook. Oh. ----- In the preceding conversation, were the sentences \"Chili dog for breakfast... it's original.\" and \"Mom tried to cook.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#39888"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: When are you going back? I don't know. Sometime. Later. Listen, Rob, would you have sex with me? What? I want to feel something else than this. It's either that or I go home and put my hand in the fire. Unless you want to stub cigarettes out on my arm. I've only got a couple left. I'm saving them for later. It'll have to be sex, then. ----- In the preceding conversation, were the sentences \"Unless you want to stub cigarettes out on my arm.\" and \"I've only got a couple left.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#46798"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You'll need these. Tonight. For the play. Don't make me sit through one of your plays. Hey, Pop. I know you don't like the commotion of opening night. But I especially want you to see this play. It's new territory for me. And for you too. I have to know what you think. Since when did that matter? Let's not start that again. My back is killing me. Where's your elastic brace? I can't find it. You're suppose to wear it when your back gives you trouble. I lost it. I lose everything. I'll go get you another one. You have to wear it. ----- In the preceding conversation, were the sentences \"For the play.\" and \"Don't make me sit through one of your plays.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#61813"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Mother-- You make any sandwiches? My first day of school, mother'd make me eat and by golly I could never even swallow till recess-- ----- In the preceding conversation, were the sentences \"Mother--\" and \"You make any sandwiches?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#21039"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Signal the Endeavor to fall back. We'll cover them. Aye, sir. ----- In the preceding conversation, were the sentences \"Signal the Endeavor to fall back.\" and \"We'll cover them.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#15949"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Well, it's sandstone. Christian symbol. Early Latin text. Mid-Twelfth Century, I should think. That was our assessment as well. Where did this come from? My engineers unearthed it in the mountain region north of Ankara while excavating for copper. Can you translate the inscription? ----- In the preceding conversation, were the sentences \"Where did this come from?\" and \"My engineers unearthed it in the mountain region north of Ankara while excavating for copper.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#25154"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Could you reach Mr. Dardis by car radio? He is not in the car. Sorry. ----- In the preceding conversation, were the sentences \"Could you reach Mr. Dardis by car radio?\" and \"He is not in the car.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#15627"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I ain't mad. I ain't even surprised. But I can't let ya fuck me. On the other hand, if ya got needs beyond the thirty-five, I'll advance it to you against our next deal on the same terms. Could we step outside? ----- In the preceding conversation, were the sentences \"On the other hand, if ya got needs beyond the thirty-five, I'll advance it to you against our next deal on the same terms.\" and \"Could we step outside?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#15193"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm sorry. Where were we? We were about to request the primary residence, and thirty percent of the remaining assets. ----- In the preceding conversation, were the sentences \"Where were we?\" and \"We were about to request the primary residence, and thirty percent of the remaining assets.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#71878"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: This the only spare? Yes. The other working. Perfectly. ----- In the preceding conversation, were the sentences \"This the only spare?\" and \"Yes.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#10411"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Could he speak English? Emilio couldn't speak English. We'll see. And thank your father in the morning. A man always needs to be thanked. ----- In the preceding conversation, were the sentences \"Could he speak English?\" and \"Emilio couldn't speak English.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#76460"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: By the way, I got a messsage yesterday from some guy looking for New Year's action. Resort, upstate. Hey. ----- In the preceding conversation, were the sentences \"Resort, upstate.\" and \"Hey.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#66399"
            ]
        ],
        "round#1": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Why? For the artistic effect. The combination of your human body and that inhuman mask. It's quite striking. I don't know. Please, Clayton. Just for a minute. Long enough for me to see the effect. It's from the first World War, isn't it? There are straps in back. ----- In the preceding conversation, were the sentences \"For the artistic effect.\" and \"The combination of your human body and that inhuman mask.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#35833"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You called my friend a faggot? You tell him to go fuck himself? Nicky, I did - Is that what you did? I did - I didn't - Tell him to go fuck himself? You fuckin' hick! Fuckin'... ----- In the preceding conversation, were the sentences \"You tell him to go fuck himself?\" and \"Nicky, I did -\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#66664"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Some other guy? Yeah, he was probably drunker than my Uncle, who fuckin' knows? So the cop goes \"Stay here\" And he goes runnin' down the highway to deal with the other crash. So, my Uncle Marty's standin' on the side of the road for a little while, and he's so fuckin' lit, that he forgets what he's waitin' for. So he goes, \"Fuck it.\" He gets in his car and drives home. Holy shit. So in the morning, there's a knock on the door it's the Statie. So my Uncle's like, \"Is there a problem?\" And the Statie's like \"I pulled you over and you took off.\" And my Uncle's like \"I never seen you before in my life, I been home all night with my kids.\" And Statie's like \"Let me get in your garage!\" So he's like \"All right, fine.\" He takes around the garage and opens the door --and the Statie's cruiser is in my Uncle's garage. ----- In the preceding conversation, were the sentences \"So he's like \"All right, fine.\"\" and \"He takes around the garage and opens the door --and the Statie's cruiser is in my Uncle's garage.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#3501"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Aha! -- The Baron. What do you want here? I must have made a mistake. Made a mistake -- remarkable. We shall soon see if you made a mistake. Stay here... Give me that money. ----- In the preceding conversation, were the sentences \"-- The Baron.\" and \"What do you want here?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#77784"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's the same questions, Mrs. Little. Since the death of your husband -- Murder. -- there is a serious question as to whether -- These are my children. Mine. And they ain't no question. None. I think sometimes, Mrs. Little, candor is the only kindness. All of your children are delinquent, Mrs. Little, and one, at least, Malcolm is a thief. Get out. Your control over your children, therefore -- Did you hear me? ! You'll regret this, Mrs. Little. If you don't move out through that door, you're going to be past all regretting. ----- In the preceding conversation, were the sentences \"All of your children are delinquent, Mrs. Little, and one, at least, Malcolm is a thief.\" and \"Get out.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#93160"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh, yes, Mr. Preysing? Sit here. Cognac -- for you? Nothing. ----- In the preceding conversation, were the sentences \"Oh, yes, Mr. Preysing?\" and \"Sit here.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#64701"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Of course. Drown them like puppies. See, we're very modern. ----- In the preceding conversation, were the sentences \"Of course.\" and \"Drown them like puppies.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#73507"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh, there would be no sense in killing you, Miss Turner. Then why aren't you eating? Would that I could. ----- In the preceding conversation, were the sentences \"Then why aren't you eating?\" and \"Would that I could.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#53980"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Maybe. But that's not the real reason. You think if I tell, he'll disappear and that's what you want! Me all to yourself! No. I want what's best for you. This -- him -- Landon -- is what's best for me! ----- In the preceding conversation, were the sentences \"Maybe.\" and \"But that's not the real reason.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#54007"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What? We've repeated. A few minutes ago the message cycled back to page one. And? No primer. How can that be? I don't know. Maybe there is a fourth layer in there somewhere, but if there is, I sure as hell can't find it. ----- In the preceding conversation, were the sentences \"We've repeated.\" and \"A few minutes ago the message cycled back to page one.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#88332"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: So? Switek pulling this off...? That's not faith; that's delusional... ----- In the preceding conversation, were the sentences \"So?\" and \"Switek pulling this off...?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#37801"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You know, if this ever happens again, you can make the fries even if I haven't put out the napkins yet. I'm so glad you're here. I understand. ----- In the preceding conversation, were the sentences \"I'm so glad you're here.\" and \"I understand.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#94089"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Come, sweetheart. Let me put it on you. You will teach these jewels. For the first time they will learn how they can look. They belong to the people. I give them back to the people... I make you Ninotchka the Great... Duchess of the People!... Grand Duchess of the People! ----- In the preceding conversation, were the sentences \"Let me put it on you.\" and \"You will teach these jewels.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#48178"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's a good thing the school was flooded today. Why is that? We never would have had this conversation. ----- In the preceding conversation, were the sentences \"Why is that?\" and \"We never would have had this conversation.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#45468"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Here we have a typical barrack. It houses seventy-five men. Every one of them has his own bunk, naturally. Naturally. It would be rather awkward to have three men in one bunk. As for the blankets, you will notice they are very warm. Fifty percent wool. They also smell of moth balls. When were they issued? This morning? ----- In the preceding conversation, were the sentences \"They also smell of moth balls.\" and \"When were they issued?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#85205"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: No. I will not betray my friends. They're not your friends... they've held you back... kept you from your destiny... That is not true. They have tried to help me. Have they given you what I have given you? Did they even try? I... do not want this... ----- In the preceding conversation, were the sentences \"That is not true.\" and \"They have tried to help me.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#37381"
            ]
        ],
        "round#2": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: WHAT? WHERE'RE YOU--HEY, WHERE IN THE HELL ARE YOU GOING? DIDN'T ... AHHH...LOOK GOOD. WHAT DO YOU MEAN? IT DOESN'T GET TO LOOK MUCH BETTER THAN THAT? NO. NO GOOD. ----- In the preceding conversation, were the sentences \"WHAT?\" and \"WHERE'RE YOU--HEY, WHERE IN THE HELL ARE YOU GOING?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#90725"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh\u0097Mary\u0097 Yes, sir? How is she? Why\u0097uh\u0097she's all right, sir. What's the matter? Anything wrong? Oh, no, sir. No different than\u0097 Yes. I know. Still in the dumps, huh? Yes sir. If you'll excuse me, sir\u0097she sent me for a drink. Andrews stands a moment thoughtfully and then starts up the stairs, following which the scene dissolves to the UPSTAIRS CORRIDOR in front of Ellie's door. Andrews enters and knocks several times. Receiving no response, he gingerly opens the door. ----- In the preceding conversation, were the sentences \"Oh, no, sir.\" and \"No different than\u0097\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#49662"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You know about this stuff? I helped Jamie with the first one. I thought she built it herself. She did. But hardly anyone does anything truly alone. ----- In the preceding conversation, were the sentences \"I helped Jamie with the first one.\" and \"I thought she built it herself.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#73871"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: That lady is back, sir. Show her in. Then go to bed. ----- In the preceding conversation, were the sentences \"Show her in.\" and \"Then go to bed.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#36508"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: She's working as fast as she can, Icarus. It will be ready soon. It's ready now, I know it is. She says it's not. She's lying. She lost the first one on purpose. She did not. The mouse ran down the drain. She let it escape because she wants me to die. Don't be a child, Icarus. She is just another scientist and like all scientists, she doesn't care about anything outside the world of the laboratory. ----- In the preceding conversation, were the sentences \"Don't be a child, Icarus.\" and \"She is just another scientist and like all scientists, she doesn't care about anything outside the world of the laboratory.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#40257"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Fats, I got about two hundred dollars here. Game's over, Eddie. Fats, look, I got about two hundred dollars here. You can't run out on me. You watch me. ----- In the preceding conversation, were the sentences \"Fats, look, I got about two hundred dollars here.\" and \"You can't run out on me.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#36316"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh, hi hon. Just straightening up. Where's Puffy? Ah, he was being a pest so I put him in the bathroom. ----- In the preceding conversation, were the sentences \"Just straightening up.\" and \"Where's Puffy?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#94333"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Sorry about that ... Mr Helpmann told me you were coming aboard - congratulations! Thanks. Are you officer 412/L? For my sins. Are you settling in alright? Yes, thanks. Terrific. I'm really glad you dropped by. Unfortunately, I don't have any time right now I've got a queue of customers to deal with - er, why don't we have a drink tonight? Ah ... What? I don't want to take up your time now, but I was hoping you could give me some information on somebody. It's a security level three matter and Information Retrieval records says to refer to you. OK. Come back this afternoon, about four o'clock. If you give me the number of the case, I'll have the dossier here waiting. My tailor,... well worth the investment. I've got numbers all over these - I'm not sure which is the one you want. Layton! Oh shit! What is it? You clever bastard! I might have guessed. You only moved in today and you're already hot on the bloody trail. Am I? Please, Sam, we're going to have to be open to each other on this one. If you make a reputation with this case, it'll be at my expense. How do you mean? How much do you know? Not much. Enough though, eh? Not really, no. ----- In the preceding conversation, were the sentences \"I'm really glad you dropped by.\" and \"Unfortunately, I don't have any time right now I've got a queue of customers to deal with - er, why don't we have a drink tonight?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#83104"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh, uh, I meant to tell you... Alex brought that fabric over... Okay. It's on the table by the phone. I didn't know what to tell him...  ... Whether or not we were...  ... if we still we're thinking of redoing the couch. ----- In the preceding conversation, were the sentences \"Oh, uh, I meant to tell you... Alex brought that fabric over...\" and \"Okay.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#91923"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Simple Simon on the Rock, go caller. Hello? Is this me? I'm Trip. Am I on the air? I should hang up on you right now, but you're the right caller so answer quick or get your battleship sunk. What are the names of the four members of KISS? Gene Klein, Stanley Eisen, Paul Frehley, and Peter...Criscula! Yeah, that's it! ----- In the preceding conversation, were the sentences \"I should hang up on you right now, but you're the right caller so answer quick or get your battleship sunk.\" and \"What are the names of the four members of KISS?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#6065"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What is it? A complimentary ticket for a special stunt-driving exhibition. Definitely not part of the big auto show. There's a map in the packet and a note requesting you be discrete about the location. Really? What kind of exhibition is it? I suspect it involves reenactments of famous car crashes. You know, Jayne Mansfield, James Dean, Albert Camus... You're kidding. Serious. But you'll have to take your new friend, the female crash-test dummy. She dropped it off for you. You're not jealous, are you? You have to understand... Helen and I had this strange, intense... experience together. ----- In the preceding conversation, were the sentences \"You know, Jayne Mansfield, James Dean, Albert Camus...\" and \"You're kidding.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#10952"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: So where are all your toys? Let's watch some TV. Where are these toys of yours? A lot of my stuff hasn't been unpacked yet. Here's the TV. What toys do you have? ----- In the preceding conversation, were the sentences \"Here's the TV.\" and \"What toys do you have?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#40939"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I can find it myself. I didn't come that far. Farther than you think. You'll get lost. You will. And there's Bees all through the jungle. I ain't lyin' to ya. Religiosos don't lie. No. They just try to hold you for ransom. Fuck you, Moses! I'm outa here! ----- In the preceding conversation, were the sentences \"Religiosos don't lie.\" and \"No.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#66217"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Is that what it was, Jake? Was it love? You know when the first con was ever played? It was when Adam fell for Eve in the Garden of Eden. ----- In the preceding conversation, were the sentences \"You know when the first con was ever played?\" and \"It was when Adam fell for Eve in the Garden of Eden.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#3203"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: He's lying. Look at him. You think he played it square? How much did he give you, how much did he keep for himself? ----- In the preceding conversation, were the sentences \"He's lying.\" and \"Look at him.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#91931"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: So, wasn't Rothschild originally handling the Fisher account? How did you get it? I could tell you that, Halberstam, but then I'd have to kill you. ----- In the preceding conversation, were the sentences \"How did you get it?\" and \"I could tell you that, Halberstam, but then I'd have to kill you.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#9594"
            ]
        ],
        "round#3": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You really think Eddie killed her? You saw that Michael Meyers display. You've got to be pretty twisted to come up with something like that. I guess. It's just hard to believe. ----- In the preceding conversation, were the sentences \"You really think Eddie killed her?\" and \"You saw that Michael Meyers display.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#5901"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: How'd he get it? [Beat] I don't know. But Dr. Morgan said you were around when my father was... I was. But I saw a lot of cuts and a lot of blows. I'm sorry I don't know more about your father's. [Sincerely] I didn't know about everything that went on here. ----- In the preceding conversation, were the sentences \"But I saw a lot of cuts and a lot of blows.\" and \"I'm sorry I don't know more about your father's.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#72431"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Do you realize what a thread we're all hanging by? Mickey, you're off the hook. You should be celebrating. Can you understand how meaningless everything is? Everything! I'm talking about nnnn--our lives, the show...the whole world, it's meaningless. Yeah...but you're not dying! No, I'm not dying now, but, but  you know, when I ran out of the hospital, I, I was so thrilled because they told me I was going to be all right. And I'm running down the street, and suddenly I stop, 'cause it hit me, all right, so, you know, I'm not going to go today. I'm okay. I'm not going to go tomorrow. But eventually, I'm going to be in that position. ----- In the preceding conversation, were the sentences \"And I'm running down the street, and suddenly I stop, 'cause it hit me, all right, so, you know, I'm not going to go today.\" and \"I'm okay.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#5279"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You want to see my friends? Sorry, don't have the time. No problem. ----- In the preceding conversation, were the sentences \"Sorry, don't have the time.\" and \"No problem.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#66510"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Isn't this Jack Groppi's place? Yeah. But he ain't here now. Know where he is? Follow me. ----- In the preceding conversation, were the sentences \"But he ain't here now.\" and \"Know where he is?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#84559"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Your boyfriend fucked me, smoked my dope, then shopped me. What do you think of that? I can't get a job now. You bastard. You're no different from Matt. A pair of vicious little shits, that's what you are. Look Bella, I don't know anything about this. You should talk to Matt. You're all scumbags. ----- In the preceding conversation, were the sentences \"You're no different from Matt.\" and \"A pair of vicious little shits, that's what you are.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#37711"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh yeah -- I'm expecting a long distance call, very important. Give them my home phone. Right. ----- In the preceding conversation, were the sentences \"Oh yeah -- I'm expecting a long distance call, very important.\" and \"Give them my home phone.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#84020"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Ever heard of the Mary Celeste? Nope. She was a two-masted brig boat sailing out of New York in 1872. One day she was sighted off the coast of Portugal by a merchant vessel, the Dei Gratia. As the crew of the Dei Gratia got closer, they discovered that no one was at the helm of the Mary Celeste. On boarding, they found her completely deserted. The captain, his wife, their daughter, and the entire crew, all gone. The last entry in their log made no mention of any trouble. The table was even set for dinner. And in the nine days after the last entry, she sailed 700 miles without anyone aboard. So what did happen? Nobody knows. There've been a lot of theories, of course. But we'll never really know for sure. You think she's sailing without a crew? ----- In the preceding conversation, were the sentences \"The captain, his wife, their daughter, and the entire crew, all gone.\" and \"The last entry in their log made no mention of any trouble.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#14982"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It looks like to me we're gonna lose the war for the first goddamned time and, Dick, goddamn it, you're going along with it, buying into this Kissinger bullshit -- \"detente\" with the Communists. \"Detente\" -- it sounds like two fags dancing. Jack, we're not living in the same country you and I knew in '46. Our people are just not gonna sacrifice in major numbers for war. We can't even get 'em to accept cuts in their gas tanks. Hell, the Arabs and the Japanese are bleeding the shit out of our gold .. And whose fault is that? If we'd won in Vietnam ... It's nobody's fault, Jack. It's change -- which is a fact of history. Even that old cocksucker Hoover's dead. Things change. ----- In the preceding conversation, were the sentences \"Our people are just not gonna sacrifice in major numbers for war.\" and \"We can't even get 'em to accept cuts in their gas tanks.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#63443"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm not givin' it up jus' yet... C'mon, I say we bounce now, kick it for a lil' bit, play some craps. ...Maybe spend the night? ----- In the preceding conversation, were the sentences \"I'm not givin' it up jus' yet...\" and \"C'mon, I say we bounce now, kick it for a lil' bit, play some craps.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#34035"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh, what?... your servant, sir. And I am his. ----- In the preceding conversation, were the sentences \"Oh, what?...\" and \"your servant, sir.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#40029"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I can't believe no one called back. I better... Who ya calling? ----- In the preceding conversation, were the sentences \"I better...\" and \"Who ya calling?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#88692"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Don't be deceived, Irene. These are just the clothes. He has to wear them. Something I could never do. What's wrong with him? You have more in common than you know. ----- In the preceding conversation, were the sentences \"Don't be deceived, Irene.\" and \"These are just the clothes.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#70170"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Thank you, sir. But I like these just fine. Not doin' them very fine, O'Neil. I'll try anyway, sir. You'll try what we tell you to try, O'Neil. Go regulation. ----- In the preceding conversation, were the sentences \"I'll try anyway, sir.\" and \"You'll try what we tell you to try, O'Neil.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#91968"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You wouldn't like what you'd see. You don't know me anymore. I don't know me anymore. We can't pretend this isn't happening. Please -- not now. Why didn't you come to me? I don't know. You used to like to touch me -- to make love to me. It's more involved than that. It was a place to start. You think that's the answer? Sex? Is that what you want? You want me to make love to you? I don't want our lives ruined because of this. I love you, Frank. I want this to work -- but you have to help me. You have to come back from where ever it is you are. ----- In the preceding conversation, were the sentences \"You don't know me anymore.\" and \"I don't know me anymore.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#2475"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Bullshit it's cosmetic! My fucking tooth was cracked in half. I made the son of a bitch write it in as a cavity. The department's dental is for shit. Whoa, whoa... There he is. ----- In the preceding conversation, were the sentences \"Bullshit it's cosmetic!\" and \"My fucking tooth was cracked in half.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#27393"
            ]
        ],
        "round#4": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: But you're sure? He was at the campground yesterday. So... It's wrong. Guy with a rental car and hundred dollar sneakers sleeps in a tent? ----- In the preceding conversation, were the sentences \"So...\" and \"It's wrong.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#63539"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Don't go reading my lips, man. That's an intrusion. Save that shit for the sniper school. Comprende? Sorry... Habit. ----- In the preceding conversation, were the sentences \"Sorry...\" and \"Habit.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#28826"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Where we going? I'm trying to think of where there's a place to have a drink around here. Isn't there one in the Taft Hotel? ----- In the preceding conversation, were the sentences \"Where we going?\" and \"I'm trying to think of where there's a place to have a drink around here.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#77108"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Go on back to the hotel. Please, Eddie, don't beg him. Would you go on back to the hotel? Take a cab, go on back to the hotel. Doesn't all of this come through to you, Eddie? Doesn't any of this mean anything to you? That man, this place, the people. They wear masks, Eddie. And underneath the masks they're perverted, twisted, crippled. Shut up. ----- In the preceding conversation, were the sentences \"Doesn't any of this mean anything to you?\" and \"That man, this place, the people.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#9454"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Say, Schulz -- you guys had machine gun practice last night? Ach, terrible! Such foolish boys. Such nice boys. I'd better not talk about it. It makes me sick to my stomach. ----- In the preceding conversation, were the sentences \"I'd better not talk about it.\" and \"It makes me sick to my stomach.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#86042"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Chris, what if I were to cut you in as partner in this project - together we could make it swing, all it needs is a good clean out and the power on, then we're in business. I don't know man, I'll drink beer and shoot crap with you anytime, but this is different. Damn right it is, it's a chance to do something meaningful for a change, to leave our mark on this town. Hell, you'll probably be gone in another six months and all you'll have done is taught some kids the lines to a Led Zep' song - c'mon, don't run out on me now! Alright I give in. But let's not end up in jail. Okay? You got my word on it. ----- In the preceding conversation, were the sentences \"But let's not end up in jail.\" and \"Okay?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#62788"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What's happening? She's gone -- Don't say anything. Don't alarm them. Just go! I'm trying to. ----- In the preceding conversation, were the sentences \"Don't alarm them.\" and \"Just go!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#9871"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: <i>Now the bitch was getting personal.</i> That's the only way you can cope with the route your life has taken. The fact that you made the choice to pursue this life- style... much to the chagrin of your mother... who is so clearly ashamed of you. Imagine her shame when we cart you off to prison because you won't just tell the truth about what really happened. <b> EXT. NEVADA DESERT -- DAY FOR NIGHT [MESCALINE TRIP] ----- In the preceding conversation, were the sentences \"The fact that you made the choice to pursue this life- style... much to the chagrin of your mother... who is so clearly ashamed of you.\" and \"Imagine her shame when we cart you off to prison because you won't just tell the truth about what really happened.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#13692"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What's the hurry? A hunting accident. Jack and Twombley. Huh? I figured you already heard. Twombley, Jesus. We got to get moving: I got to get up there. How would I know? C'mon, you drive. We'll take my truck. ----- In the preceding conversation, were the sentences \"Twombley, Jesus.\" and \"We got to get moving: I got to get up there.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#90937"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: They were all standing around when he wrote it. It was after they got back from fishing. Get the Governor on the phone! You can't get him on the phone. He's out duckshooting now. Fishing! Duckshooting! How do you like that. A guy does nothing more strenuous for forty years than play pinochle -- he gets elected Governor and right away he thinks he's Tarzan! ----- In the preceding conversation, were the sentences \"Fishing!\" and \"Duckshooting!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#60386"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Easy. You've got to keep still for a bit, the last thing we need is a coronary. You're the Doctor, sweetheart. 'Guess the atropine worked, then. Convinced all those that needed convincing: you're an official dead lady. And what's Steven's status? Still alive, but it's just a matter of time. And then will come your miraculous resurrection -- -- \"oh, no, Officer, I'm very much alive -- just a joke to beat my husband at his own clever game -- What? What do you mean he's dead? It's all my fault, I may as well have killed him myself!\" \"But you didn't, Ma'am. We have all these witnesses that saw...\" well, whoever it ends up being that finally shoots him -- -- the James Dean wannabe with the hair trigger -- -- or might turn out to be -- very big surprise -- that Jenzen girl. The little bitch has the right stuff. She nearly put a bullet in Price right after your \"demise.\" So what stopped her? It's complicated. But don't worry -- -- there's already been way too many complications for a very simple plan. You ever find out what happened to Melissa Marr? Not yet. So we don't even know if she's alive or dead -- -- Price killed her, there's no other explanation -- -- there's plenty: for all we know, Steven's got her spying on us right now -- -- bullshit -- -- the whole thing is falling apart! ----- In the preceding conversation, were the sentences \"So what stopped her?\" and \"It's complicated.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#97960"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I ate a guy last night. And how did you feel when you ate this guy? I don't know. I don't remember doing it. ----- In the preceding conversation, were the sentences \"I ate a guy last night.\" and \"And how did you feel when you ate this guy?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#2297"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: This conversation... ... is over. ... is over. ----- In the preceding conversation, were the sentences \"This conversation...\" and \"... is over.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#11748"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Pull up! We did it! Holy shit, we did it! Pull up! Now, Buckaroo Banzai? Now! ----- In the preceding conversation, were the sentences \"Holy shit, we did it!\" and \"Pull up!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#96069"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You did that deliberately. You knew all along I'd like them. It was a trick. I tricked you into meeting some people you'd think were great. I thought it would be fun to introduce you to someone with a Tina Turner album and then see whether you still felt the same way. ----- In the preceding conversation, were the sentences \"You did that deliberately.\" and \"You knew all along I'd like them.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#67628"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Shields. Battle stations. Shields up. Battle stations. ----- In the preceding conversation, were the sentences \"Shields up.\" and \"Battle stations.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#86484"
            ]
        ],
        "round#5": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: The convent was built for over fifty. Not many of us left... just us and the chickens. How do you survive? Oh, we own the land around here. But we rent it out. We keep a few acres for ourselves,  some wheat, corn, some vegetables. Well that's a lot of land. You must have help. Do you have field hands that help you? No. We work the land alone. No-one but Sister Marguerite and I are permitted contact with the public. Sister Anne, which was Agnes' room? ----- In the preceding conversation, were the sentences \"No.\" and \"We work the land alone.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#51421"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'll take it. And then what? Well, then you could swallow it and it'd all dissolve, see? And the moonbeams'd shoot out of your fingers and your toes, and the ends of your hair. Am I talking too much? ----- In the preceding conversation, were the sentences \"And then what?\" and \"Well, then you could swallow it and it'd all dissolve, see?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#99888"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm fucking out of here. Lawford? Out of this fucking job. This job sucks. Working outside in the winter sucks. ----- In the preceding conversation, were the sentences \"This job sucks.\" and \"Working outside in the winter sucks.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#20077"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Down Western Avenue. We were going sixty-five miles an hour. You know what I mean? Take that mush out of your mouth! ----- In the preceding conversation, were the sentences \"Down Western Avenue.\" and \"We were going sixty-five miles an hour.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#54442"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It sounds hysterical, but Otis just rubbed up against me and I'd kind of like to change into something of yours. You know it could be disaster. He's so allergic. It's terrifying. Borrow whatever you like. I'll change back before we leave. Whatever you like. I'm afraid it'll all be too big for you. Are you alright, Clair? I'm fine. I'm fine. Well, I'm a little stressed. And I've been taking pills to get my weight down since the baby. I'd say it was down. And the doctor said they might make me a little jumpy. I've got a ghastly headache, actually. You want a Tylenol, or something? I'd love a Xanex. Sally, please don't tell Sophia that I'm not breast feeding. Why would she care? You know Sophia. She's so damned judgemental. And she's so damned... perfect. And so fucking... serene. Just fucking don't tell her. Because you know Mac thinks she's God. And I can feel him comparing. You need to knock off the pills, Clair. Just don't fucking tell her. It's not going to come up. ----- In the preceding conversation, were the sentences \"Borrow whatever you like.\" and \"I'll change back before we leave.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#67169"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I was told this impostor was dead! ... You knew you had a double? He is my brother. ----- In the preceding conversation, were the sentences \"I was told this impostor was dead!\" and \"... You knew you had a double?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#54339"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: This doubles my investment. Still no word of your courier? We'll find him. But at least this will satisfy our friends here. You've been invited to the New Year reception at the Presidential Home. I understand your brother is here as well; I hope he'll come. Six million dollars in cash is a high price for a piece of a country in the middle of a revolution. ----- In the preceding conversation, were the sentences \"Still no word of your courier?\" and \"We'll find him.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#45656"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm sorry... I... couldn't sleep... What's wrong? I... It used to be, when I was a kid, what meant most to me about this job was there were no ifs. Life and death, right and wrong. When someone called the fire department, we came... Those guys don't know how much I love them... You don't leave people hanging... cause that's what it's all about. It's loyalty. It's 'till death do us part. Isn't that what you heard?... It's you go, we go... Cause without that, it's the end of families, it's the end of the fire department... and when the fire department stops coming... that's the end of the fucking world... I'm sorry I came, Helen, it's just... it's just there's nobody I can talk to... I miss you. ----- In the preceding conversation, were the sentences \"I... couldn't sleep...\" and \"What's wrong?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#23034"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh well...  ... look through the wigs, maybe it got caught- Real diamonds in a wig. The world we live in... Where's my coat? ----- In the preceding conversation, were the sentences \"Real diamonds in a wig.\" and \"The world we live in...\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#34685"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: The State has some reason to be interested in this man's proposition, Your Eminence... The Judgment is ours! Naturally. But I would really deplore the loss of such a potential opportunity for Spain for a... dispute over a point of geography. ----- In the preceding conversation, were the sentences \"The Judgment is ours!\" and \"Naturally.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#26259"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Where is he now? Do you know? I think I... I think I killed him. I stabbed him with something and he fell. Will you be OK now? I've got to go to your place to see if he's still there. I've got to see if it's... if it's what we both think it is. Oh, no! You're not leaving me here all alone. I'm going with you. ----- In the preceding conversation, were the sentences \"Oh, no!\" and \"You're not leaving me here all alone.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#67238"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What's up? That was a pretty backhanded compliment. If I let people get away with things like that, I wouldn't be a good salesman. You're right. I apologize. But I still want to talk to you. Lead on. ----- In the preceding conversation, were the sentences \"I apologize.\" and \"But I still want to talk to you.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#45726"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: That was two hours -- two hours to get a second opinion -- and nothing changes. He's loose. He's out of control. It's very clear what needs to happen. I have work to do. What if he <u>is</u> working for someone else? What if he turned? Turn? To who? Where does he turn? What does he have to offer? He's got nothing. He's a killer. He's a piece of equipment for crissake. Where's he gonna turn? ----- In the preceding conversation, were the sentences \"It's very clear what needs to happen.\" and \"I have work to do.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#40201"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: My Lord. It must feel real nice living inside your head with Peter Pan and the Easter Bunny. Don't talk to me like that. She was my mother for Christsakes. And now I find out she was... She was a --! Don't say that! Well, what am I supposed to think? I can't believe she never told me? We spoke at least once a week. How could she do that? How did she meet him? Did Dad know? Anything else in that envelope? No, I don't think so. I -- ----- In the preceding conversation, were the sentences \"I can't believe she never told me?\" and \"We spoke at least once a week.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#79961"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Dickie, my God! Hello Meredith. I was looking at you, your clothes, I wouldn't have known you... Well, you've spotted me and so you get the reward. What? Just kidding. Are you alone? Hardly. I couldn't be less alone. ----- In the preceding conversation, were the sentences \"I was looking at you, your clothes, I wouldn't have known you...\" and \"Well, you've spotted me and so you get the reward.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#22484"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: There ought to be a law against dentists reading. Matter of fact, I thought there was. Anyway, this is an obsession. He can't be persuaded out of it. He's comin' this-a-way! The jaw- breaker! ----- In the preceding conversation, were the sentences \"Matter of fact, I thought there was.\" and \"Anyway, this is an obsession.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#59944"
            ]
        ],
        "round#6": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What do you mean, no? He says it's a game. All games have a strategy. All you gotta do is look at the map. His victims aren't random. It only means that they appear to be random. There's a connection, we just have to find it. ----- In the preceding conversation, were the sentences \"What do you mean, no?\" and \"He says it's a game.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#49295"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Get out of here. That's why she hates me. That's why she makes me sleep in the basement. In the crawl space, with the rats and the casks of Amontillado. Come on. Up. ----- In the preceding conversation, were the sentences \"In the crawl space, with the rats and the casks of Amontillado.\" and \"Come on.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#81862"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What year is this? 1982! March 18, just like we planned! My calculations were absolutely correct! Thirty years! God, I cannot believe it's been thirty years! Sure, it was a long time ago -- longest I've ever had to wait for the results of an experiment! ----- In the preceding conversation, were the sentences \"My calculations were absolutely correct!\" and \"Thirty years!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#9146"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Is this what you killed them with? You've been listening to rumors. Our cars were seen together in Felton. They're calling me an accessory to murder. You are. Now. ----- In the preceding conversation, were the sentences \"Is this what you killed them with?\" and \"You've been listening to rumors.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#47891"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm surprised you aren't blind by now. I'm sorry. Who are you? ----- In the preceding conversation, were the sentences \"I'm sorry.\" and \"Who are you?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#69511"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: They got nothing. This guy is very sharp. If he hasn't figured us out yet, he will. ----- In the preceding conversation, were the sentences \"This guy is very sharp.\" and \"If he hasn't figured us out yet, he will.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#91576"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Hell, that wasn't half bad.. Get going...I'll keep it busy.... It'll come for the plane. It's attracted to metal. The electro- magnetic impulse.... Will you get the bloody hell out of here.... ----- In the preceding conversation, were the sentences \"It's attracted to metal.\" and \"The electro- magnetic impulse....\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#60636"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Look down there, tell me what any of this matters. Struggles of men get swallowed by the bigness. Soon there won't be a trace of our troubles... or us. You're wrong. Everything we do leaves its mark. You said it yourself -- there are hundred- year-old footprints in the tundra. ----- In the preceding conversation, were the sentences \"Soon there won't be a trace of our troubles... or us.\" and \"You're wrong.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#85206"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Ingenious costume. Let me guess ... Trust-fund goody-goody? Course you're feeling fine ... You almost made a monster the Mayor of Gotham City. I am the light of this city. <u>And</u> I am its mean, twisted soul. Does it really matter who's the \"mayor\"? It does to me. Yawn. ----- In the preceding conversation, were the sentences \"It does to me.\" and \"Yawn.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#14687"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What is this? Someone else you think escaped us, like Frank? No, No, this one didn't escape. You told me you'd always been in Hell. You were wrong. Look at it. LOOK. IT'S YOU. Nonsense, I... It's you! You HAVEN'T always been as you are. You were HUMAN. Remember. Remember all your confusions. Think! ----- In the preceding conversation, were the sentences \"LOOK.\" and \"IT'S YOU.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#74474"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Wait a minute, Walter. You can't do that! My name is Louis Peluso. ----- In the preceding conversation, were the sentences \"You can't do that!\" and \"My name is Louis Peluso.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#71028"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Gimme three. At ease. Captain Pierce, you have a seriously wounded patient for whom you are responsible. Yet I find you in a poker game. You betcher ass, Dad. What? ----- In the preceding conversation, were the sentences \"At ease.\" and \"Captain Pierce, you have a seriously wounded patient for whom you are responsible.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#96788"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Can't we just see the end? They've got the real thing outside. It's not the same. ----- In the preceding conversation, were the sentences \"They've got the real thing outside.\" and \"It's not the same.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#6021"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm totally blown away. You're getting married. It seems like only yesterday I showed you how to have oral sex. Deb, I want to throw you a shower. ----- In the preceding conversation, were the sentences \"It seems like only yesterday I showed you how to have oral sex.\" and \"Deb, I want to throw you a shower.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#22947"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: And what are you thinking we should do now? I've filed a report with Father Frank. A lot of good that'll do. We need all the help we can get. I've dealt with these people before, Maya. They're not going to help us. We'll see Father Frank in the morning. There's nothing to be done until then. Alright, Maya. We'll do it your way. ----- In the preceding conversation, were the sentences \"I've filed a report with Father Frank.\" and \"A lot of good that'll do.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#28567"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: How did you meet Choco? I found him pan-handling on Third Street Promenade. Took him under my wing. We been hunting together ever since. ----- In the preceding conversation, were the sentences \"Took him under my wing.\" and \"We been hunting together ever since.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#86375"
            ]
        ],
        "round#7": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Reckon he hated Perfection more than us? You suppose he <u>wanted</u> to kill himself? If he did, why didn't he use his damn shotgun? Maybe he just couldn't pull the trigger... Oh sure, he figured it was easier to die of thirst? Come on, sombody must've chased him up there. Oh, you mean somebody who ain't scared of a twelve gauge shotgun. And then what did they do? Camp out down below and just wait for him to die? ----- In the preceding conversation, were the sentences \"Oh sure, he figured it was easier to die of thirst?\" and \"Come on, sombody must've chased him up there.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#67636"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: David Reynolds, I'm the Manager here. Sit down, John. Jack. ----- In the preceding conversation, were the sentences \"David Reynolds, I'm the Manager here.\" and \"Sit down, John.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#72290"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: So, you just got out? Jesus, Caesar! What? It ain't no big fuckin' deal. I know who Don hires. Did you know he did time himself? ----- In the preceding conversation, were the sentences \"So, you just got out?\" and \"Jesus, Caesar!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#65024"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What happened? Were you kicked out? No. What happened? I'm supposed to turn everybody in, apologize to the school and all will be forgiven. ----- In the preceding conversation, were the sentences \"What happened?\" and \"I'm supposed to turn everybody in, apologize to the school and all will be forgiven.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#24599"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: We're not gonna be able to pump it! Alright. Everybody grab your gear! This' is where we get off! ----- In the preceding conversation, were the sentences \"Alright.\" and \"Everybody grab your gear!\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#60922"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What do you want, Senator? Saunders--it's going to go pretty bad for Jeff tomorrow. There's only one thing that can be done for him now--  I--I've written his resignation. He resigns under protest--denying all charges. No one will ever be sure if he was guilty or not. It leaves him with at least a shred of honor. The other way--branded openly in the Senate--expelled--he'll never live it down. Rather a simple compromise than utter ruin. In a year--the whole thing might be forgotten-- What are you driving at? You want *me* to get him to sign that? Yes-- Why don't you do it yourself? He's lost complete faith in me-- Well--me, too! But--you love him, don't you, Saunders? What are you talking about? What difference--? Do you? All right--*yes*! And what does that make me to him? *Nothing*! I've got to go about my own business--and forget it! I thought I could, too. *My* business--this fine future! I have no future I *care* about, if this boy is broken! I--I can't sleep. The only important thing in my life now is to save what I can for him. I want him to get a start again--I'll see that he's taken care of as long as he lives--! Saunders--whether you ever mean anything to him or not-- *Me! Me*! I *still* don't see why I should--! If you love him so much, why don't you go to him yourself and-- ? Or better still--get up in that Senate and *fight* for him! It's too late now--it's *impossible*! So I go right back where I was-- carrying compromises--covering up-- back to political tricks--this time for--! No! I was just getting rid of all that. If I did *anything*, I ought to go and tell him to stand up and--. No! I don't want any part of it! Smith or anything else! I'm all through. I want to be left alone! ----- In the preceding conversation, were the sentences \"No!\" and \"I don't want any part of it!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#91868"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: How did you get here? I have always been here... Are there any other humans? Gracious... no. Have any other people ever passed through? ----- In the preceding conversation, were the sentences \"How did you get here?\" and \"I have always been here...\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#50650"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Good evening. You're twenty minutes late. Sorry. ----- In the preceding conversation, were the sentences \"Good evening.\" and \"You're twenty minutes late.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#96308"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Listen to me. He's here. Who? Who is here? ----- In the preceding conversation, were the sentences \"Who?\" and \"Who is here?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#127"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You get quick action, don't you? Margo, I wouldn't think of taking that girl away from you... You said yourself my inventory was in good shape - all of my merchandise put away. To keep her here with nothing to do - I'd be standing in her way... and you need her, Max. But what could she do? She'd be a great help - read scripts, interview people you have to see, get rid of the ones you don't have to... you'd be a man of leisure- Well... Think of your health, Max - more time to relax out in the fresh air at a race track... I don't know if this would be a wise move... Promise. I promise. That's my Max. ----- In the preceding conversation, were the sentences \"Margo, I wouldn't think of taking that girl away from you...\" and \"You said yourself my inventory was in good shape - all of my merchandise put away.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#4364"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You stole my luggage? You-- I'm a thief. Sue me. Where's my bag? ----- In the preceding conversation, were the sentences \"I'm a thief.\" and \"Sue me.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#27711"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Can I help you? You might hold this for me. Love to. Correct me if I am wrong... We are facing north, aren't we? Facing north... I'd hate to commit myself without my compass... Pardon me... are you an explorer? No... I am looking for the Eiffel Tower. Is that thing lost again?... Listen... if you are interested in a view... I am interested in the Eiffel Tower from a technical standpoint. Technical... I couldn't help you from that angle. You see, a real Parisian only goes to the top of the tower in moments of despair to jump off. How long does it take a man to land? Now, isn't that too bad! The last time I jumped I forgot to clock it! Let me see... Eiffel Tower... Your finger, please. ----- In the preceding conversation, were the sentences \"No...\" and \"I am looking for the Eiffel Tower.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#31365"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Like how? Well, I feel that...things are getting to that point in a relationship. When two people share...a special moment between them. I think you're so right, Kevin. You want to do it? Yes -- ----- In the preceding conversation, were the sentences \"I think you're so right, Kevin.\" and \"You want to do it?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#9974"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: But with this place, I - - I wanted to give  them something real, something that wasn't an illusion, something they could see and  touch. An aim devoid of  merit. But you can't think through this one. You have to feel it. You're absolutely right. Yes, you're right. Hiring Nedry was a mistake, that's obvious. We're over- dependent on automation, I can see that now. But that's all correctable for the next time around. John, John. John, you're still building onto that Flea Circus, that illusion. And now you're adding onto it by what you're doing here. That's the illusion. ----- In the preceding conversation, were the sentences \"John, John.\" and \"John, you're still building onto that Flea Circus, that illusion.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#37140"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: If there's any doubt, we matched the indents of the bitemark on the note against the Smithsonian teeth. This is your boy... He folded the bottom part, including what Lecktor tore out. In this enlargement of the back side, oblique light revealed impressions. We can make out: 'six-six-six'. I didn't spot it until I had this high-contrast print. I advised Chicago as soon as I saw it. Issue the toilet paper tear as a... ----- In the preceding conversation, were the sentences \"This is your boy...\" and \"He folded the bottom part, including what Lecktor tore out.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#99463"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Right in line with that burning tree. I don't see anything. It's there. The fog's thicker now, but it's there. What do you think started those fires? ----- In the preceding conversation, were the sentences \"The fog's thicker now, but it's there.\" and \"What do you think started those fires?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#64501"
            ]
        ],
        "round#8": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I' ll be honest with you, Kid. A grifter comes in here with a fifteen hundred dollar D-K-fucking-N-Y suit, cooler than an Eskimo in winter and tells me he wants to grift for me? First thing I have to ask myself is, is he playing for me or is he just plain playing me? You tried it once. We got caught. So you know it won't happen again. ----- In the preceding conversation, were the sentences \"I' ll be honest with you, Kid.\" and \"A grifter comes in here with a fifteen hundred dollar D-K-fucking-N-Y suit, cooler than an Eskimo in winter and tells me he wants to grift for me?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#56300"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Why do we have to race for heaven's sake? ! I want to get into the light, that's all. Please... ----- In the preceding conversation, were the sentences \"Why do we have to race for heaven's sake?\" and \"!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#10237"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Probably as close to the Getty as I'll ever come. Unless you care to be my \"patron,\" Nels. You wouldn't be the first successful thief to become a patron of the arts. In your dreams. Don't underestimate me. I've got original ideas of my own. Warhol got famous doing a soup can. What would you think of a cellular phone done in acrylics? Are you busting my chops or what? ----- In the preceding conversation, were the sentences \"Probably as close to the Getty as I'll ever come.\" and \"Unless you care to be my \"patron,\" Nels.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#22784"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: One of the new kids said they're farming those acres just north of the swamp. He said he saw a crop duster flying around the place. I'm not in the mood right now, Ray. He said they keep it parked out behind the barn. Can't be that hard to fly a plane. Lots of people do it. They're called pilots! I'm serious, Ray. I'm not in the mood for one of your stupid, fucked-up plans right now. I don't see you coming up with any plans. My plan is on his way to Pittsburgh right now. That congenital idiot just got himself a pardon signed by the governor thanks to us, but we can't seem to do nothing for ourselves. Don't you feel a little disgusted right now? Crop duster. I ain't getting in no airplane with you. I'm finally wrapping my mind around the concept. They threw us in this shithole for life. Don't you get it, Ray? We're gonna die here! Might as well head up to the cemetery, pick a plot and start digging. ----- In the preceding conversation, were the sentences \"Crop duster.\" and \"I ain't getting in no airplane with you.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#67246"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: They had a large chunk of the garbage file? How much do they know? Not everything. But enough to implicate us. You said the worm was untreaceable! Yeah. To civilians. But they're hackers. But don't worry. All we have to do is launch the Da Vinci virus, and then they'll all be put away. Launch the Da Vinci virus? You can't do that! No one believes the guilty. Besides, by the time they realize the truth, we'll be long gone with all of our money. ----- In the preceding conversation, were the sentences \"All we have to do is launch the Da Vinci virus, and then they'll all be put away.\" and \"Launch the Da Vinci virus?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#85039"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I want it to have my children! Yeah, I bet it looks crispy in the dark. Yo, hit the lights. ----- In the preceding conversation, were the sentences \"Yeah, I bet it looks crispy in the dark.\" and \"Yo, hit the lights.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#63265"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What's this? What. This. Jack Daniels. Don't worry, I'm paying for it. That's not the point. What's the point? The point is we don't serve niggers here. Where? ...I'm very careful about that. ----- In the preceding conversation, were the sentences \"That's not the point.\" and \"What's the point?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#46602"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You didn't know? But then why did you... well, don't worry. It's relatively mild. Yeah, well if I claw my face off, just pack it in ice, okay? Jesus... the cops were probably right. My uncle was messed up with a bunch of fry brains and they went berserk on him. ----- In the preceding conversation, were the sentences \"It's relatively mild.\" and \"Yeah, well if I claw my face off, just pack it in ice, okay?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#10908"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: So how long will you be in England? Plans are for the architects, politicians and so forth. You must have a visa or something... You're asking for my documents? No, no... ----- In the preceding conversation, were the sentences \"You're asking for my documents?\" and \"No, no...\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#28757"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It looks open on the other side. Don't know what's behind it. One way to find out. ----- In the preceding conversation, were the sentences \"Don't know what's behind it.\" and \"One way to find out.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#87894"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I got here as fast as I could. Where's Cathy? At Annie's house. She's all right. ----- In the preceding conversation, were the sentences \"At Annie's house.\" and \"She's all right.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#44350"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Hi. Look, I'm kind of tired - I think I'll go to bed. I made spaghetti. Do you want some? I-I really have to get up early for class tomorrow. ----- In the preceding conversation, were the sentences \"Do you want some?\" and \"I-I really have to get up early for class tomorrow.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#37019"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: <i>Holy shit... this bitch is fierce.</i> I've been training since I was twelve. Knives. Guns. Throwing stars. You name it... I can fight with it. I'm a hard worker and a fast learner. Nothing scares me. I'm not afraid to die. ----- In the preceding conversation, were the sentences \"Guns.\" and \"Throwing stars.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#35700"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You want out of this place, don't you? Don't tell me you're starting to like it here. No, I don't like it here. Look around. There's nothing but ass. Male ass! Balls and ass! Believe you me, I'm getting out of here. What does that mean? Forget it. I'm not gonna forget it. What does that mean? If you've got a plan, I think I have a right to know about it. I told you my plan. Getting a map from a chubby chef named Cookie? Dragging our asses through the swamps in search of some worm-eaten boat? That ain't a plan, that's a vacation for two in the hole. When you've got a map to New York City, you get back to me. ----- In the preceding conversation, were the sentences \"Believe you me, I'm getting out of here.\" and \"What does that mean?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#69994"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: About him? No. Well, not exactly...it's that...I felt like I wasn't in control. For the first time since...all that. I'm scared. ----- In the preceding conversation, were the sentences \"For the first time since...all that.\" and \"I'm scared.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#13386"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Can't you listen to me? Don't you want to get out of here? Why should I want to get out of here? This is where I live. But you're the one that wanted to get away. You're the one that came into my cab. I musta been stoned. Do they drug you? Oh, come off it, man. ----- In the preceding conversation, were the sentences \"You're the one that came into my cab.\" and \"I musta been stoned.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#98717"
            ]
        ],
        "round#9": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What -- you don't have the medallion? That fool woman took it. You be careful around her, Jack -- she's pretty enough, she'll steal your heart -- but pure evil inside. I'll watch my back. Bosun! Set up Mr. Sparrow's quarters, nice and fine ... in the brig. Meaning no disrespect, of course. ----- In the preceding conversation, were the sentences \"You be careful around her, Jack -- she's pretty enough, she'll steal your heart -- but pure evil inside.\" and \"I'll watch my back.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#95804"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Is it true you're getting a divorce? Comrade? Why, you... you little bastard! ----- In the preceding conversation, were the sentences \"Is it true you're getting a divorce?\" and \"Comrade?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#35788"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Can you take that damn thing off the table. You mean my championship trophy? My bad. ----- In the preceding conversation, were the sentences \"Can you take that damn thing off the table.\" and \"You mean my championship trophy?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#44272"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Of course, I don't know every doctor who works here... Dr. Ravell's the finest surgeon on the staff. You must know him. He's incredibly handsome, gentle, considerate. He's being sued for sexual assault right now, but --  It's not true. He was set up. Well, I certainly would have heard about that. Of course, he's only here two days a week. He's also on staff over at Loma Vista. ...I don't think I know that hospital. It's in a very pretty area that gets a lot of sun, has palm trees out front, mountains in the background... Really? You've just described all of Southern California. ----- In the preceding conversation, were the sentences \"Dr. Ravell's the finest surgeon on the staff.\" and \"You must know him.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#597"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: He just <u>appeared</u>. You have no idea how he arrived in this lake? No. Do you? ----- In the preceding conversation, were the sentences \"You have no idea how he arrived in this lake?\" and \"No.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#49031"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: North Island, have you got any additional information? Over. Affirmative, Arctic Warrior. The vessel Chimera was registered to The Dobbins Kirk Line, Halifax. Nova Scotia. Date of commission day nine month seven year one nine three two. Over. ----- In the preceding conversation, were the sentences \"The vessel Chimera was registered to The Dobbins Kirk Line, Halifax.\" and \"Nova Scotia.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#79121"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Looks like the weather is changing. Please, Giulia; must you always emphasize the obvious? I can see for myself that the weather is changing. ----- In the preceding conversation, were the sentences \"Looks like the weather is changing.\" and \"Please, Giulia; must you always emphasize the obvious?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#94304"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I don't get this. Miss Jacqueline was always so fond of you -- she was always talking about you -\u0097 had your picture in her office. I know. For the first time I'm beginning to be frightened. I almost feel as if I'd never known my sister. Nothing's happened to her. It's just that I can't understand her not getting in touch with you. I can't understand it at all. Well, don't worry. I saw Miss Jacqueline only a week ago. I saw her at a little restaurant the boy friend took me to -- an Italian place down in the Village \u0097-\t\"The Dante.\" \"The Dante?\" It's on Peary Street. Just ask the people who run it. They'll remember her. People who see Miss Jacqueline never forget her. I'll try there. ----- In the preceding conversation, were the sentences \"Miss Jacqueline was always so fond of you -- she was always talking about you -\u0097 had your picture in her office.\" and \"I know.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#36492"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: That's got her. Thanks. I'm Steve Christy. Welcome to Camp Crystal Lake. You got some grubby clothes? Climb into 'em. Alice, see if Bill has cleaned out the boathouse. I want him to start with the canoes. What happened to Brenda? You told her to sweep the courts. ----- In the preceding conversation, were the sentences \"Thanks.\" and \"I'm Steve Christy.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#37155"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Sorry, didn't realize she was right there. Did you have sex with her? To hell with sex. ----- In the preceding conversation, were the sentences \"Did you have sex with her?\" and \"To hell with sex.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#50745"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: No... Why?... Should I? Gee, yeah, you told me it was the best time you ever had. ----- In the preceding conversation, were the sentences \"Why?...\" and \"Should I?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#51027"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Here I am, darling... Darling!... Darling, it's all right... Mother's here. Emily - you musn't leave me now - you can't do that to me. They won't hurt you, darling. Mother's with you! Mother's looking after you! ----- In the preceding conversation, were the sentences \"Here I am, darling...\" and \"Darling!...\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#57595"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm not so sure the goddam thing's in his heart. 'Course it isn't, but how many chances do we get to go to Japan? With our golf clubs. ----- In the preceding conversation, were the sentences \"'Course it isn't, but how many chances do we get to go to Japan?\" and \"With our golf clubs.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#25348"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Adrian, you gotta come back to Hell. Dad's sick. He's sick? Yeah, he needs souls to live. When you guys left, you broke the gates. We gotta get the gates burning again before he dies. ----- In the preceding conversation, were the sentences \"He's sick?\" and \"Yeah, he needs souls to live.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#8598"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: He's ninety. He's practically dead already. How come <u>he</u> goes back and <u>I</u> stay here? Maybe he wanted to pick out his own casket? <i></i> HEY!! HEY, YOU! ! ----- In the preceding conversation, were the sentences \"Maybe he wanted to pick out his own casket?\" and \"<i></i> HEY!!\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#70076"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Get out, both of you! Charlie, please don't - What are you waiting here for? Why don't you go? ----- In the preceding conversation, were the sentences \"Get out, both of you!\" and \"Charlie, please don't -\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#45942"
            ]
        ],
        "round#10": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Mars, watch the cops! Kevin! Watch the back of the house! You won't die if you let me help. Bullshit! But if you stay in this house, I can promise you this -- <u>Shut up! Shut up and get on the floor</u>! You can't imagine the fucking you're going to get. ----- In the preceding conversation, were the sentences \"Watch the back of the house!\" and \"You won't die if you let me help.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#88651"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You're Julia, right? That's right. Who are you? I'm brother Frank. Oh. I came for the wedding. ----- In the preceding conversation, were the sentences \"Oh.\" and \"I came for the wedding.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#76540"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What do you need? A three-second burn to port, on my mark. It's on the board. ----- In the preceding conversation, were the sentences \"A three-second burn to port, on my mark.\" and \"It's on the board.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#18488"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm sorry we lost our tempers... I'm willing to forget if you are. Forget? You ask me to forget... Why, my ancestors would rise from their graves... and I'd only have to bury them again... A Firefly never forgets... I am willing to apologize... I'm willing to do anything to prevent this war. Nothing doing!! I've taken a lease on the battlefield. I'd lose my deposit, besides, I've already ordered the ammunition... ----- In the preceding conversation, were the sentences \"Forget?\" and \"You ask me to forget... Why, my ancestors would rise from their graves... and I'd only have to bury them again... A Firefly never forgets...\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#50806"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Um, Paul. On second thought, can you do me a favor and pretend I never said any of that. Sure dad. Thanks. ----- In the preceding conversation, were the sentences \"Um, Paul.\" and \"On second thought, can you do me a favor and pretend I never said any of that.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#59963"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I want my kid out of protective custody. Now. No fucking around. My wife and my kid on a plane tonight. I sign when they call me safe and sound. No fucking way. Fuck you, then. I sign nothing. ----- In the preceding conversation, were the sentences \"I want my kid out of protective custody.\" and \"Now.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#86026"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You better tell me what the hell's going on here! Hey, hey!! Take it easy! ! ----- In the preceding conversation, were the sentences \"Take it easy!\" and \"!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#29264"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Promise me... you won't ever tell Domino. What? <i>Promise me... you won't tell her... that I never fucked Pat Benatar.</i> ----- In the preceding conversation, were the sentences \"Promise me... you won't ever tell Domino.\" and \"What?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#69444"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: So if I needed a doctor, you could be it? I could be her. 'Her'. ----- In the preceding conversation, were the sentences \"I could be her.\" and \"'Her'.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#98469"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Very kind of you, sir. Thank you very much. I understand that you had a rather unfortunate encounter with the Police tonight. Yes, sir. I suppose you might call it that, sir. Hahaha, and how are you feeling now? Much better, thank you, sir. Feel like talking to us. Answering a few questions? Fine, sir, fine. Well, as I've said, we've heard about you. We are interested in your case. We want to help you. Thank you very much, sir. But first we'd like to find out a few things about you. What would you like to know, sir? Well, shall we get down to it? Yes, sir. Rubinstein takes out a notebook. ----- In the preceding conversation, were the sentences \"Fine, sir, fine.\" and \"Well, as I've said, we've heard about you.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#65421"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Of course, Finch. What? Whatever you hear about me, you agree. What are we gonna hear? You'll see. Gotta go. Sixteen minute round trip. ----- In the preceding conversation, were the sentences \"What are we gonna hear?\" and \"You'll see.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#78234"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Don't play games with me, little girl. I didn't do anything, mommy. Well then who did? ! Maybe it was Colleen... Who...is Colleen? ----- In the preceding conversation, were the sentences \"Don't play games with me, little girl.\" and \"I didn't do anything, mommy.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#91543"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's all my fault, I'm so sorry Doug. I had it coming from someone. Are you sure I shouldn't get a doctor. ----- In the preceding conversation, were the sentences \"I had it coming from someone.\" and \"Are you sure I shouldn't get a doctor.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#51776"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Here, I'll take it. It's my job. NO... It's all right. I got it. Don't worry about it. ----- In the preceding conversation, were the sentences \"It's my job.\" and \"NO...\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#74685"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Then I don't understand the reason for the delay! You don't have to understand. And bringing the Enterprise here?! What possible purpose could that serve? I have a purpose. Then perhaps you will enlight- en us? Silence, Romulan! ----- In the preceding conversation, were the sentences \"Then I don't understand the reason for the delay!\" and \"You don't have to understand.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#3803"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Don't look, Oswald. It's a surprise. A big bag of fan mail? Filthy lucre? Wait don't tell me ... Is it a broad? ----- In the preceding conversation, were the sentences \"Don't look, Oswald.\" and \"It's a surprise.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#40547"
            ]
        ],
        "round#11": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: That's a Turkish weave, you numbskull; it costs more than you'll earn in your lifetime -- Valcour. His chair. ----- In the preceding conversation, were the sentences \"That's a Turkish weave, you numbskull; it costs more than you'll earn in your lifetime --\" and \"Valcour.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#11360"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What... what are these interviews about? The... interviews are about sex, Ann. About sex? Yes. What about sex? Everything about sex. Like what? Like what they've done, what they do, what they don't do, what they want to do but are afraid to ask for, what they won't do even if asked. Anything I can think of. You just ask them questions? Yes. And they just answer them? Mostly. Sometimes they do things. To you? No, not to me, for me, for the camera. I don't... why... why do you do this? I'm sorry this came up. This is just... so... Maybe you want to go. Yes, I do. ----- In the preceding conversation, were the sentences \"Yes.\" and \"And they just answer them?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#2957"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Hey. Hey, what's up. You weren't at my game. Yeah, sorry about that. I had this meeting with this guy. ----- In the preceding conversation, were the sentences \"Yeah, sorry about that.\" and \"I had this meeting with this guy.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#29487"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You have it. Oh, no. I'm watching my figure. ----- In the preceding conversation, were the sentences \"Oh, no.\" and \"I'm watching my figure.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#997"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's what they said it is. An unfinished broadcast studio. You were right... I just drove to Seattle and back. ...Why? Remember Lyle Barton? ----- In the preceding conversation, were the sentences \"...Why?\" and \"Remember Lyle Barton?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#4184"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: But I hope that note goes to New York in your purse, for a rainy day. What are you going to do now, Tom? I don't know. Peter has a concert in Athens next month -- and he's asked if I want to go along, help out. He says goodbye by the way -- he's in rehearsal, otherwise -- Why do I think there's never been a Ripley rainy day? What? I know it was you -- I know it was you, Tom. I know it was you. I know you killed Dickie. I know it was you. Oh Marge. ----- In the preceding conversation, were the sentences \"I don't know.\" and \"Peter has a concert in Athens next month -- and he's asked if I want to go along, help out.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#32861"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Sit down. Is everything okay? You followed your intuition today and you were right on target. I should've listened. Thank you. About the alibi -- ----- In the preceding conversation, were the sentences \"Thank you.\" and \"About the alibi --\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#78098"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh, Mr. Baxter -- I'm glad you're here -- I was just going to get the passkey. What for? I thought I smelled gas coming from your apartment. Gas? ----- In the preceding conversation, were the sentences \"What for?\" and \"I thought I smelled gas coming from your apartment.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#86605"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Is he? Strange, I mean? Not really. Maybe if I just saw him on the street I'd have said that, but after talking to him... he's just kind of... I don't know, unusual. Uh-huh. So what's he look like? Why? I just want to know what he looks like, is all. Why, so you can go after him? Jesus, Ann, get a life. I just asked what he looked like. ----- In the preceding conversation, were the sentences \"Maybe if I just saw him on the street I'd have said that, but after talking to him... he's just kind of...\" and \"I don't know, unusual.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#6535"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Edvard! I haf question 'bout script. My vife Greta, she read. And she no like. Really? Was the third act too intense? No. She tink Lobo is waste of my time. Lobo don't talk. But Tor, it's a starring part! You're second billed. Bela, he talk. Loretta, she talk. But Tor, he no talk. ----- In the preceding conversation, were the sentences \"She tink Lobo is waste of my time.\" and \"Lobo don't talk.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#68129"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh. How old are you? Forty. We were probably in school together. You went to Berkley? ----- In the preceding conversation, were the sentences \"How old are you?\" and \"Forty.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#54522"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: And make sure you read the footnotes in Levinson's class. That's where all her exam questions come from. Wow. I'm glad I met you. ----- In the preceding conversation, were the sentences \"That's where all her exam questions come from.\" and \"Wow.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#50530"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Let me have a word outside with Agent Nicolet for a moment? Take your time. Thanks. ----- In the preceding conversation, were the sentences \"Let me have a word outside with Agent Nicolet for a moment?\" and \"Take your time.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#84930"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It doesn't matter how much you worked on them. It matters how much you can get for them. I can get ten. ----- In the preceding conversation, were the sentences \"It matters how much you can get for them.\" and \"I can get ten.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#33826"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Good evening. Good evening. You see, here we are again. I take that as a great compliment to Sam. I suppose he means to you Paris of, well, happier days. ----- In the preceding conversation, were the sentences \"Good evening.\" and \"You see, here we are again.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#30985"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Twenty-five thousand? For yourself? Yeah. Why do you need that much? Well, what's the difference? I just need it. Well, I mean... you know, I gotta ask you. That's a lot of money. You're not asking for a box of popcorn, you know. I mean... I'm aware of that. We don't have to turn this into a big deal. Okay? We don't have to have a fight. It was important to me. But forget it. Just something I wanted to do for myself. Who's fighting? I mean, I'm, you know, tell me what it's for. ----- In the preceding conversation, were the sentences \"I just need it.\" and \"Well, I mean... you know, I gotta ask you.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#96264"
            ]
        ],
        "round#12": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Your phone number? In case you need me to testify about the shooting. They'll clear you. ----- In the preceding conversation, were the sentences \"Your phone number?\" and \"In case you need me to testify about the shooting.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#57871"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: So Mildred says to the cashier, 'I saw the new Streisand picture.' 'God, I just love it at the end when she brushed Robert Redford's hair off his forehead the way she did when they were together, and the way they gave each other this look that said they still loved each other, but knew they couldn't be together. That look was so... romantic.' That's great, Harry. So what's the -- What she did not say was, 'I just loved the way the director moved the camera so much it made me fuckin' seasick.' All she cared about was that look. All she remembered was that look. And why do we remember things in movies? Because we can see them. ----- In the preceding conversation, were the sentences \"So what's the --\" and \"What she did not say was, 'I just loved the way the director moved the camera so much it made me fuckin' seasick.'\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#72751"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Settle what? C ' mon! I don't wanta fight you, I wanta thank you. Let's have a drink and forget this-- God damn it, you fucking virgin prick--step outside. ----- In the preceding conversation, were the sentences \"I don't wanta fight you, I wanta thank you.\" and \"Let's have a drink and forget this--\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#68904"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I dunno .. Guess the dozer musta shifted him? You need some hands up here to look .. You heard. Look for the knife. ----- In the preceding conversation, were the sentences \"You heard.\" and \"Look for the knife.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#40110"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Sam? I--the Committee--you know Jorge and H.L. and all--they asked me-- They want you to stand for Sheriff next election. Yeah. You'd do a good job. How 'bout you? Don't know if I'll still want it. I didn't want to be going around your back. I appreciate you telling me. ----- In the preceding conversation, were the sentences \"Sam?\" and \"I--the Committee--you know Jorge and H.L.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#81883"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Hey, what do you want to do? Grow a beard? Why not? Well, let's get your first prom under the belt, okay? What's a prom? Ever go to church? ----- In the preceding conversation, were the sentences \"Why not?\" and \"Well, let's get your first prom under the belt, okay?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#76850"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh, you assume, do ya? What do they say about assumption being the brother of all fuck-ups? It's the mother of fuck-ups, stupid! Well, excuse me, brother, mother or any other sucker, doesn't make any difference, they are still fucking guns, and they still fire fucking bullets! ----- In the preceding conversation, were the sentences \"It's the mother of fuck-ups, stupid!\" and \"Well, excuse me, brother, mother or any other sucker, doesn't make any difference, they are still fucking guns, and they still fire fucking bullets!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#69711"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: All right. Two hundred. Ha. ----- In the preceding conversation, were the sentences \"All right.\" and \"Two hundred.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#96669"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Every ship returns with a cargo of sick and dying. But with no gold! The new world proves expensive, Your Majesty. We weren't expecting immediate profits, were we? We must have faith. We must give time for time. ----- In the preceding conversation, were the sentences \"We weren't expecting immediate profits, were we?\" and \"We must have faith.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#99209"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Put that back. But I have never seen this before. I am not complete. ----- In the preceding conversation, were the sentences \"But I have never seen this before.\" and \"I am not complete.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#97727"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I can't believe it. No tracks, no sign, no spoor. Yeah, whatever they are, you'd think after they ate all those sheep they'd have to take a dump someplace...  What the hell's going on in town? ----- In the preceding conversation, were the sentences \"I can't believe it.\" and \"No tracks, no sign, no spoor.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#40995"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Is this true, Stewart? Did you really say it? Yes, I said it. Sure, I said it. I didn't say it for publication, however. ----- In the preceding conversation, were the sentences \"Did you really say it?\" and \"Yes, I said it.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#97104"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: But, you do come from a military family? I have commanded the Rhode Island Militia for a year now. My father is an ironmaster. As was I. ----- In the preceding conversation, were the sentences \"My father is an ironmaster.\" and \"As was I.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#26377"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: That's your name? And isn't it a lovely one? So sturdy, so straight -- ----- In the preceding conversation, were the sentences \"And isn't it a lovely one?\" and \"So sturdy, so straight --\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#27404"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Jason seemed to have the right stuff. Physically, anyway. Radiation, cell damage, didn't matter. He just kept going. Were you close to your father? ----- In the preceding conversation, were the sentences \"Radiation, cell damage, didn't matter.\" and \"He just kept going.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#13623"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Why are you so good at math but not in English? I'm not good at math. Just geometry. ----- In the preceding conversation, were the sentences \"I'm not good at math.\" and \"Just geometry.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#97933"
            ]
        ],
        "round#13": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: How's the Ransom account going, Marcus? It's...it's...all right. Really? That's interesting. Not great? Oh well, you know. And how's Cecilia? She's a great girl. Oh yes. I'm very lucky. ----- In the preceding conversation, were the sentences \"That's interesting.\" and \"Not great?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#69157"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Wrigley! Sorry. Sometimes I have serious doubts about you. I am very sorry. Am I mentoring the wrong mentee? No. You're not. I could be mentoring Kramer. Kramer clerked for Scalia. ----- In the preceding conversation, were the sentences \"You're not.\" and \"I could be mentoring Kramer.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#91085"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What show is this? It's the news, Buffy. Oh. Who's in it? I know what it is. It's what's on instead of the movie. I just want to see the basketball scores. It's important. Mmmnkay. ----- In the preceding conversation, were the sentences \"Who's in it?\" and \"I know what it is.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#18087"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Otho, that's terrible. My sentiments exactly. Porcelain is for teeth! ----- In the preceding conversation, were the sentences \"My sentiments exactly.\" and \"Porcelain is for teeth!\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#86359"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Transmit copy of program via satellite north uplink. Destination? Tanner-eighteen-six-two-nine. Checking connection. ----- In the preceding conversation, were the sentences \"Transmit copy of program via satellite north uplink.\" and \"Destination?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#38294"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's not a bank. It's better. It's a construction depot. They'll have the strongbox and some ammo and explosives for us to take. That way we can take on a bigger job. ----- In the preceding conversation, were the sentences \"It's a construction depot.\" and \"They'll have the strongbox and some ammo and explosives for us to take.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#30692"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Pain by nerve induction... A human can resist any pain. Our test is crisis and observation. I see the truth of it. -- REVEREND MOTHER  Could he be the one?... Maybe... but will he be ours to control? You know when people speak the truth? ----- In the preceding conversation, were the sentences \"Pain by nerve induction... A human can resist any pain.\" and \"Our test is crisis and observation.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#8623"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You're not Lenore Oberfeld. There isn't any such person. Whose money is this? It belongs to the man you took it from. Or should I saw <u>stole</u> it from? The guy with the transplant. Jack Oberfeld in person. Did you kill him? Damned if I know. The video cameras will put you with him in the bank, and I'll bet there were enough witnesses. At least one. Plus they'll remember you going after his daughter at school. You timed that beautifully. They always pick Rachel up early on Thursday. I got what I fucking deserved. I had it all. I could've kept going! As they say -- no good deed goes unpunished. And all that crap about your driver being murdered by a cop -- I thought it was inspired. There was <u>no</u> cop involved. Oh shit! Fuck! ----- In the preceding conversation, were the sentences \"Jack Oberfeld in person.\" and \"Did you kill him?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#74723"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You're leaving? Yeah. I said a week, and I've overstayed myself... You were going without saying goodbye? I didn't want to say goodbye to anyone. But what about me? I'll say goodbye to you, Tita. ----- In the preceding conversation, were the sentences \"But what about me?\" and \"I'll say goodbye to you, Tita.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#38117"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You know what the Scottish call it? No. Ishca Baha - the water of life. I went on a tour once of the finest single malt distillery in the world. Have you ever been to Scotland? No, sir. Wonderful country, wonderful golf. I wonder - will I ever go back? What do you think? I hope we all get to do many things. Can we go now? ----- In the preceding conversation, were the sentences \"What do you think?\" and \"I hope we all get to do many things.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#96267"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: \"Eloi\"? What are your people called? Well, I guess you'd call us... New Yorkers. New Yorkers. ----- In the preceding conversation, were the sentences \"What are your people called?\" and \"Well, I guess you'd call us... New Yorkers.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#55807"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: They'll probably make a run for the border, which would bring 'em this way. And if we get our hands on those shit asses, we're talking payback time. We'll get 'em all right. I gotta piss. I'm gonna use your commode. Knock yourself out. ----- In the preceding conversation, were the sentences \"They'll probably make a run for the border, which would bring 'em this way.\" and \"And if we get our hands on those shit asses, we're talking payback time.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#68653"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: The Mantan Manifesto. Catchy ain't it? Number One. We gainfully employ African Americans, in front of and behind the cameras. Two. Let the audience decide. Three. Who put these critics in charge? These so-called cultural police? Four. Who determines what is black? Five. Mantan is a satire. Six. If they can't take a joke, \"F\" 'em. We all stick to this, it's smooth sailing. ----- In the preceding conversation, were the sentences \"Six.\" and \"If they can't take a joke, \"F\" 'em.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#99509"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: This is this place called Ace Vintage, you gotta find it, I don't know exactly where this is and I don't understand these maps so just go there and check it out. It's a '61 AC Cobra that this old guy says is fine, but I need to figure out why he's only asking 23 for it. So take a look, the whole thing, call me about that, if it seems alright then I'll head down there and check it out. Ok. That's it. Can we maybe ask for more money on this? ----- In the preceding conversation, were the sentences \"That's it.\" and \"Can we maybe ask for more money on this?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#20177"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: How did he die? He was murdered. Really. Maybe that's why you're from Homicide. How? ----- In the preceding conversation, were the sentences \"He was murdered.\" and \"Really.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#23195"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Whatever it is, I'm gonna find out and sooner is a hell of lot better than later. Well, there's something missing in there. There was something around her neck when I came in there, but it's gone now. Who came in after you? Lieutenant  Quinn. ----- In the preceding conversation, were the sentences \"There was something around her neck when I came in there, but it's gone now.\" and \"Who came in after you?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#8126"
            ]
        ],
        "round#14": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Maude, I must speak to you. What is it, Harold? They're going to draft me. In the Army. I'm going to be sent away. But they can't do that. You haven't even got the vote. But they have. Well, don't go. ----- In the preceding conversation, were the sentences \"What is it, Harold?\" and \"They're going to draft me.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#75651"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You want to show this? Absolutely. The audience will stain their drawers. I did. ----- In the preceding conversation, were the sentences \"You want to show this?\" and \"Absolutely.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#84981"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I still don't see how he could be playing chess against you. There's only enough grids on the map to be half a board. That's all he needs. He's making the moves. It's an opening. I just can't remember the name. Okay, it's a game. He's starting it, so he moves first. He's white. e2-e4. ----- In the preceding conversation, were the sentences \"That's all he needs.\" and \"He's making the moves.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#83251"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What's that supposed to prove? Just a little appetizer. I want our porker to know we're serving. I want to put some iron into that big yap... ----- In the preceding conversation, were the sentences \"What's that supposed to prove?\" and \"Just a little appetizer.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#7985"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Nonsense. How can you fight the Reds and make yourself agreeable to the Whites if you don't keep up your strength. Shall I draw your bath, sir? ----- In the preceding conversation, were the sentences \"Nonsense.\" and \"How can you fight the Reds and make yourself agreeable to the Whites if you don't keep up your strength.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#75690"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: When did you start to feel this way? About six months ago, I guess it is now. God, it seems like years. What a bore! I'm embarrassed by it. Before this happened -- when I'd hear people talk about this kind of thing -- I thought it was a bunch of bullshit. ----- In the preceding conversation, were the sentences \"When did you start to feel this way?\" and \"About six months ago, I guess it is now.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#48172"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: We'll give you a heads up before we launch. How long? Three hours. You got a deal. ----- In the preceding conversation, were the sentences \"Three hours.\" and \"You got a deal.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#32021"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What about the record? Keep it. Can I call you? ----- In the preceding conversation, were the sentences \"Keep it.\" and \"Can I call you?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#58699"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: ...I've got to go home. Do you really have to go? Well... it's getting kind of late. ----- In the preceding conversation, were the sentences \"...I've got to go home.\" and \"Do you really have to go?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#10211"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Ms.  Mitchell. So nice to finally meet you in person. The President and I were delighted that we could accommodate you. Now if you're all cleared? You can follow me then. ----- In the preceding conversation, were the sentences \"Now if you're all cleared?\" and \"You can follow me then.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#15174"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You actually performed surgery...? It was an experience. Metal scalpels... needle and thread... ----- In the preceding conversation, were the sentences \"It was an experience.\" and \"Metal scalpels... needle and thread...\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#31885"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: See that. They're gone! Looks like it, don't it? Here's the woman, ma. Oh! ! ----- In the preceding conversation, were the sentences \"Looks like it, don't it?\" and \"Here's the woman, ma.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#98094"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You closed 'em today? Yes. I did. This morning. What I'm saying to you: things can change. You see? This is where you fuck up, because this is something you don't know. You can't look down the road. And see what's coming. Might be someone else, John. It might be someone new, eh? Someone new. And you can't look back. 'Cause you don't know history. You ask them. When we were at Rio Rancho, who was top man? A month...? Two months...? Eight months in twelve for three years in a row. You know what that means? You know what that means? Is that luck? Is that some, some, some purloined leads? That's skill. That's talent, that's, that's... ...yes... ...and you don't remember. 'Cause you weren't around. That's cold calling. Walk up to the door. I don't even know their name. I'm selling something they don't even want. You talk about soft sell... before we had a name for it...before we called it anything, we did it. That's right, Shel. ----- In the preceding conversation, were the sentences \"You talk about soft sell... before we had a name for it...before we called it anything, we did it.\" and \"That's right, Shel.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#33813"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Yes! Yes! The boy! One boy! And what, exactly, is your relationship to Mrs. Ryan? Neighbor! Doctor! I live across the hall. And you come into Mrs. Ryan's apartment as often as you please, looking into various health matters? Yes! Please! You've got to get out right now! ----- In the preceding conversation, were the sentences \"And what, exactly, is your relationship to Mrs. Ryan?\" and \"Neighbor!\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#54767"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What's up? Well I'm sorry. Before... Mhm. And I'm sorry that I did that. It's alright. I wanted to ask you because you're a doctor, right? Yeah. I don't like the way I am sometimes. Can you help me? WALTER Barry, I'm a dentist, what kind of help do you think I can give you? I know that. Maybe you know other doctors? Like a psychiatrist? I don't have anyone to talk to things about and I understand it's confidential with a doctor - I'm embarrassed about that and I don't want my sisters to know? You want a number for a psychiatrist, I can get you one, that's not a problem. but what exactly is wrong? I don't know if there's anything wrong with me because I don't know how other people are.....Sometimes I cry a lot.....for no reason. ----- In the preceding conversation, were the sentences \"I don't have anyone to talk to things about and I understand it's confidential with a doctor - I'm embarrassed about that and I don't want my sisters to know?\" and \"You want a number for a psychiatrist, I can get you one, that's not a problem.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#91933"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: We also own the Franklin mint, which makes decorative hand-painted theme plates for collectors. Some plates, like the Gone With The Wind series, have gone up in value as much as two-hundred and forty percent, but, as with any investment, there is some risk involved. Gentlemen, I have a plan. It's called blackmail. The Royal Family of Britain are the wealthiest landowners in the world. Either the Royal Family pays us an exorbitant amount of money, or we make it look like Prince Charles, the heir to the throne, has had an affair outside of marriage and, therefore, they would have to divorce. ----- In the preceding conversation, were the sentences \"Some plates, like the Gone With The Wind series, have gone up in value as much as two-hundred and forty percent, but, as with any investment, there is some risk involved.\" and \"Gentlemen, I have a plan.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#40856"
            ]
        ],
        "round#15": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's pretty embarrassing. I really don't know what to tell Mr. Robinson. It's awkward and strained for me every time he suggests that you call up Elaine. Next time he suggests it, I'll tell him I have no intention of ever calling her up in my life. ----- In the preceding conversation, were the sentences \"I really don't know what to tell Mr. Robinson.\" and \"It's awkward and strained for me every time he suggests that you call up Elaine.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#16422"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Uhura, hailing frequencies. Right standard rudder, bring us alongside... Right standard rudder, Z plus five degrees... ----- In the preceding conversation, were the sentences \"Uhura, hailing frequencies.\" and \"Right standard rudder, bring us alongside...\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#6172"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Local 8 just started in Penns Grove. And, Bob said he was at fight club in Newcastle last week. Newcastle? Did you start that one? I thought you did. ----- In the preceding conversation, were the sentences \"And, Bob said he was at fight club in Newcastle last week.\" and \"Newcastle?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#87671"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Don't I get any say in this? No! Because I -- That's what I say. What? What I say is, no. We don't do partners. For Christ's sake, why not? Mostly, because you scare the shit out of me. I've seen people like you before, baby. Double-tough and sharp as they come, and you get what you want or else. But you don't make it work forever. Bullshit! No; history. Sooner or later, the lightning hits. I don't want to be around when it hits you. ----- In the preceding conversation, were the sentences \"Because I --\" and \"That's what I say.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#63066"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's a good thing my family loves you. Your family just met me. You're right. I guess I was projecting. What I should have said is, \"It's a good thing I love you.\" Do you? I do. Michael, I... It's OK. You don't have to say anything. But I do. I love you, too. ----- In the preceding conversation, were the sentences \"It's OK. You don't have to say anything.\" and \"But I do.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#27969"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: My son was outside playing soccer. I never saw him playing ball. Come on, you guys -- take me out for a good time... Take me out dancing. Dancing? ----- In the preceding conversation, were the sentences \"Come on, you guys -- take me out for a good time... Take me out dancing.\" and \"Dancing?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#98433"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You don't have to have a license to work in a casino. All you gotta do is apply for one. The state law says you can work in a casino while they're processing your application. They got a ten-year backlog. But what happens when they do find out? Why would they want to find out? We're puttin' a hundred million into this desert here. Why would they want to lock us out? And besides, they'll never find out. All you gotta do is keep changing your job title. Like, uh, from Casino Executive to Food and Beverage Chairman. And what happens it, they take your application, they put it at the bottom of the pile. I know guys workin' there for thirty years, don't have a license. It's a tough proposition, Andy. You, you know, if I did it, I'd have to run it my way. You got it. I'm serious. No interference. Nobody's gonna interfere with your running the casino. I guarantee it. ----- In the preceding conversation, were the sentences \"No interference.\" and \"Nobody's gonna interfere with your running the casino.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#80497"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Do you believe you'll see your mother again? I hope so. I think maybe she sees me now. ----- In the preceding conversation, were the sentences \"I hope so.\" and \"I think maybe she sees me now.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#45761"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Bela, are you ready? Mmph? Where am I? You're shooting \"Bride Of The Atom.\" Scene 85. ----- In the preceding conversation, were the sentences \"Where am I?\" and \"You're shooting \"Bride Of The Atom.\"\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#53566"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Ugh! I hate the way she interrupts the pictures. She doesn't show 'em the proper respect. I think she's a honey. Look at those jugs. ----- In the preceding conversation, were the sentences \"Ugh!\" and \"I hate the way she interrupts the pictures.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#49651"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: That was Isla Nublar. This is Isla Sorna. The second island. I didn't know, there were two islands. ----- In the preceding conversation, were the sentences \"The second island.\" and \"I didn't know, there were two islands.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#38068"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Not you too - My God! Serafine's right. It's time to go. We'll talk soon. ----- In the preceding conversation, were the sentences \"Serafine's right.\" and \"It's time to go.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#98181"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What's in Memphis? Who knows?! That kid is totally meshuga. ----- In the preceding conversation, were the sentences \"Who knows?!\" and \"That kid is totally meshuga.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#66013"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm serious, honey. Don't get out of my sight, all right? I want you to stay right by me. Will you do that for me? Nods solemnly. GENE reaches the platform and gives out an exaggerated sigh. We made it. ----- In the preceding conversation, were the sentences \"I want you to stay right by me.\" and \"Will you do that for me?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#31008"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's outta here! Come on man. Let's just talk about it. ----- In the preceding conversation, were the sentences \"Come on man.\" and \"Let's just talk about it.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#38064"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Six to the left. One to the right. He's on vacation. We got to find the leader. Mangalores don't fight without a leader. ----- In the preceding conversation, were the sentences \"One to the right.\" and \"He's on vacation.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#71552"
            ]
        ],
        "round#16": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Yeah, well, I'm flattered, but you won't find any real meat in them. No? How come? Listen, Rog. I knew Hobbes was funny, you know? I told you that. But I didn't really know just how funny he was. See... when he kicked off, they sent all the personal secret stuff they found to his mother -- she's still alive but just barely -- and she sent everything she thought was medical to me here at the lab. I'm Hobbes's partner, right? Anyway, I've been going through his papers, and what they add up to is this: Hobbes was shafting us all, me, the university, the foundations and the councils, the private labs, everybody. We never really knew what it was we were working on. Hobbes gave us each a few crumbs, but he was the only one who knew what the whole loaf would look like. ----- In the preceding conversation, were the sentences \"I'm Hobbes's partner, right?\" and \"Anyway, I've been going through his papers, and what they add up to is this: Hobbes was shafting us all, me, the university, the foundations and the councils, the private labs, everybody.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#95192"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm quitting too. Boys, not baseball. There  might be an opening for a manager at Salem next spring. Salem, Massachusetts? Where all the witches were? Yeah...you a witch? Not yet. It takes years of practice... ----- In the preceding conversation, were the sentences \"Where all the witches were?\" and \"Yeah...you a witch?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#35032"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: How the hell long it take <u>you</u> to change a tire? Just about too damn long. Bolt pattern's probably wrong anyway. We need another plan. ----- In the preceding conversation, were the sentences \"How the hell long it take <u>you</u> to change a tire?\" and \"Just about too damn long.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#61270"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: STUFF. Got a light? What kind of \"stuff?\" ----- In the preceding conversation, were the sentences \"STUFF.\" and \"Got a light?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#26342"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: This time of year. Would you do me a favor and go to the truck? Inside that leather bag with the pockets is a package of lens cleaners. Would you grab me one? ----- In the preceding conversation, were the sentences \"Inside that leather bag with the pockets is a package of lens cleaners.\" and \"Would you grab me one?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#56306"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You ever been in a hostage situation? Only at the very end. How do you feel after a shooting. Like it had to be done. ----- In the preceding conversation, were the sentences \"How do you feel after a shooting.\" and \"Like it had to be done.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#50"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I look at you Soviet people and I feel... pity... superiority. Most of your life, your government has told you that Capitalism turns people into robots who'd rather eat microwave sushi, naked in the back of a Cadillac than hear the laughter of children. We're here to say, your government was right. So let's get busy. Have some fun and make some deals. ----- In the preceding conversation, were the sentences \"I look at you Soviet people and I feel... pity... superiority.\" and \"Most of your life, your government has told you that Capitalism turns people into robots who'd rather eat microwave sushi, naked in the back of a Cadillac than hear the laughter of children.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#73649"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Where we going? I'm trying to think of where there's a place to have a drink around here. Isn't there one in the Taft Hotel? ----- In the preceding conversation, were the sentences \"Where we going?\" and \"I'm trying to think of where there's a place to have a drink around here.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#77907"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You don't believe him? It's Mother you have to convince. He's very agitated. Wait here. ----- In the preceding conversation, were the sentences \"You don't believe him?\" and \"It's Mother you have to convince.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#7234"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Could you believe those girls! 'Nellie's Nymphos!' Jesus, that Lynette! I rode her hard and put her up wet. ----- In the preceding conversation, were the sentences \"'Nellie's Nymphos!'\" and \"Jesus, that Lynette!\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#16043"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What are these? Videotapes. I can see that. What are they? ----- In the preceding conversation, were the sentences \"What are these?\" and \"Videotapes.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#30651"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You're doing great. I don't know if I'm going to make it the whole way. It doesn't matter. Go on. Oh... this makes me sound irrational, which is probably right, but there was something about him saying this -- it was maybe the millionth time he'd told me about some preference of his. Well, I was so... tired of it. Seems like my whole life someone's been telling me... I'm just not getting it right. Can we rest for a second? ----- In the preceding conversation, were the sentences \"Well, I was so... tired of it.\" and \"Seems like my whole life someone's been telling me...\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#97609"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Most nights you wake up crying. Never knowing why. Who are you? ! ----- In the preceding conversation, were the sentences \"Never knowing why.\" and \"Who are you?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#14156"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Oh, everything's hunky-dory now that the shit hit the fan just like you said it would, you snug sonofabitch! You fuckin' jinxed us! Smug, Trip! Not snug, smug. ----- In the preceding conversation, were the sentences \"You fuckin' jinxed us!\" and \"Smug, Trip!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#44063"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Mass production is what does it. What do you mean \"mass\"... I have to come out and tell you, you're not that clean, either. Wait a minute. I'm not that neat, maybe, but I am clean. Well, you're not that bad, but some people... I mean, people's homes, just filth. I've been in people's homes... In my personal observation, I think that more people are neat than are clean... In my personal thing, I don't see that. I'm seeing more filth. A lot of filth. What they need to do every day, no, once in a while, is a cockroach thing, where they spray the homes. And uh... can you imagine, if their doors were painted a pretty color, and they had a pot outside, with... Yeah, it could be adorable... And they picked up! I mean, it wouldn't be filthy, with Coke bottles and whiskey, and those signs everywhere... ----- In the preceding conversation, were the sentences \"In my personal thing, I don't see that.\" and \"I'm seeing more filth.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#41845"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's like, you looked at my tape. You saw my picture. Why did you call me in? You knew I was twenty-four. What an asshole. ----- In the preceding conversation, were the sentences \"You saw my picture.\" and \"Why did you call me in?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#82372"
            ]
        ],
        "round#17": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: These are my children...my children. Yeah. They're great, aren't they? You can go back and see them born, go forward and see your grandchildren. Time has no meaning here. ----- In the preceding conversation, were the sentences \"Yeah.\" and \"They're great, aren't they?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#22228"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You got a comb? Don't need a comb. Few dozen cooties won't kill me, don't guess. ----- In the preceding conversation, were the sentences \"You got a comb?\" and \"Don't need a comb.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#29792"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Goddamnit Walter! You fucking asshole! Dude! Dude, I'm sorry! ----- In the preceding conversation, were the sentences \"Goddamnit Walter!\" and \"You fucking asshole!\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#42143"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: That's mustard! What? You just put mustard on your Hershey bar. Good... Pass the beer. ----- In the preceding conversation, were the sentences \"What?\" and \"You just put mustard on your Hershey bar.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#73709"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I am. I only work when I have to. Two years ago I got a notion and went to China. There was a war going on. Swell! After a while it got stale. I went down to Tahiti. Just lay on the beach for six months. What could be sweeter? Doesn't sound very exciting. ----- In the preceding conversation, were the sentences \"I only work when I have to.\" and \"Two years ago I got a notion and went to China.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#83014"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Federal Bureau of Investigation, Special Agent Chet Desmond. I'd like to ask you a few questions about Teresa Banks. Jack said you knew her. How well? She only worked here a month. Nice girl. Never seemed to get here on time though. Ask me she had a little problem with -- ----- In the preceding conversation, were the sentences \"Nice girl.\" and \"Never seemed to get here on time though.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#57117"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What now? His wife had twins and he went out to celebrate and got as drunk as a lord. They can't even find him. I tell you, drink is the ruin of this nation. You said it. So -- Sweeney gets twins -- and Earl Williams gets hanged tomorrow. ----- In the preceding conversation, were the sentences \"What now?\" and \"His wife had twins and he went out to celebrate and got as drunk as a lord.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#54314"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Are you running away? No. I'm running <u>to</u>. ----- In the preceding conversation, were the sentences \"No.\" and \"I'm running <u>to</u>.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#65564"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Did you give him a gift? No. I saw the way he looked at you. The way he kissed you. It was a play. Boys like him have -- expectations. I have expectations, too. ----- In the preceding conversation, were the sentences \"Did you give him a gift?\" and \"No.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#86529"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Do you ever wonder what happened to us, Susie? It was a long time ago, Daniel. We were young, different people, heading in different directions. That's all. ----- In the preceding conversation, were the sentences \"We were young, different people, heading in different directions.\" and \"That's all.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#60547"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What? We're hungry. You're going to cook. ----- In the preceding conversation, were the sentences \"We're hungry.\" and \"You're going to cook.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#92393"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Darling, I just heard. You poor sausage, are you all right? I'm fine. I got hot. Lady H said she thought you might be - I'm not pregnant. I'm hot. I'm too hot. Right. Aren't you? Sweltering. Come on, I'll take you home. Can't we really go home? I can't breathe. Aren't you dying for green, anything green, or rain, wouldn't you die to feel rain on your face? It's Christmas and it's all - I don't know - if you asked me I'd go home tomorrow. If you wanted. Sweetheart, you know we can't go home, there might be a war. Geoffrey, you do so love putting on a disguise. I do so love you. What do you smell of? What? Marzipan! I think you've got marzipan in your hair. No wonder you're homesick. ----- In the preceding conversation, were the sentences \"Sweltering.\" and \"Come on, I'll take you home.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#36234"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: How much? I think two million. What do you need from me? Permission? Go! If you can fleece him for two million, then do it, Kid. I need you to stake me. Stake you? I need you to stake me. I can't do it without it. It's just a couple hundred grand. Taken out of our cut when we're done. ----- In the preceding conversation, were the sentences \"Stake you?\" and \"I need you to stake me.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#44404"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Is it possible to bring you back to reality for a moment? I must have a complete report of your negotiations and a detailed expense account. Don't ask for it, Ninotchka. There is a Turkish proverb which says, \"If something smells bad, why put your nose in it?\" And there is a Russian saying: \"The cat who has cream on his whiskers had better find good excuses.\" With our cream situation what it is, it is Russia which should apologize to the cats. Friends... friends, Buljanoff, Iranoff... ----- In the preceding conversation, were the sentences \"I must have a complete report of your negotiations and a detailed expense account.\" and \"Don't ask for it, Ninotchka.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#44942"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Jack gave hisself up for the sake of his loyal crew. He was marooned on an island, left there to die. How did he get off the island? ----- In the preceding conversation, were the sentences \"He was marooned on an island, left there to die.\" and \"How did he get off the island?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#82106"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Don't mind him, Sheriff. Boy's just a bit slow, is all. He don't mean nothin' by it-- That the problem, son? You Slow? Otis, apologize to the Sheriff-- ----- In the preceding conversation, were the sentences \"Boy's just a bit slow, is all.\" and \"He don't mean nothin' by it--\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#9056"
            ]
        ],
        "round#18": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Wish I could take the credit, but -- -- guess we know where Mr. Price is now. He must've beaten us all here! ----- In the preceding conversation, were the sentences \"-- guess we know where Mr. Price is now.\" and \"He must've beaten us all here!\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#52056"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Come on Serafine. Let's go out. Show me the real Paris, the part that isn't overpriced and overrun with German tourists. Go to Jim Morrison's grave at Pere Lachaise. It's overrun with American tourists. I have to work. I know! Let's go hock loogies off the Eiffel Tower! ----- In the preceding conversation, were the sentences \"I know!\" and \"Let's go hock loogies off the Eiffel Tower!\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#74666"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What did I tell you? It's great and everything, but what am I going to do with all this? Sell it? ----- In the preceding conversation, were the sentences \"It's great and everything, but what am I going to do with all this?\" and \"Sell it?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#16728"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Let's have your name and address. The government will want to send you a letter of commendation. Who the fuck you kidding? Send me money! ----- In the preceding conversation, were the sentences \"The government will want to send you a letter of commendation.\" and \"Who the fuck you kidding?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#11929"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Tonight, somewhere in the city, innocent people will die--but then one of you knows that; for one of you is a vicious pirate-terrorist posing as the beloved superhero Captain God. What did you say? Selina, sit down, the entire city is going crazy...You have to just calm down... ----- In the preceding conversation, were the sentences \"What did you say?\" and \"Selina, sit down, the entire city is going crazy...You have to just calm down...\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#17165"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You haven't been drinking, have you? No. Just O.J. ----- In the preceding conversation, were the sentences \"No.\" and \"Just O.J.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#70139"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Why were you buying a coffin? Because I'm planning on dying soon. Really? Yes. I'm embarking on another bus- andótruck tour of \"Dracula.\" Twelve cities in ten days, if that's conceivable. ----- In the preceding conversation, were the sentences \"Because I'm planning on dying soon.\" and \"Really?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#21"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I want you to start your work for the last phase of the campaign. I will, Marcus. But you're going to be well enough to direct it yourself. I've made so many mistakes, Narcissus. We all put off the very last duties of our lives because we're afraid of admitting when our lives are over. There's no reason to say that. Everyone knows you're going to be well. I had Servis groom your horse for a triumphal visit to the front at first light. Servis made it through again? He's like you, sir, too tough for the Gods to swallow. ----- In the preceding conversation, were the sentences \"But you're going to be well enough to direct it yourself.\" and \"I've made so many mistakes, Narcissus.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#64600"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Okay. I just thought as long as it was paid for -- Don't ever talk like that, Fran! Don't make yourself out to be cheap. A hundred dollars? I wouldn't call that cheap. And you must be paying somebody something for the use of the apartment -- Stop that, Fran. You'll miss your train, Jeff. ----- In the preceding conversation, were the sentences \"I wouldn't call that cheap.\" and \"And you must be paying somebody something for the use of the apartment --\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#39399"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: You are being rude again. I want to sleep. Give me five minutes on that couch. Nine-thirty. General von Pfeffinger should be at his desk by now. Shall we call Berlin and tell him the good news? I didn't do it. I didn't do it. ----- In the preceding conversation, were the sentences \"I want to sleep.\" and \"Give me five minutes on that couch.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#69466"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: OKAY, GOING UP. ICE, GO HIGH. LOOK OUT! ----- In the preceding conversation, were the sentences \"OKAY, GOING UP.\" and \"ICE, GO HIGH.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#48250"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: And Leonitchka! What she said about us...! And they might believe her in Moscow. What do you mean they might -- they will! ----- In the preceding conversation, were the sentences \"What she said about us...!\" and \"And they might believe her in Moscow.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#4214"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Well done, sir. Very neat. That's what I think of it, Bingy! ----- In the preceding conversation, were the sentences \"Very neat.\" and \"That's what I think of it, Bingy!\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#48343"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Doctor. Now, if you were a flavor of ice cream, what would you be? Rocky Road. ----- In the preceding conversation, were the sentences \"Now, if you were a flavor of ice cream, what would you be?\" and \"Rocky Road.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#10038"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: ... It was a great city. The greatest city in the world. You liked it there. Oh, very much...  ... I used to work somewhere in that direction, I think. A huge university where we taught everything from botany to history to literature. Learning was important? Oh very. Learning, commerce, the arts -- the whole place was buzzing all the time. Night and day. Did you have fires at night? Only to keep warm. For illumination we had gaslights on most of the streets and a new invention called electrical lighting that made it seem like daylight all through the night. It must have been safe. Oh, it was...  ... Most of the time. It sounds like a wonderful place to live. Looking back... I suppose it was. I didn't quite realize it at the time but... ----- In the preceding conversation, were the sentences \"I suppose it was.\" and \"I didn't quite realize it at the time but...\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#73132"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Remember that thing a few years back? That thing with the cab? What thing? Cabbie drove around all night. Three people got killed. Oh, right. The guy flipped out or something? Killed some people, then put a gun to his own head? They found him dead in his own cab down by the Port Authority. So? It was a random thing. I never bought that. Oh? Cabbie had no criminal record, no history of mental illness. Suddenly, he just wigs out and pops three people, then himself? Plus the victims weren't random solid citizens. They were all lowlives. Wiseguys. I've always wondered if there was someone else in the cab. ----- In the preceding conversation, were the sentences \"It was a random thing.\" and \"I never bought that.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#313"
            ]
        ],
        "round#19": [
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Merry Christmas. Merry Christmas yourself, <u>Officer</u>. That obvious, huh? It's practically stamped on your forehead. ----- In the preceding conversation, were the sentences \"Merry Christmas.\" and \"Merry Christmas yourself, <u>Officer</u>.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#42914"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: That ought to be fun. Fun? Say, listen, I'll take you on a bender that will live in your memory as a thing of beauty and joy forever. Boy! Boy! My headpiece! ----- In the preceding conversation, were the sentences \"That ought to be fun.\" and \"Fun?\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#99494"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Good morning, Colonel. Morning, Radar. How were things? Splendid, sir. No problems. Morning, Captain. ----- In the preceding conversation, were the sentences \"No problems.\" and \"Morning, Captain.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#81967"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Dad! What happened? What happened? Who did this to you? Mommy. I'm gonna get a knife and cut you loose, honey, I'll - Oh, no, please, please. ----- In the preceding conversation, were the sentences \"What happened?\" and \"What happened?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#99934"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Run for it? Running's not a plan. Running is what you do when the plan fails. You're not even trying to come up with a plan! Well, it's not like we've got a hell of a lot of options... ----- In the preceding conversation, were the sentences \"Running's not a plan.\" and \"Running is what you do when the plan fails.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#19202"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: They've been coming in steady all morning. I have called for some extra police. All right. Send down to the vaults and have our reserve cash sent up here right away. We haven't much on hand, you know. If it gets any worse, I hope we don't have to close the doors. ----- In the preceding conversation, were the sentences \"I have called for some extra police.\" and \"All right.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#91649"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Professor? Professor Brown? You know me? ----- In the preceding conversation, were the sentences \"Professor?\" and \"Professor Brown?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#45563"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I heard rumors you were back. About Kip ... He's gotten involved -- ----- In the preceding conversation, were the sentences \"I heard rumors you were back.\" and \"About Kip ...\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#74736"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What should we get? I don't care. You pick. Hot dogs. ----- In the preceding conversation, were the sentences \"What should we get?\" and \"I don't care.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#52935"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Don't let Victor push you into making a mistake -- He was going to take away all my data, equipment -- Better than your life. Victor's not the one who has to get into that thing. We are. ----- In the preceding conversation, were the sentences \"Better than your life.\" and \"Victor's not the one who has to get into that thing.\" said by the same or different individuals?\nAnswer:",
                [
                    "different"
                ],
                "movie_dialog_same_or_different|all|default|#58905"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I'm honored, Dick, that you've come all this way out here to Virginia to visit us at last. My friends call me \"Mister President.\" And so shall I. Arrange some coffee, would you General Cushman? ----- In the preceding conversation, were the sentences \"And so shall I.\" and \"Arrange some coffee, would you General Cushman?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#17549"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: It's a commercial area. No one lives there. But he had to dump the body there to make the move. ----- In the preceding conversation, were the sentences \"It's a commercial area.\" and \"No one lives there.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#33642"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: What's this about merchandising? You always hated merchandising! Well, baby, I do, but to look at it from another angle...there's a <u>potload</u> of money here. ----- In the preceding conversation, were the sentences \"What's this about merchandising?\" and \"You always hated merchandising!\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#25978"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: But Bowery's fine, if that's what you want. We taking bets? What if you're wrong? The ride is free. You got a deal. ----- In the preceding conversation, were the sentences \"But Bowery's fine, if that's what you want.\" and \"We taking bets?\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#91503"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: I can't! You know you must. There is only one. Now you are that one. It is time. Why? Why me? She has died. You are the next to be called. Why do you think you were sent to me? Trained as you were? You bear the mark. ----- In the preceding conversation, were the sentences \"Now you are that one.\" and \"It is time.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#34307"
            ],
            [
                "The following is a conversation between two people, but the transcript doesn't mark who said what: Tom, bottom line: I let those kids go out there. If JAG shows up and I don't have any answers for them, my career is finished -- I'm not gonna let that happen. ----- In the preceding conversation, were the sentences \"If JAG shows up and I don't have any answers for them, my career is finished --\" and \"I'm not gonna let that happen.\" said by the same or different individuals?\nAnswer:",
                [
                    "same"
                ],
                "movie_dialog_same_or_different|all|default|#46015"
            ]
        ]
    }
}